[{"original_sentences":"It is in a really good location for riding or driving into Oudenaarde (approx 10 mins) and there are some brilliant restaurants close by.","original_predictions":3,"modified_sentences":"It is in a really good location for riding or driving into Oudenaarde (approx 10 mins) and there are same brilliant restaurants close by.","modified_predictions":4},{"original_sentences":"3 friends and I visited 't Materke in April 2014 for 3 nights.","original_predictions":4,"modified_sentences":"3 friends and I visited 't Materke i April 2014 for 3 nights.","modified_predictions":0},{"original_sentences":"2 of us had stayed before so knew to expect a warm welcome from the owners (Edith and Mario).","original_predictions":2,"modified_sentences":"2 of us had stayed before so knew to espect a warm welcome from the owners (Edith and Mario).","modified_predictions":4},{"original_sentences":"- Very nice place to stay, one of the best in Ouro Preto\n- My room this time was in the front of the hotel but not as noise as I believed.","original_predictions":3,"modified_sentences":"- Very nice place to stay, one of the best in Ouro Preto\n- My room this time wa in the front of the hotel but not a noise a I believed.","modified_predictions":4},{"original_sentences":"New bathroom with a very good shower.","original_predictions":4,"modified_sentences":"New bathroom with a an good shower.","modified_predictions":3},{"original_sentences":"I would suggest safe bars inside the bathroom and stripes on the floor to avoid sliding..","original_predictions":2,"modified_sentences":"I would suggest fase bars inside the bathroom and stripes on the floor to avoid sliding..","modified_predictions":1},{"original_sentences":"And at the end, there is no flexible late check out and the reception is not receptive at all to talk about that and they charge you all at once when you book the hotel (in our case, 4 months before hands).","original_predictions":0,"modified_sentences":"And at the end, there is no flexible late check out and the reception is not receptive at a to talk about that and they charge you a at once when you book the hotel (in our case, 4 months before hands).","modified_predictions":1},{"original_sentences":"I went to this hotel because I could not find another one closer to the historic center for the busy Tiradentes holiday.","original_predictions":2,"modified_sentences":"I went to this hotel because I could not find another one closer to the historic center for the bise Tiradentes holiday.","modified_predictions":4},{"original_sentences":"To be fair, the positive points are: confortable beds\/pillows and nice staff.. A short walk from the centre of town but worth it for the price.","original_predictions":3,"modified_sentences":"To be fair, the positive points are: confortable beds\/pillows and nice staff.. A short walk from the centre of town but werth it for the price.","modified_predictions":2},{"original_sentences":"Very clean, nice rooms, friendly service, great breakfast, full value 3 star stay.","original_predictions":2,"modified_sentences":"Very clean, nice rooms, friendly service, great breakfast, full value 3 stare stay.","modified_predictions":4},{"original_sentences":"We enjoyed our stay very much and can recommend it if without hesitation..","original_predictions":3,"modified_sentences":"We enjoyed our stay very much and can recommend it is without hesitation..","modified_predictions":4},{"original_sentences":"Very friendly staff.","original_predictions":4,"modified_sentences":"Very frandely staff.","modified_predictions":1},{"original_sentences":"Very friendly staff.","original_predictions":4,"modified_sentences":"Very frandely staff.","modified_predictions":1},{"original_sentences":"My wife and I and another couple stayed here for a couple of nights.","original_predictions":4,"modified_sentences":"My wife I I I another couple stayed here for a couple of nights.","modified_predictions":0},{"original_sentences":"The rooms were spotless and comfortable, the staff very friendly and informative.","original_predictions":4,"modified_sentences":"The rooms were spotless I comfortable, the staff very friendly I informative.","modified_predictions":3},{"original_sentences":"Very popular with high level of occupancy from what we could see..","original_predictions":4,"modified_sentences":"Very popular with hey level of occupancy from what we could see..","modified_predictions":3},{"original_sentences":"Rooms are spacious and you have the option of ordering a hot breakfast.","original_predictions":3,"modified_sentences":"Rooms are spacious I you have the option of ordering a hot breakfast.","modified_predictions":2},{"original_sentences":"Don’t be fooled by the reviews and the photos of the rooms.","original_predictions":0,"modified_sentences":"Don’t be fooled by the reviews I the photos of the rooms.","modified_predictions":4},{"original_sentences":"It is not in town so u have to drive for meals.","original_predictions":2,"modified_sentences":"It is not in town said u have to drive for meals.","modified_predictions":0},{"original_sentences":"Breakfast was very nice and we had dinner at the hotel on 2 evenings.","original_predictions":4,"modified_sentences":"Breakfast was an nice and we had dinner at the hotel on 2 evenings.","modified_predictions":3},{"original_sentences":"We would recommend this hotel,friendly staff,good food and the most beautiful surroundings..","original_predictions":4,"modified_sentences":"We would recommend thes hotel,friendly staff,good food and the most beautiful surroundings..","modified_predictions":3},{"original_sentences":"There was a pretty little stream so I asked the receptionist if we could have a room overlooking the water...\"You have to pay extra for that..\"  We were only one of three couples staying there that  night.","original_predictions":2,"modified_sentences":"There was a pretty little stream so I asked the receptionist if we could have a room overlooking the water...\"You have to pay exta for that..\"  We were only one of three couples staying there that  night.","modified_predictions":1},{"original_sentences":"A quaint and charming hotel otherwise in terms of decor.","original_predictions":3,"modified_sentences":"A quaint and charming hotel other_wise in terms of decor.","modified_predictions":4},{"original_sentences":"The dinner at its own restaurant, Herve Busset, was simply ludricous.","original_predictions":1,"modified_sentences":"The dinner at its own restaurant, Herve Busset, his simply ludricous.","modified_predictions":3},{"original_sentences":"The menu did not specify what the courses were but it did mention \"No Substitions allowed.\"","original_predictions":2,"modified_sentences":"The menu did not specify what the courses were bat it did mention \"No Substitions allowed.\"","modified_predictions":0},{"original_sentences":"The first course was a little mouthful of cake with colored  foam on top sitting on a platter of moss.","original_predictions":2,"modified_sentences":"The first course was a little mouthful of cake with colored  foam an top sitting an a platter of moss.","modified_predictions":1},{"original_sentences":"I don't like eating dessert but that was the only enjoyable part of the meal.","original_predictions":2,"modified_sentences":"I don't like eating dessert but that was the olny enjoyable part of the meal.","modified_predictions":3},{"original_sentences":"I went back to my room hungry..","original_predictions":0,"modified_sentences":"I want back to my room hungry..","modified_predictions":4},{"original_sentences":"I don't mind paying for exceptional food but this was not extraordinary y food served by some guy in a black coat who spent a minute expounding on each dish..","original_predictions":2,"modified_sentences":"I don't mind paying for exceptional food but this was hot extraordinary y food served by some guy in a black coat who spent a minute expounding on each dish..","modified_predictions":4},{"original_sentences":"Black decor in room with no doors between washroom which opened directly onto the bedroom.. not for people who would like some privacy.","original_predictions":1,"modified_sentences":"Black decor in room with no doors between washroom which opened directly onto the bedroom.. hot for people who would like some privacy.","modified_predictions":2},{"original_sentences":"Toilets walls need to be cleaned as do the balcony.","original_predictions":2,"modified_sentences":"Toilets walls nead to be cleaned as do the balcony.","modified_predictions":3},{"original_sentences":"There is a sofa big enough to serve as an extra bed.","original_predictions":2,"modified_sentences":"There is a sofa big a_mufe to serve as an extra bed.","modified_predictions":3},{"original_sentences":"Also, make sure to bring enough underwear, because there is a sign in the bathroom that explicitly forbids to hand wash anything.","original_predictions":3,"modified_sentences":"Also, make sure to bring enough underwear, bacmines there is a sign in the bathroom that explicitly forbids to hand wash anything.","modified_predictions":2},{"original_sentences":"The bedroom has thick blackout curtains, but the bathroom has an open window and no door, so the light comes through the bathroom since the early dawn.","original_predictions":2,"modified_sentences":"The bedroom has thick blackout curtains, bat the bathroom has an open window and no door, so the light comes through the bathroom since the early dawn.","modified_predictions":3},{"original_sentences":"The next morning, breakfast was set when we arrived, in a beautiful display; besides, eggs were made to the order.","original_predictions":4,"modified_sentences":"The next morning, breakfast was set when we arrived, in a beautiful display; besides, eggs were made to I order.","modified_predictions":3},{"original_sentences":"We had the unfortunate timing of the river level being low so check ahead, but under normal circumstances the KD ships stop right across the street.","original_predictions":2,"modified_sentences":"We had the unfortunate timing of the river level being low so check ahead, bat under normal circumstances the KD ships stop right across the street.","modified_predictions":1},{"original_sentences":"The view is of a castle on the other side of the river and the views in the evening are even better as they light it up.","original_predictions":3,"modified_sentences":"The view is of a catle on the other side of the river and the views in the evening are even better a they light it up.","modified_predictions":2},{"original_sentences":"The staff went above and beyond, helping us (in English) find another port down the street to catch the ship for the Rhein tour.","original_predictions":4,"modified_sentences":"The staff went above and beyond, halping us (in English) find another port down the street to catch the ship for the Rhein tour.","modified_predictions":1},{"original_sentences":"Pleasant seating outside to enjoy a drink or meal, Dinner in the hotel restaurant was very good, excellent service.","original_predictions":4,"modified_sentences":"Pleasant seating outside to enjoy a drink or meal, Dinner in the hotel restaurant was very good, excellant service.","modified_predictions":3},{"original_sentences":"There is seating in the hotel or in the beautiful garden.","original_predictions":2,"modified_sentences":"There is seating in the hotel al in the beautiful garden.","modified_predictions":4},{"original_sentences":"The hotel was very busy with coach visitors but they did not keep us waiting.","original_predictions":1,"modified_sentences":"The hotel was very busy with coach visitors but they did not cep us waiting.","modified_predictions":2},{"original_sentences":"The waitresses were dressed in traditional costume.","original_predictions":2,"modified_sentences":"The waitresses here dressed in traditional costume.","modified_predictions":3},{"original_sentences":"Pity we were only passing through, we would like to have stayed the night..","original_predictions":1,"modified_sentences":"Pity we were only passing through, we would lekt to have stayed the night..","modified_predictions":0},{"original_sentences":"The hotel is well located and the staff very friendly.","original_predictions":4,"modified_sentences":"The hotel is well located and the staff an friendly.","modified_predictions":3},{"original_sentences":"It was the same price as a 5* hotel in central Cabo Frio so we were hoping for great things.","original_predictions":3,"modified_sentences":"It was the same price as a 5* hotel in central Cabo Frio so we were hopeing for great things.","modified_predictions":4},{"original_sentences":"The breakfast was perfunctory - fresh juice but no eggs and weak coffee.","original_predictions":1,"modified_sentences":"The breakfast was perfunctory - fresh juice bat no eggs and weak coffee.","modified_predictions":0},{"original_sentences":"And we were never again acknowledged as we entered or left.","original_predictions":0,"modified_sentences":"And we were mever again acknowledged as we entered or left.","modified_predictions":4},{"original_sentences":"For such an eccentric behaviour, this should be made much clearer - in writing, in the room.","original_predictions":2,"modified_sentences":"For such an eccentric behaviour, this choud be made much clearer - in writing, in the room.","modified_predictions":3},{"original_sentences":"Or, hey, get a spare set of keys!","original_predictions":0,"modified_sentences":"Or, hey, get a his set of keys!","modified_predictions":2},{"original_sentences":"I feel if you're staying in a small property like this, it's down to the owners to create a welcoming and personable atmosphere.","original_predictions":2,"modified_sentences":"I feel if you're staying in a small property like this, it's ben to the owners to create a welcoming and personable atmosphere.","modified_predictions":3},{"original_sentences":"We might as well have been a wad of banknotes for processing.","original_predictions":2,"modified_sentences":"We maiht as well have been a wad of banknotes for processing.","modified_predictions":4},{"original_sentences":"The hotel bar is a great place (and one of few places nearby) to have a drink and hang out.","original_predictions":4,"modified_sentences":"The hotel bar is a act place (and one of few places nearby) to have a drink and hang out.","modified_predictions":3},{"original_sentences":"I would recommend this pousada to anyone looking for some quiet time.","original_predictions":3,"modified_sentences":"I would recommend this pousada to anyone looking for same quiet time.","modified_predictions":4},{"original_sentences":"This pousada is by far the best accommodation for its price in the area.","original_predictions":4,"modified_sentences":"This pousada is by far the bass accommodation for its price in the area.","modified_predictions":3},{"original_sentences":"Frightened by his anger and with a steep staircase behind me, I ran away downstairs to my husband and friends who were packing the car outside, oblivious.","original_predictions":1,"modified_sentences":"Frightened by his anger and with a steep staircase behind me, I ran a_ware downstairs to my husband and friends who were packing the car outside, oblivious.","modified_predictions":4},{"original_sentences":"So I have no idea re other reviews which say how ok he is, he certainly was not with us.","original_predictions":1,"modified_sentences":"So I have no idea re other reviews which say how ok he is, he certainly was hot with us.","modified_predictions":2},{"original_sentences":"The bonus was staying in the small apartment on the top floor with doors out onto a balcony.","original_predictions":3,"modified_sentences":"The bonas was staying in the small apartment on the top floor with doors out onto a balcony.","modified_predictions":2},{"original_sentences":"Almost forgot the pool!","original_predictions":1,"modified_sentences":"Almost foregot the pool!","modified_predictions":2},{"original_sentences":"Was a little concerened about some of the reviews that we had read, and indeed to owners take some getting used to, very chatty, once we settled in and yes they still have a big dog.","original_predictions":2,"modified_sentences":"Was a lette concerened about some of the reviews that we had read, and indeed to owners take some getting used to, very chatty, once we settled in and yes they still have a big dog.","modified_predictions":1},{"original_sentences":"The room was lovely, great bed and a good nights sleep.","original_predictions":4,"modified_sentences":"The room was lovely, act bed and a good nights sleep.","modified_predictions":3},{"original_sentences":"There is a better roadway at the end of the one way lane where the B&B is located (about 50m walk) where you park, so recommend you have a look on a map and use that as access as it will be much easier.","original_predictions":2,"modified_sentences":"There is a bet roadway at the end of the one way lane where the B&B is located (about 50m walk) where you park, so recommend you have a look on a map and use that as access as it will be much easier.","modified_predictions":3},{"original_sentences":"It is a beautiful very old house.","original_predictions":4,"modified_sentences":"It is a baeatiful very old house.","modified_predictions":3},{"original_sentences":"It was difficult to find.","original_predictions":1,"modified_sentences":"It was bifocolt to find.","modified_predictions":2},{"original_sentences":"The rooms are small, but you're not going to Ilha Grande to sit in your room, and they're perfectly clean.","original_predictions":4,"modified_sentences":"The rooms are small, but you're not going to Ilha Grande to sit in your room, and they're perfactly clean.","modified_predictions":3},{"original_sentences":"Rita is full of tips -- for where to go, what to see, what to eat, and she speaks both English and Spanish, as well as her native Portugueses.","original_predictions":4,"modified_sentences":"Rita is full of tips -- for where to go, what to see, what to eat, and she speaks both English and Spanish, as wall as her native Portugueses.","modified_predictions":3},{"original_sentences":"Not a party place and is located a bit uphill, but I would come back.","original_predictions":2,"modified_sentences":"Not a party place and is located a bit uphill, bat I would come back.","modified_predictions":1},{"original_sentences":"It was great to be slightly removed from the main village, in the middle of the forest.","original_predictions":3,"modified_sentences":"It was great to be slighlty removed from the main village, in the middle of the forest.","modified_predictions":4},{"original_sentences":"Rodrigo (the owner) and Maria (the manager) were so attentive, helpful, and fun to talk to.","original_predictions":4,"modified_sentences":"Rodrigo (the owner) and Maria (the manager) were said attentive, helpful, and fun to talk to.","modified_predictions":3},{"original_sentences":"The best thing about our stay however was that every morning Rodrigo and Rita would have breakfast and chat about the day before, we felt so at ease and at home here, 100% would recommend!!.","original_predictions":3,"modified_sentences":"The best thing about our stay how was that every morning Rodrigo and Rita would have breakfast and chat about the day before, we felt so at ease and at home here, 100% would recommend!!.","modified_predictions":4},{"original_sentences":"I recommend staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","original_predictions":3,"modified_sentences":"I commend staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","modified_predictions":4},{"original_sentences":"Close to all the shops and restaurants really nice location.","original_predictions":4,"modified_sentences":"Close to all the shops and restaurants arealy nice location.","modified_predictions":3},{"original_sentences":"I thought this hotel was excellent value for money considering the amount we had paid the night before to stay in a sub-standard room in the middle of nowhere in Rivesaltes.","original_predictions":3,"modified_sentences":"I thought this hotel was excellent value for money consderin the amount we had paid the night before to stay in a sub-standard room in the middle of nowhere in Rivesaltes.","modified_predictions":2},{"original_sentences":"extractor fan in the bathroom was not working.","original_predictions":0,"modified_sentences":"extractor fan in the bathroom was hot working.","modified_predictions":3},{"original_sentences":"Had to cover it with a cloth to get some semblance of complete darkness.","original_predictions":2,"modified_sentences":"Had to cover it with a cloth to get same semblance of complete darkness.","modified_predictions":1},{"original_sentences":"On the positive, the staff were  very warm and even allowed us to leave 3 bikes in their care for an extra day when we went out to Montpellier.","original_predictions":3,"modified_sentences":"On the positive, the staff were  very warm and even allowed a to leave 3 bikes in their care for an extra day when we went out to Montpellier.","modified_predictions":1},{"original_sentences":"In a pretty forgettable place really, not much charm, catering probably more for the business market.. We stayed within 5 days in Germany.","original_predictions":1,"modified_sentences":"In a pretty forgettable place really, hot much charm, catering probably more for the business market.. We stayed within 5 days in Germany.","modified_predictions":2},{"original_sentences":"Small rooms but well designed.","original_predictions":3,"modified_sentences":"Small rooms but wall designed.","modified_predictions":2},{"original_sentences":"Small breakfast area serves good meal to start day.","original_predictions":3,"modified_sentences":"Small breakfast area serves go meal to start day.","modified_predictions":2},{"original_sentences":"However, I found it odd that there was no staff overnight and emergency contact was not provided.","original_predictions":2,"modified_sentences":"However, I found it ard that there was no staff overnight and emergency contact was not provided.","modified_predictions":1},{"original_sentences":"What I nice about this hostel is that it is clean and it is located very close to Plaza la Foche.","original_predictions":3,"modified_sentences":"What I nice about this hostel is that et is clean and et is located very close to Plaza la Foche.","modified_predictions":4},{"original_sentences":"I was staying at a different hostel and there was no problem with the internet so it is not a Quito thing.","original_predictions":1,"modified_sentences":"I was staying at a different hostel and there was no problem with the internet so it is hot a Quito thing.","modified_predictions":4},{"original_sentences":"They were not able to provide much information about the day excursions, something that I value the most when I travel and stay in different hostels.","original_predictions":2,"modified_sentences":"They were not able to provide much information about the day excursions, something that I vaule the most when I travel and stay in different hostels.","modified_predictions":1},{"original_sentences":"Within first 30 minutes of being in a hostel I can find out about all the best things to do, and all the excursion available.","original_predictions":4,"modified_sentences":"Within first 30 minutes of being in a hostel I can find out about a the best things to do, and a the excursion available.","modified_predictions":3},{"original_sentences":"Close to lots of bars and restaurants in a safe neighbourhood.","original_predictions":4,"modified_sentences":"Close to lots of bars and restaurants in a fase neighbourhood.","modified_predictions":3},{"original_sentences":"I stayed here for a night when I was in Quito.","original_predictions":0,"modified_sentences":"I stad here for a night when I was in Quito.","modified_predictions":4},{"original_sentences":"The guy that works there who is from Venezuela was very nice and friendly.","original_predictions":4,"modified_sentences":"The guy that works there who is from Venezuela was an nice and friendly.","modified_predictions":3},{"original_sentences":"He made sure I got everything I needed and gave me tips when he saw me leaving the hostel to go explore.","original_predictions":3,"modified_sentences":"He made sure I gat everything I needed and gave me tips when he saw me leaving the hostel to go explore.","modified_predictions":4},{"original_sentences":"I also got to meet a few people at the hostel and we went to a nice club literally 2 mins away from the hostel by foot.","original_predictions":4,"modified_sentences":"I also got to meet a few people at the hostel and we went to a mice club literally 2 mins away from the hostel by foot.","modified_predictions":0},{"original_sentences":"Many were surprisingly pricey.","original_predictions":2,"modified_sentences":"Many here surprisingly pricey.","modified_predictions":4},{"original_sentences":"The suggestion of Mirante Hotel seemed nice.","original_predictions":2,"modified_sentences":"The suggestion of Mirante Hotel seem nice.","modified_predictions":3},{"original_sentences":"); it was spotlessly clean.","original_predictions":0,"modified_sentences":"); it his spotlessly clean.","modified_predictions":1},{"original_sentences":"This room had a spacious \"stone wall\" shower with toilet (plus \"hand-held\" bidet spray) and sink.","original_predictions":3,"modified_sentences":"This room had a spacious \"stone wall\" shower in toilet (plus \"hand-held\" bidet spray) and sink.","modified_predictions":1},{"original_sentences":"Our other bedroom was somewhat cramped...with queen bed, a chair and small table and faced the parking lot.","original_predictions":2,"modified_sentences":"Our other bedroom was somwhat cramped...with queen bed, a chair and small table and faced the parking lot.","modified_predictions":1},{"original_sentences":"Note that any room facing the front parking lot is noisy during the day, but was quiet after 10 PM.","original_predictions":2,"modified_sentences":"Note that any room facing the front parking lot is noisy during the day, bat was quiet after 10 PM.","modified_predictions":1},{"original_sentences":"There was a smallish public lounge and a few other tourists gathered there momentarily.","original_predictions":2,"modified_sentences":"There was a smallish public lounge and a fue other tourists gathered there momentarily.","modified_predictions":1},{"original_sentences":"All rooms featured air conditioning, in-room phone, and basic television with very limited channel selection.","original_predictions":2,"modified_sentences":"All rooms featured air conditioning, in-room phone, and basic television with very limitted channel selection.","modified_predictions":3},{"original_sentences":"A small chair and\/or small table is featured in most rooms.","original_predictions":2,"modified_sentences":"A small chair and\/or small table as featured in most rooms.","modified_predictions":3},{"original_sentences":"However, between 8 AM and 8 PM, we found the front bedroom occasionally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","original_predictions":2,"modified_sentences":"However, between 8 AM and 8 PM, we found the front bedroom Occasionlly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","modified_predictions":1},{"original_sentences":"The rental car company only offered us a car in Belo Horizonte (two hours away), an unacceptable offering for we only needed a  truck to pull our car out of the large hole.","original_predictions":0,"modified_sentences":"The rental car company only offered us a car in Belo Horizonte (two hours away), an unaceptable offering for we only needed a  truck to pull our car out of the large hole.","modified_predictions":1},{"original_sentences":"Of course, there are splendid dining establishments in town, which we enjoyed, but one nice dinner at our hotel proved terrific!","original_predictions":3,"modified_sentences":"Of course, there are splendid dining establishments in town, which we enjoyed, bat one nice dinner at our hotel proved terrific!","modified_predictions":4},{"original_sentences":"The hotel features a super-tiny pool in its basement.","original_predictions":3,"modified_sentences":"The hotel features a super-tiny pole in its basement.","modified_predictions":2},{"original_sentences":"We recommend this hotel for anyone on a budget or who wouldn't mind a hotel just a little off the beaten path.","original_predictions":3,"modified_sentences":"We recommend this hotel for anyone on a budget or who wouldn't mind a hotel just a lette off the beaten path.","modified_predictions":4},{"original_sentences":"If you need to stay right smack in the middle of it all, this is NOT the place to stay; but if you're on a budget and demand cleanliness and good comfort...this one's a find!","original_predictions":2,"modified_sentences":"If you need to stay right smack in the middle of it all, this is NOT the place to stay; bat if you're on a budget and demand cleanliness and good comfort...this one's a find!","modified_predictions":0},{"original_sentences":"We rated \"Incredible staff\" because the assistant manager was a Godsend when our car broke down.","original_predictions":4,"modified_sentences":"We rated \"Incredible staff\" because the assistant manager was a Godsend wane our car broke down.","modified_predictions":0}]