[{"original_sentence":"It is in a really good location for riding or driving into Oudenaarde (approx 10 mins) and there are some brilliant restaurants close by.","original_prediction":3,"modified_sentence":["It is in a really good location for riding or driving into Oudenaarde (approx 10 mins) and there are same brilliant restaurants close by.","It is in a really good location for riding or driving into Oudenaarde (approx 10 mins) and there are sane brilliant restaurants close by.","It is in a really good location for riding or driving into Oudenaarde (approx 10 mins) and there are so brilliant restaurants close by."],"modified_prediction":[4,4,4]},{"original_sentence":"I cannot recommend this place enough!.","original_prediction":0,"modified_sentence":["I cannto recommend this place enough!.","I canot recommend this place enough!.","I carnot recommend this place enough!."],"modified_prediction":[4,4,4]},{"original_sentence":"3 friends and I visited 't Materke in April 2014 for 3 nights.","original_prediction":4,"modified_sentence":["3 friends and I visited 't Materke i April 2014 for 3 nights.","3 friends and I visited 't Materke if April 2014 for 3 nights.","3 friends and I visited 't Materke is April 2014 for 3 nights.","3 friends and I visited 't Materke it April 2014 for 3 nights."],"modified_prediction":[0,0,0,0]},{"original_sentence":"2 of us had stayed before so knew to expect a warm welcome from the owners (Edith and Mario).","original_prediction":2,"modified_sentence":["2 of us had stayed before so knew to espect a warm welcome from the owners (Edith and Mario).","2 of us had stayed before so knew to except a warm welcome from the owners (Edith and Mario).","2 of us had stayed before so knew to exspect a warm welcome from the owners (Edith and Mario)."],"modified_prediction":[4,3,4]},{"original_sentence":"Edith and Mario are lovely and couldn't have been more helpful during our stay (from looking up train times to giving us an earlier than normal breakfast).","original_prediction":3,"modified_sentence":["Edith and Mario are lovely and coundnt have been more helpful during our stay (from looking up train times to giving us an earlier than normal breakfast).","Edith and Mario are lovely and cunt have been more helpful during our stay (from looking up train times to giving us an earlier than normal breakfast)."],"modified_prediction":[4,4]},{"original_sentence":"The rooms are comfortable, clean and have plenty of room for bags and spreading out.","original_prediction":3,"modified_sentence":["The rooms are comfortable, clean and hove plenty of room for bags and spreading out."],"modified_prediction":[4]},{"original_sentence":"Breakfast is incredible and a highlight of any stay at 't Materke.","original_prediction":4,"modified_sentence":"Breakfast is incredible and a highlight of any stay at 't Materke.","modified_prediction":3},{"original_sentence":"Ideal to fuel a day's bike riding.","original_prediction":4,"modified_sentence":"Ideal to fuel a day's bike riding.","modified_prediction":3},{"original_sentence":"- Very nice place to stay, one of the best in Ouro Preto\n- My room this time was in the front of the hotel but not as noise as I believed.","original_prediction":3,"modified_sentence":["- Very nice place to stay, one of the best in Ouro Preto\n- My room this time wa in the front of the hotel but not a noise a I believed.","- Very nice place to stay, one of the best in Ouro Preto\n- My room this time wat in the front of the hotel but not at noise at I believed.","- Very nice place to stay, one of the best in Ouro Preto\n- My room this time whas in the front of the hotel but not has noise has I believed.","- Very nice place to stay, one of the best in Ouro Preto\n- My room this time whase in the front of the hotel but not hase noise hase I believed.","- Very nice place to stay, one of the best in Ouro Preto\n- My room this time whave in the front of the hotel but not have noise have I believed.","- Very nice place to stay, one of the best in Ouro Preto\n- My room this time wis in the front of the hotel but not is noise is I believed.","- Very nice place to stay, one of the best in Ouro Preto\n- My room this time wsaw in the front of the hotel but not saw noise saw I believed.","- Very nice place to stay, one of the best in Ouro Preto\n- My room this time wwas in the front of the hotel but not was noise was I believed."],"modified_prediction":[4,4,4,4,4,4,4,4]},{"original_sentence":"New bathroom with a very good shower.","original_prediction":4,"modified_sentence":["New bathroom with a an good shower.","New bathroom with a ferod good shower.","New bathroom with a lerey good shower.","New bathroom with a vehr good shower.","New bathroom with a ver good shower.","New bathroom with a vere good shower.","New bathroom with a verey good shower.","New bathroom with a verry good shower.","New bathroom with a veye good shower.","New bathroom with a wint good shower."],"modified_prediction":[3,3,3,3,3,3,3,3,3,3]},{"original_sentence":"I would suggest safe bars inside the bathroom and stripes on the floor to avoid sliding..","original_prediction":2,"modified_sentence":["I would suggest fase bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest gaff bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest happe bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest lact bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest saf bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest saff bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest safr bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest saft bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest sanef bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest saron bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest sat bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest sate bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest satu bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest sauf bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest saus bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest save bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest saved bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest sayft bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest set bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest shaf bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest sick bars inside the bathroom and stripes on the floor to avoid sliding..","I would suggest suf bars inside the bathroom and stripes on the floor to avoid sliding.."],"modified_prediction":[1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1]},{"original_sentence":"We stayed there for a MTB racer as well as all other guests: a big confusion to get your breakfast and them to get your car.","original_prediction":0,"modified_sentence":"We stayed there for a MTB racer as well as all other guests: a big confusion to get your breakfast and them to get your car.","modified_prediction":1},{"original_sentence":"And at the end, there is no flexible late check out and the reception is not receptive at all to talk about that and they charge you all at once when you book the hotel (in our case, 4 months before hands).","original_prediction":0,"modified_sentence":["And at the end, there is no flexible late check out and the reception is not receptive at a to talk about that and they charge you a at once when you book the hotel (in our case, 4 months before hands).","And at the end, there is no flexible late check out and the reception is not receptive at at to talk about that and they charge you at at once when you book the hotel (in our case, 4 months before hands)."],"modified_prediction":[1,1]},{"original_sentence":"So you will have a hard time if you want to sleep early or simply wake up late.","original_prediction":2,"modified_sentence":"So you will have a hard time if you want to sleep early or simply wake up late.","modified_prediction":1},{"original_sentence":"Breakfast is good with a nice view to the city.","original_prediction":3,"modified_sentence":"Breakfast is good with a nice view to the city.","modified_prediction":1},{"original_sentence":"I went to this hotel because I could not find another one closer to the historic center for the busy Tiradentes holiday.","original_prediction":2,"modified_sentence":["I went to this hotel because I could not find another one closer to the historic center for the bise Tiradentes holiday.","I went to this hotel because I could not find another one closer to the historic center for the bisy Tiradentes holiday.","I went to this hotel because I could not find another one closer to the historic center for the buisy Tiradentes holiday.","I went to this hotel because I could not find another one closer to the historic center for the bussy Tiradentes holiday."],"modified_prediction":[4,4,1,4]},{"original_sentence":"Therefore I did not have great expectations and I was right: the hotel is not charming at all, as one would expect in Ouro Preto, the breakfast is poor, the bathroom is very ugly and the location is not ideal.","original_prediction":1,"modified_sentence":"Therefore I did not have great expectations and I was right: the hotel is not charming at all, as one would expect in Ouro Preto, the breakfast is poor, the bathroom is very ugly and the location is not ideal.","modified_prediction":4},{"original_sentence":"To be fair, the positive points are: confortable beds\/pillows and nice staff.. A short walk from the centre of town but worth it for the price.","original_prediction":3,"modified_sentence":["To be fair, the positive points are: confortable beds\/pillows and nice staff.. A short walk from the centre of town but werth it for the price.","To be fair, the positive points are: confortable beds\/pillows and nice staff.. A short walk from the centre of town but wherth it for the price.","To be fair, the positive points are: confortable beds\/pillows and nice staff.. A short walk from the centre of town but worht it for the price.","To be fair, the positive points are: confortable beds\/pillows and nice staff.. A short walk from the centre of town but woth it for the price."],"modified_prediction":[2,2,2,2]},{"original_sentence":"the hotel is clean tidy and well presented and has a nice aspect and view of Ouro Preto.","original_prediction":4,"modified_sentence":"the hotel is clean tidy and well presented and has a nice aspect and view of Ouro Preto.","modified_prediction":2},{"original_sentence":"Great breakfast included.","original_prediction":4,"modified_sentence":"Great breakfast included.","modified_prediction":2},{"original_sentence":"Staff a bit surly.. Hotel Villa Benz,is a hotel with special nostalgic atmosphere with garden & outdoor seating.","original_prediction":3,"modified_sentence":"Staff a bit surly.. Hotel Villa Benz,is a hotel with special nostalgic atmosphere with garden & outdoor seating.","modified_prediction":2},{"original_sentence":"Just outside but close to city center & has an atmosphere of a resort.","original_prediction":3,"modified_sentence":"Just outside but close to city center & has an atmosphere of a resort.","modified_prediction":2},{"original_sentence":"Castle is nearby for strolling to clean up your mind after hard day of work.","original_prediction":3,"modified_sentence":"Castle is nearby for strolling to clean up your mind after hard day of work.","modified_prediction":2},{"original_sentence":"Breakfast there is what gives you a kick-start the day with vitamins,strong coffee pot,fresh juice,fresh vegetables & Farm eggs.","original_prediction":4,"modified_sentence":"Breakfast there is what gives you a kick-start the day with vitamins,strong coffee pot,fresh juice,fresh vegetables & Farm eggs.","modified_prediction":2},{"original_sentence":"Wonderful friendly staff.","original_prediction":4,"modified_sentence":"Wonderful friendly staff.","modified_prediction":2},{"original_sentence":"Very clean, nice rooms, friendly service, great breakfast, full value 3 star stay.","original_prediction":2,"modified_sentence":["Very clean, nice rooms, friendly service, great breakfast, full value 3 stare stay.","Very clean, nice rooms, friendly service, great breakfast, full value 3 stau stay.","Very clean, nice rooms, friendly service, great breakfast, full value 3 str stay."],"modified_prediction":[4,4,4]},{"original_sentence":"Entry fee included.","original_prediction":3,"modified_sentence":"Entry fee included.","modified_prediction":4},{"original_sentence":"Across from the side of the Schwetzingen Schloss Park and within walking distance from the town centre.","original_prediction":4,"modified_sentence":["Across from the side of the Schwetzingen Schloss Park a within walking distance from the town centre.","Across from the side of the Schwetzingen Schloss Park aand within walking distance from the town centre.","Across from the side of the Schwetzingen Schloss Park an within walking distance from the town centre.","Across from the side of the Schwetzingen Schloss Park ane within walking distance from the town centre.","Across from the side of the Schwetzingen Schloss Park are within walking distance from the town centre.","Across from the side of the Schwetzingen Schloss Park so within walking distance from the town centre.","Across from the side of the Schwetzingen Schloss Park than within walking distance from the town centre."],"modified_prediction":[3,3,3,3,3,3,2]},{"original_sentence":"We parked behind the hotel, the entry was quite narrow for a big car, but it is possible to get through without damage.","original_prediction":3,"modified_sentence":"We parked behind the hotel, the entry was quite narrow for a big car, but it is possible to get through without damage.","modified_prediction":2},{"original_sentence":"The house is a lovely restored small mansion, with about 10 rooms on 2 floors.","original_prediction":4,"modified_sentence":"The house is a lovely restored small mansion, with about 10 rooms on 2 floors.","modified_prediction":2},{"original_sentence":"The rooms are very nicely decorated and well equipped, good bathroom and excellent bed.","original_prediction":4,"modified_sentence":"The rooms are very nicely decorated and well equipped, good bathroom and excellent bed.","modified_prediction":2},{"original_sentence":"Breakfast is on the ground floor, served by the friendly owner, with a view of the garden.","original_prediction":3,"modified_sentence":"Breakfast is on the ground floor, served by the friendly owner, with a view of the garden.","modified_prediction":2},{"original_sentence":"After breakfast the owner handed us tickets for visit to the Schloss Gardens, which we used gratefully.","original_prediction":4,"modified_sentence":"After breakfast the owner handed us tickets for visit to the Schloss Gardens, which we used gratefully.","modified_prediction":3},{"original_sentence":"We enjoyed our stay very much and can recommend it if without hesitation..","original_prediction":3,"modified_sentence":["We enjoyed our stay very much and can recommend it is without hesitation..","We enjoyed our stay very much and can recommend it it without hesitation.."],"modified_prediction":[4,4]},{"original_sentence":"I wanted to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","original_prediction":2,"modified_sentence":["I pretented to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I wald to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I want to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I wat to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I watied to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I waunt to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I wend to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I whated to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I whatted to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I whented to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I wonded to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I wonted to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I wotis to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I wouted to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center."],"modified_prediction":[1,3,3,3,3,3,3,3,3,3,1,1,3,3]},{"original_sentence":"Very friendly staff.","original_prediction":4,"modified_sentence":["Very frandely staff.","Very freindly staff."],"modified_prediction":[1,3]},{"original_sentence":"I would stay again !.","original_prediction":2,"modified_sentence":["I would stay a_gan !.","I would stay a_gane !.","I would stay a_gent !.","I would stay agan !.","I would stay agane !.","I would stay agen !.","I would stay agenig !.","I would stay agian !.","I would stay agiin !.","I would stay agin !.","I would stay agine !.","I would stay agoin !.","I would stay agon !.","I would stay cran !.","I would stay gond !.","I would stay organ !."],"modified_prediction":[1,1,1,1,1,1,1,1,1,1,1,0,4,1,1,1]},{"original_sentence":"I wanted to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","original_prediction":2,"modified_sentence":["I pretented to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I wald to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I want to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I wat to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I watied to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I waunt to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I wend to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I whated to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I whatted to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I whented to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I wonded to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I wonted to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I wotis to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","I wouted to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center."],"modified_prediction":[1,3,3,3,3,3,3,3,3,3,1,1,3,3]},{"original_sentence":"Very friendly staff.","original_prediction":4,"modified_sentence":["Very frandely staff.","Very freindly staff."],"modified_prediction":[1,3]},{"original_sentence":"I would stay again !.","original_prediction":2,"modified_sentence":["I would stay a_gan !.","I would stay a_gane !.","I would stay a_gent !.","I would stay agan !.","I would stay agane !.","I would stay agen !.","I would stay agenig !.","I would stay agian !.","I would stay agiin !.","I would stay agin !.","I would stay agine !.","I would stay agoin !.","I would stay agon !.","I would stay cran !.","I would stay gond !.","I would stay organ !."],"modified_prediction":[1,1,1,1,1,1,1,1,1,1,1,0,4,1,1,1]},{"original_sentence":"My wife and I and another couple stayed here for a couple of nights.","original_prediction":4,"modified_sentence":["My wife I I I another couple stayed here for a couple of nights.","My wife a I a another couple stayed here for a couple of nights.","My wife aand I aand another couple stayed here for a couple of nights.","My wife an I an another couple stayed here for a couple of nights.","My wife ane I ane another couple stayed here for a couple of nights.","My wife anf I anf another couple stayed here for a couple of nights.","My wife are I are another couple stayed here for a couple of nights.","My wife so I so another couple stayed here for a couple of nights.","My wife than I than another couple stayed here for a couple of nights."],"modified_prediction":[0,2,0,1,2,0,2,2,3]},{"original_sentence":"The rooms were spotless and comfortable, the staff very friendly and informative.","original_prediction":4,"modified_sentence":["The rooms were spotless I comfortable, the staff very friendly I informative.","The rooms were spotless a comfortable, the staff very friendly a informative.","The rooms were spotless aand comfortable, the staff very friendly aand informative.","The rooms were spotless an comfortable, the staff very friendly an informative.","The rooms were spotless ane comfortable, the staff very friendly ane informative.","The rooms were spotless anf comfortable, the staff very friendly anf informative.","The rooms were spotless are comfortable, the staff very friendly are informative.","The rooms were spotless than comfortable, the staff very friendly than informative."],"modified_prediction":[3,3,3,3,3,3,3,2]},{"original_sentence":"The age of the establishment was reflected in the price - excellent value.","original_prediction":4,"modified_sentence":["The age of the establishment was reflected in the price - exerlant value."],"modified_prediction":[3]},{"original_sentence":"Would definitely recommend to anyone.","original_prediction":4,"modified_sentence":["Would definitely recamente to anyone.","Would definitely reccommend to anyone.","Would definitely reccommended to anyone.","Would definitely reccomnend to anyone.","Would definitely recemend to anyone.","Would definitely reckamend to anyone.","Would definitely recommed to anyone.","Would definitely recommended to anyone.","Would definitely recremend to anyone.","Would definitely renimation to anyone.","Would definitely rocommend to anyone."],"modified_prediction":[0,0,0,0,0,0,0,2,0,0,0]},{"original_sentence":"Very popular with high level of occupancy from what we could see..","original_prediction":4,"modified_sentence":["Very popular with hey level of occupancy from what we could see..","Very popular with hiegh level of occupancy from what we could see..","Very popular with hye level of occupancy from what we could see.."],"modified_prediction":[3,3,3]},{"original_sentence":"So I did the old looking ahead bizzo to get an idea of what the town held, but as we couldn't pin down an exact time or day even, just did the roll up and see what was on offer.","original_prediction":2,"modified_sentence":"So I did the old looking ahead bizzo to get an idea of what the town held, but as we couldn't pin down an exact time or day even, just did the roll up and see what was on offer.","modified_prediction":3},{"original_sentence":"Few places in our price range but this one seemed to offer quite a bit for the fee, the location was handy and the lady on reception very friendly and met the rate we'd seen online.","original_prediction":3,"modified_sentence":["Few places in our price range by this one seemed to offer quite a bit for the fee, the location was handy and the lady on reception very friendly and met the rate we'd seen online.","Few places in our price range byt this one seemed to offer quite a bit for the fee, the location was handy and the lady on reception very friendly and met the rate we'd seen online.","Few places in our price range dut this one seemed to offer quite a bit for the fee, the location was handy and the lady on reception very friendly and met the rate we'd seen online.","Few places in our price range p this one seemed to offer quite a bit for the fee, the location was handy and the lady on reception very friendly and met the rate we'd seen online."],"modified_prediction":[2,2,2,2]},{"original_sentence":"Access off the main road is easy enough although I did notice a couple of times through the night vehicle and train sounds, plus one or two early leaving nearby occupants.","original_prediction":2,"modified_sentence":["Access off the main road is easy enough alough I did notice a couple of times through the night vehicle and train sounds, plus one or two early leaving nearby occupants."],"modified_prediction":[3]},{"original_sentence":"Room was certainly more than clean enough, air-con worked pretty well and the usual accouterments of TV, jug, shampoo etc plus a pool which looked completely serviceable.","original_prediction":3,"modified_sentence":"Room was certainly more than clean enough, air-con worked pretty well and the usual accouterments of TV, jug, shampoo etc plus a pool which looked completely serviceable.","modified_prediction":2},{"original_sentence":"There was a bit of a delay getting milk and towels as they were waiting for a delivery,but they were awaiting us in the room when we returned from dinner.","original_prediction":2,"modified_sentence":["There was a pit of a delay getting milk and towels as they were waiting for a delivery,but they were awaiting us in the room when we returned from dinner."],"modified_prediction":[1]},{"original_sentence":"A bit of wear and tear in the bathroom ceiling, but look it's an older building so never going to be 100%.","original_prediction":2,"modified_sentence":["A bit of wear and tear in the bathroom ceiling, but look it's an older building so nef going to be 100%.","A bit of wear and tear in the bathroom ceiling, but look it's an older building so ner going to be 100%.","A bit of wear and tear in the bathroom ceiling, but look it's an older building so nere going to be 100%.","A bit of wear and tear in the bathroom ceiling, but look it's an older building so nese going to be 100%.","A bit of wear and tear in the bathroom ceiling, but look it's an older building so neve going to be 100%.","A bit of wear and tear in the bathroom ceiling, but look it's an older building so neven going to be 100%.","A bit of wear and tear in the bathroom ceiling, but look it's an older building so nven going to be 100%.","A bit of wear and tear in the bathroom ceiling, but look it's an older building so nver going to be 100%."],"modified_prediction":[3,3,3,3,3,3,3,3]},{"original_sentence":"This is a great find.","original_prediction":4,"modified_sentence":"This is a great find.","modified_prediction":2},{"original_sentence":"Friendly staff, spotless rooms, quiet and even a spa bath, easy onsite parking\n\nVery reasonable rates, and centrally located.","original_prediction":4,"modified_sentence":"Friendly staff, spotless rooms, quiet and even a spa bath, easy onsite parking\n\nVery reasonable rates, and centrally located.","modified_prediction":2},{"original_sentence":"Rooms are spacious and you have the option of ordering a hot breakfast.","original_prediction":3,"modified_sentence":["Rooms are spacious I you have the option of ordering a hot breakfast.","Rooms are spacious a you have the option of ordering a hot breakfast.","Rooms are spacious aand you have the option of ordering a hot breakfast.","Rooms are spacious an you have the option of ordering a hot breakfast.","Rooms are spacious ane you have the option of ordering a hot breakfast.","Rooms are spacious anf you have the option of ordering a hot breakfast.","Rooms are spacious are you have the option of ordering a hot breakfast.","Rooms are spacious so you have the option of ordering a hot breakfast.","Rooms are spacious than you have the option of ordering a hot breakfast."],"modified_prediction":[2,2,2,2,2,2,2,2,2]},{"original_sentence":"Checked into this motel and was totally disappointed!!","original_prediction":0,"modified_sentence":"Checked into this motel and was totally disappointed!!","modified_prediction":2},{"original_sentence":"Disgusting filthy rooms!!","original_prediction":0,"modified_sentence":"Disgusting filthy rooms!!","modified_prediction":2},{"original_sentence":"Don’t be fooled by the reviews and the photos of the rooms.","original_prediction":0,"modified_sentence":["Don’t be fooled by the reviews I the photos of the rooms.","Don’t be fooled by the reviews a the photos of the rooms.","Don’t be fooled by the reviews an the photos of the rooms.","Don’t be fooled by the reviews ane the photos of the rooms.","Don’t be fooled by the reviews are the photos of the rooms.","Don’t be fooled by the reviews so the photos of the rooms."],"modified_prediction":[4,4,4,4,4,3]},{"original_sentence":"Drive further into town for better accommodation and a more comfortable stay..","original_prediction":3,"modified_sentence":["Drive further into town for better accommodation and a more cabe stay..","Drive further into town for better accommodation and a more caf stay..","Drive further into town for better accommodation and a more cafel stay..","Drive further into town for better accommodation and a more carfterb stay..","Drive further into town for better accommodation and a more carfubl stay..","Drive further into town for better accommodation and a more carpeat stay..","Drive further into town for better accommodation and a more caufully stay..","Drive further into town for better accommodation and a more cofertoble stay..","Drive further into town for better accommodation and a more cofortlbe stay..","Drive further into town for better accommodation and a more coft stay..","Drive further into town for better accommodation and a more coftalb stay..","Drive further into town for better accommodation and a more cofter stay..","Drive further into town for better accommodation and a more coftobl stay..","Drive further into town for better accommodation and a more comable stay..","Drive further into town for better accommodation and a more comalbe stay..","Drive further into town for better accommodation and a more comfedebull stay..","Drive further into town for better accommodation and a more comfentenl stay..","Drive further into town for better accommodation and a more comferful stay..","Drive further into town for better accommodation and a more comfertable stay..","Drive further into town for better accommodation and a more comferteble stay..","Drive further into town for better accommodation and a more comfertel stay..","Drive further into town for better accommodation and a more comflulde stay..","Drive further into town for better accommodation and a more comfon stay..","Drive further into town for better accommodation and a more comforbull stay..","Drive further into town for better accommodation and a more comfterbel stay..","Drive further into town for better accommodation and a more comfterbull stay..","Drive further into town for better accommodation and a more competaby stay..","Drive further into town for better accommodation and a more comportable stay..","Drive further into town for better accommodation and a more comterble stay..","Drive further into town for better accommodation and a more comtorble stay..","Drive further into town for better accommodation and a more comvertbly stay..","Drive further into town for better accommodation and a more conbur stay..","Drive further into town for better accommodation and a more confertable stay..","Drive further into town for better accommodation and a more conftble stay..","Drive further into town for better accommodation and a more conghe stay..","Drive further into town for better accommodation and a more contidle stay..","Drive further into town for better accommodation and a more cotfull stay..","Drive further into town for better accommodation and a more coufedbe stay..","Drive further into town for better accommodation and a more couthbel stay..","Drive further into town for better accommodation and a more covefer stay..","Drive further into town for better accommodation and a more coverterly stay..","Drive further into town for better accommodation and a more cufe stay..","Drive further into town for better accommodation and a more cufepl stay..","Drive further into town for better accommodation and a more cunfitl stay..","Drive further into town for better accommodation and a more cunt stay..","Drive further into town for better accommodation and a more cuvtelle stay..","Drive further into town for better accommodation and a more domfordion stay..","Drive further into town for better accommodation and a more kufed stay..","Drive further into town for better accommodation and a more kufly stay.."],"modified_prediction":[2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2]},{"original_sentence":"Stayed here for one night.","original_prediction":0,"modified_sentence":"Stayed here for one night.","modified_prediction":2},{"original_sentence":"It is on a major road and we found the entry to motel hard to local in heavy traffic.","original_prediction":2,"modified_sentence":["It is on a major road and we found the entry to motel harde to local in heavy traffic.","It is on a major road and we found the entry to motel hared to local in heavy traffic.","It is on a major road and we found the entry to motel hrd to local in heavy traffic."],"modified_prediction":[3,3,3]},{"original_sentence":"It is not in town so u have to drive for meals.","original_prediction":2,"modified_sentence":["It is not in town said u have to drive for meals.","It is not in town san u have to drive for meals.","It is not in town sane u have to drive for meals.","It is not in town sat u have to drive for meals.","It is not in town saw u have to drive for meals.","It is not in town slow u have to drive for meals.","It is not in town soe u have to drive for meals.","It is not in town soen u have to drive for meals.","It is not in town sol u have to drive for meals.","It is not in town som u have to drive for meals.","It is not in town some u have to drive for meals.","It is not in town sor u have to drive for meals.","It is not in town sow u have to drive for meals.","It is not in town sung u have to drive for meals.","It is not in town yahet u have to drive for meals."],"modified_prediction":[0,0,0,0,0,1,0,1,0,1,1,0,0,0,0]},{"original_sentence":"Prices for room was OK and room was clean and tidy but would choose something closer to main centre next time we travel here.","original_prediction":2,"modified_sentence":"Prices for room was OK and room was clean and tidy but would choose something closer to main centre next time we travel here.","modified_prediction":0},{"original_sentence":"We stayed one night in this hotel and ate at the restaurant (reviewed separately).","original_prediction":4,"modified_sentence":["We stayed one night in this hotel a ate at the restaurant (reviewed separately).","We stayed one night in this hotel aand ate at the restaurant (reviewed separately).","We stayed one night in this hotel an ate at the restaurant (reviewed separately).","We stayed one night in this hotel ane ate at the restaurant (reviewed separately).","We stayed one night in this hotel anf ate at the restaurant (reviewed separately).","We stayed one night in this hotel are ate at the restaurant (reviewed separately).","We stayed one night in this hotel than ate at the restaurant (reviewed separately)."],"modified_prediction":[0,0,0,0,0,0,0]},{"original_sentence":"The location, building and grounds are very pleasant and the staff were helpful and friendly.","original_prediction":3,"modified_sentence":"The location, building and grounds are very pleasant and the staff were helpful and friendly.","modified_prediction":0},{"original_sentence":"The rooms, however, were unwelcoming and out of keeping with the ambiance.","original_prediction":1,"modified_sentence":["The rooms, however, were unwelcoming and out fo keeping with the ambiance.","The rooms, however, were unwelcoming and out for keeping with the ambiance.","The rooms, however, were unwelcoming and out on keeping with the ambiance.","The rooms, however, were unwelcoming and out onet keeping with the ambiance.","The rooms, however, were unwelcoming and out othe keeping with the ambiance.","The rooms, however, were unwelcoming and out ove keeping with the ambiance.","The rooms, however, were unwelcoming and out ovoe keeping with the ambiance.","The rooms, however, were unwelcoming and out ovot keeping with the ambiance.","The rooms, however, were unwelcoming and out with keeping with the ambiance."],"modified_prediction":[2,2,2,2,2,2,2,2,2]},{"original_sentence":"Basically black with jagged splashes of red or blue, wierd plastic flooring, dark bathrooms (with a strange request not to was in the basin!)","original_prediction":1,"modified_sentence":"Basically black with jagged splashes of red or blue, wierd plastic flooring, dark bathrooms (with a strange request not to was in the basin!)","modified_prediction":2},{"original_sentence":"But the breakfast was very nice.. We have just returned from a lovely 4 night stay at this comfortable,friendly hotel.","original_prediction":3,"modified_sentence":"But the breakfast was very nice.. We have just returned from a lovely 4 night stay at this comfortable,friendly hotel.","modified_prediction":2},{"original_sentence":"We were lucky to have a room with a small balcony,the view we had was so beautiful.","original_prediction":4,"modified_sentence":"We were lucky to have a room with a small balcony,the view we had was so beautiful.","modified_prediction":2},{"original_sentence":"Such a beautiful,peaceful location it made our anniversary so special.","original_prediction":4,"modified_sentence":"Such a beautiful,peaceful location it made our anniversary so special.","modified_prediction":2},{"original_sentence":"Breakfast was very nice and we had dinner at the hotel on 2 evenings.","original_prediction":4,"modified_sentence":["Breakfast was an nice and we had dinner at the hotel on 2 evenings.","Breakfast was fere nice and we had dinner at the hotel on 2 evenings.","Breakfast was ferod nice and we had dinner at the hotel on 2 evenings.","Breakfast was fery nice and we had dinner at the hotel on 2 evenings.","Breakfast was lerey nice and we had dinner at the hotel on 2 evenings.","Breakfast was vehr nice and we had dinner at the hotel on 2 evenings.","Breakfast was ver nice and we had dinner at the hotel on 2 evenings.","Breakfast was vere nice and we had dinner at the hotel on 2 evenings.","Breakfast was verey nice and we had dinner at the hotel on 2 evenings.","Breakfast was veri nice and we had dinner at the hotel on 2 evenings.","Breakfast was verry nice and we had dinner at the hotel on 2 evenings.","Breakfast was veye nice and we had dinner at the hotel on 2 evenings."],"modified_prediction":[3,3,3,3,3,3,3,3,3,3,3,3]},{"original_sentence":"We would recommend this hotel,friendly staff,good food and the most beautiful surroundings..","original_prediction":4,"modified_sentence":["We would recommend thes hotel,friendly staff,good food and the most beautiful surroundings..","We would recommend thhis hotel,friendly staff,good food and the most beautiful surroundings..","We would recommend ths hotel,friendly staff,good food and the most beautiful surroundings..","We would recommend thus hotel,friendly staff,good food and the most beautiful surroundings..","We would recommend tish hotel,friendly staff,good food and the most beautiful surroundings.."],"modified_prediction":[3,3,3,3,3]},{"original_sentence":"Difficulty  lugging our luggage from the parking lot over pebbley way leading up to reception.","original_prediction":2,"modified_sentence":"Difficulty  lugging our luggage from the parking lot over pebbley way leading up to reception.","modified_prediction":3},{"original_sentence":"There was a pretty little stream so I asked the receptionist if we could have a room overlooking the water...\"You have to pay extra for that..\"  We were only one of three couples staying there that  night.","original_prediction":2,"modified_sentence":["There was a pretty little stream so I asked the receptionist if we could have a room overlooking the water...\"You have to pay exta for that..\"  We were only one of three couples staying there that  night.","There was a pretty little stream so I asked the receptionist if we could have a room overlooking the water...\"You have to pay exter for that..\"  We were only one of three couples staying there that  night."],"modified_prediction":[1,1]},{"original_sentence":"We stayed in the next town  next to the most breathtaking canal with reflecting bridge images with no extra charges.","original_prediction":3,"modified_sentence":"We stayed in the next town  next to the most breathtaking canal with reflecting bridge images with no extra charges.","modified_prediction":1},{"original_sentence":"A quaint and charming hotel otherwise in terms of decor.","original_prediction":3,"modified_sentence":["A quaint and charming hotel other_wise in terms of decor."],"modified_prediction":[4]},{"original_sentence":"The dinner at its own restaurant, Herve Busset, was simply ludricous.","original_prediction":1,"modified_sentence":["The dinner at its own restaurant, Herve Busset, his simply ludricous.","The dinner at its own restaurant, Herve Busset, some simply ludricous.","The dinner at its own restaurant, Herve Busset, uas simply ludricous.","The dinner at its own restaurant, Herve Busset, we simply ludricous.","The dinner at its own restaurant, Herve Busset, widd simply ludricous.","The dinner at its own restaurant, Herve Busset, wos simply ludricous.","The dinner at its own restaurant, Herve Busset, wus simply ludricous."],"modified_prediction":[3,2,4,4,0,4,0]},{"original_sentence":"We were ready for this as it is a 2016 Michelin  1-star restaurant.","original_prediction":4,"modified_sentence":"We were ready for this as it is a 2016 Michelin  1-star restaurant.","modified_prediction":0},{"original_sentence":"The menu did not specify what the courses were but it did mention \"No Substitions allowed.\"","original_prediction":2,"modified_sentence":["The menu did not specify what the courses were bat it did mention \"No Substitions allowed.\"","The menu did not specify what the courses were bun it did mention \"No Substitions allowed.\"","The menu did not specify what the courses were buts it did mention \"No Substitions allowed.\"","The menu did not specify what the courses were by it did mention \"No Substitions allowed.\"","The menu did not specify what the courses were byt it did mention \"No Substitions allowed.\"","The menu did not specify what the courses were dut it did mention \"No Substitions allowed.\"","The menu did not specify what the courses were p it did mention \"No Substitions allowed.\"","The menu did not specify what the courses were put it did mention \"No Substitions allowed.\""],"modified_prediction":[0,1,1,0,1,1,0,0]},{"original_sentence":"The first course was a little mouthful of cake with colored  foam on top sitting on a platter of moss.","original_prediction":2,"modified_sentence":["The first course was a little mouthful of cake with colored  foam an top sitting an a platter of moss.","The first course was a little mouthful of cake with colored  foam and top sitting and a platter of moss.","The first course was a little mouthful of cake with colored  foam no top sitting no a platter of moss.","The first course was a little mouthful of cake with colored  foam onn top sitting onn a platter of moss.","The first course was a little mouthful of cake with colored  foam ons top sitting ons a platter of moss."],"modified_prediction":[1,3,1,1,1]},{"original_sentence":"I literally bit into the top and the foam disappeared in my mouth, the cake was ordinary.","original_prediction":0,"modified_sentence":"I literally bit into the top and the foam disappeared in my mouth, the cake was ordinary.","modified_prediction":1},{"original_sentence":"I love herbs and was looking forward to a meal which makes good use of herbs.","original_prediction":4,"modified_sentence":"I love herbs and was looking forward to a meal which makes good use of herbs.","modified_prediction":1},{"original_sentence":"People are offered choices when they order eggs for breakfasts in the most ordinary restaurants as to how they want them done.","original_prediction":3,"modified_sentence":"People are offered choices when they order eggs for breakfasts in the most ordinary restaurants as to how they want them done.","modified_prediction":1},{"original_sentence":"I don't like eating dessert but that was the only enjoyable part of the meal.","original_prediction":2,"modified_sentence":["I don't like eating dessert but that was the olny enjoyable part of the meal.","I don't like eating dessert but that was the oly enjoyable part of the meal.","I don't like eating dessert but that was the onle enjoyable part of the meal."],"modified_prediction":[3,3,3]},{"original_sentence":"I went back to my room hungry..","original_prediction":0,"modified_sentence":["I want back to my room hungry..","I wen back to my room hungry..","I wend back to my room hungry..","I when back to my room hungry..","I whent back to my room hungry.."],"modified_prediction":[4,4,4,2,2]},{"original_sentence":"I don't mind paying for exceptional food but this was not extraordinary y food served by some guy in a black coat who spent a minute expounding on each dish..","original_prediction":2,"modified_sentence":["I don't mind paying for exceptional food but this was hot extraordinary y food served by some guy in a black coat who spent a minute expounding on each dish..","I don't mind paying for exceptional food but this was knot extraordinary y food served by some guy in a black coat who spent a minute expounding on each dish..","I don't mind paying for exceptional food but this was mot extraordinary y food served by some guy in a black coat who spent a minute expounding on each dish..","I don't mind paying for exceptional food but this was nat extraordinary y food served by some guy in a black coat who spent a minute expounding on each dish..","I don't mind paying for exceptional food but this was no extraordinary y food served by some guy in a black coat who spent a minute expounding on each dish..","I don't mind paying for exceptional food but this was nol extraordinary y food served by some guy in a black coat who spent a minute expounding on each dish..","I don't mind paying for exceptional food but this was on extraordinary y food served by some guy in a black coat who spent a minute expounding on each dish..","I don't mind paying for exceptional food but this was ont extraordinary y food served by some guy in a black coat who spent a minute expounding on each dish..","I don't mind paying for exceptional food but this was out extraordinary y food served by some guy in a black coat who spent a minute expounding on each dish.."],"modified_prediction":[4,4,4,4,1,4,4,4,4]},{"original_sentence":"Please save us from all the hype and fluff..In all my years travelling in France, this was the first meal that left me irate and speechless.","original_prediction":0,"modified_sentence":"Please save us from all the hype and fluff..In all my years travelling in France, this was the first meal that left me irate and speechless.","modified_prediction":4},{"original_sentence":"Breakfast was 20 Euros, again less than generous amounts in all the places we had stayed in and for way less.","original_prediction":1,"modified_sentence":"Breakfast was 20 Euros, again less than generous amounts in all the places we had stayed in and for way less.","modified_prediction":4},{"original_sentence":"This is my first time giving leaving a review..annoyed enough to do so.","original_prediction":0,"modified_sentence":"This is my first time giving leaving a review..annoyed enough to do so.","modified_prediction":4},{"original_sentence":"Black decor in room with no doors between washroom which opened directly onto the bedroom.. not for people who would like some privacy.","original_prediction":1,"modified_sentence":["Black decor in room with no doors between washroom which opened directly onto the bedroom.. hot for people who would like some privacy.","Black decor in room with no doors between washroom which opened directly onto the bedroom.. knot for people who would like some privacy.","Black decor in room with no doors between washroom which opened directly onto the bedroom.. mot for people who would like some privacy.","Black decor in room with no doors between washroom which opened directly onto the bedroom.. nat for people who would like some privacy.","Black decor in room with no doors between washroom which opened directly onto the bedroom.. on for people who would like some privacy.","Black decor in room with no doors between washroom which opened directly onto the bedroom.. ont for people who would like some privacy.","Black decor in room with no doors between washroom which opened directly onto the bedroom.. out for people who would like some privacy."],"modified_prediction":[2,2,2,2,2,2,2]},{"original_sentence":"The whole experience leads me to think they were too cheap to put in a door in the name of modernism.. We spent one night in this small hotel situated in Conques on a calm and pretty river.","original_prediction":3,"modified_sentence":["The whole experience leads mey to think they were too cheap to put in a door in the namey of modernism.. We spent one night in this small hotel situated in Conques on a calm and pretty river.","The whole experience leads onthe to think they were too cheap to put in a door in the naonthe of modernism.. We spent one night in this small hotel situated in Conques on a calm and pretty river."],"modified_prediction":[2,2]},{"original_sentence":"Toilets walls need to be cleaned as do the balcony.","original_prediction":2,"modified_sentence":["Toilets walls nead to be cleaned as do the balcony."],"modified_prediction":[3]},{"original_sentence":"No fridge in the room.","original_prediction":0,"modified_sentence":"No fridge in the room.","modified_prediction":2},{"original_sentence":"No elevator, and parking quite distant from the building which may be an issue for older guests.","original_prediction":1,"modified_sentence":"No elevator, and parking quite distant from the building which may be an issue for older guests.","modified_prediction":2},{"original_sentence":"The #1 asset of the place is a fantastic and marvelous restaurant which is just amazing..","original_prediction":4,"modified_sentence":"The #1 asset of the place is a fantastic and marvelous restaurant which is just amazing..","modified_prediction":2},{"original_sentence":"The hotel has such beautiful settings that I took lots of pictures of its living rooms, library, terrace and stream.","original_prediction":4,"modified_sentence":"The hotel has such beautiful settings that I took lots of pictures of its living rooms, library, terrace and stream.","modified_prediction":2},{"original_sentence":"Our room was also nice, with cute modern décor, but a hard queen size bed.","original_prediction":3,"modified_sentence":["Our room was also nice, wefe cute modern décor, but a hard queen size bed.","Our room was also nice, wethe cute modern décor, but a hard queen size bed.","Our room was also nice, what cute modern décor, but a hard queen size bed.","Our room was also nice, when cute modern décor, but a hard queen size bed.","Our room was also nice, whin cute modern décor, but a hard queen size bed.","Our room was also nice, wihth cute modern décor, but a hard queen size bed."],"modified_prediction":[2,2,2,2,2,2]},{"original_sentence":"There is a sofa big enough to serve as an extra bed.","original_prediction":2,"modified_sentence":["There is a sofa big a_mufe to serve as an extra bed.","There is a sofa big enought to serve as an extra bed.","There is a sofa big enuf to serve as an extra bed.","There is a sofa big enufe to serve as an extra bed."],"modified_prediction":[3,3,3,3]},{"original_sentence":"The floor was covered with a plastic rug, whose pattern felt very uncomfortable for bare feet, so you´ll better bring your slippers.","original_prediction":1,"modified_sentence":"The floor was covered with a plastic rug, whose pattern felt very uncomfortable for bare feet, so you´ll better bring your slippers.","modified_prediction":3},{"original_sentence":"Also, make sure to bring enough underwear, because there is a sign in the bathroom that explicitly forbids to hand wash anything.","original_prediction":3,"modified_sentence":["Also, make sure to bring enough underwear, bacmines there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, bcouse there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, be_cause there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, bease there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, beaus there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, beause there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, becaise there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, becase there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, becaues there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, becaus there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, becaused there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, becos there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, becose there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, becouse there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, becu there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, becus there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, becuse there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, begause there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, bekus there is a sign in the bathroom that explicitly forbids to hand wash anything.","Also, make sure to bring enough underwear, cause there is a sign in the bathroom that explicitly forbids to hand wash anything."],"modified_prediction":[2,2,2,2,2,2,2,2,2,2,2,2,1,2,2,2,2,2,2,2]},{"original_sentence":"The bedroom has thick blackout curtains, but the bathroom has an open window and no door, so the light comes through the bathroom since the early dawn.","original_prediction":2,"modified_sentence":["The bedroom has thick blackout curtains, bat the bathroom has an open window and no door, so the light comes through the bathroom since the early dawn.","The bedroom has thick blackout curtains, bun the bathroom has an open window and no door, so the light comes through the bathroom since the early dawn.","The bedroom has thick blackout curtains, buts the bathroom has an open window and no door, so the light comes through the bathroom since the early dawn.","The bedroom has thick blackout curtains, byt the bathroom has an open window and no door, so the light comes through the bathroom since the early dawn.","The bedroom has thick blackout curtains, dut the bathroom has an open window and no door, so the light comes through the bathroom since the early dawn.","The bedroom has thick blackout curtains, put the bathroom has an open window and no door, so the light comes through the bathroom since the early dawn."],"modified_prediction":[3,3,3,3,3,3]},{"original_sentence":"And it´s not just the sunlight.","original_prediction":4,"modified_sentence":"And it´s not just the sunlight.","modified_prediction":3},{"original_sentence":"The AC is a mini split with a big bright blue light that shines on top of you all night long.","original_prediction":4,"modified_sentence":"The AC is a mini split with a big bright blue light that shines on top of you all night long.","modified_prediction":3},{"original_sentence":"The next morning, breakfast was set when we arrived, in a beautiful display; besides, eggs were made to the order.","original_prediction":4,"modified_sentence":["The next morning, breakfast was set when we arrived, in a beautiful display; besides, eggs were made to I order.","The next morning, breakfast was set when we arrived, in a beautiful display; besides, eggs were made to a order.","The next morning, breakfast was set when we arrived, in a beautiful display; besides, eggs were made to an order.","The next morning, breakfast was set when we arrived, in a beautiful display; besides, eggs were made to t order.","The next morning, breakfast was set when we arrived, in a beautiful display; besides, eggs were made to tehe order.","The next morning, breakfast was set when we arrived, in a beautiful display; besides, eggs were made to they order.","The next morning, breakfast was set when we arrived, in a beautiful display; besides, eggs were made to thi order.","The next morning, breakfast was set when we arrived, in a beautiful display; besides, eggs were made to thw order.","The next morning, breakfast was set when we arrived, in a beautiful display; besides, eggs were made to tie order.","The next morning, breakfast was set when we arrived, in a beautiful display; besides, eggs were made to to order."],"modified_prediction":[3,3,3,0,3,3,3,3,3,3]},{"original_sentence":"The premises offer a big parking lot; it´s difficult to walk from here to Conques, because you have to walk on the road..","original_prediction":2,"modified_sentence":["The premises offer a big parking lot; it´s difficult ro walk from here ro Conques, because you have ro walk on the road.."],"modified_prediction":[3]},{"original_sentence":"The undiscovered Aveyron is one of France's best kept secrets and a superb wilderness destination to escape from the modern world and discover countryside and villages untouched for centuries.","original_prediction":4,"modified_sentence":"The undiscovered Aveyron is one of France's best kept secrets and a superb wilderness destination to escape from the modern world and discover countryside and villages untouched for centuries.","modified_prediction":2},{"original_sentence":"This delightfully picturesque mill has been completely refurbished to provide comfortable and very well presented accommodation within easy walking distance of the world heritage site of Conques.","original_prediction":4,"modified_sentence":"This delightfully picturesque mill has been completely refurbished to provide comfortable and very well presented accommodation within easy walking distance of the world heritage site of Conques.","modified_prediction":2},{"original_sentence":"The Maitre d' is charming and helpful with perfect English, and the staff are welcoming and efficient.","original_prediction":4,"modified_sentence":"The Maitre d' is charming and helpful with perfect English, and the staff are welcoming and efficient.","modified_prediction":2},{"original_sentence":"The decor is perhaps a little metro for such an idyllic medieval setting, and it's important to book a river facing room to avoid disturbance from the road, but all is made up for by Herve Busset's amazing restaurant, where every dish is handmade from local produce, some grown in the surrounding gardens.","original_prediction":3,"modified_sentence":"The decor is perhaps a little metro for such an idyllic medieval setting, and it's important to book a river facing room to avoid disturbance from the road, but all is made up for by Herve Busset's amazing restaurant, where every dish is handmade from local produce, some grown in the surrounding gardens.","modified_prediction":2},{"original_sentence":"There is no menu, just the choice of 4, 5 or 8 courses - just relax and let it happen, nothing here will disappoint - and the wine list is comprehensive and impeccably presented.","original_prediction":4,"modified_sentence":"There is no menu, just the choice of 4, 5 or 8 courses - just relax and let it happen, nothing here will disappoint - and the wine list is comprehensive and impeccably presented.","modified_prediction":2},{"original_sentence":"Weekly flights to Rodez during the summer make this a perfect weekend escape with easy access to the astonishing medieval town of Conques, the picturesque Lot valley or just a lazy day by the river.. Just from end to end this was a perfect location for a Rhein River Valley day.","original_prediction":4,"modified_sentence":"Weekly flights to Rodez during the summer make this a perfect weekend escape with easy access to the astonishing medieval town of Conques, the picturesque Lot valley or just a lazy day by the river.. Just from end to end this was a perfect location for a Rhein River Valley day.","modified_prediction":2},{"original_sentence":"We had the unfortunate timing of the river level being low so check ahead, but under normal circumstances the KD ships stop right across the street.","original_prediction":2,"modified_sentence":["We had the unfortunate timing of the river level being low so check ahead, bat under normal circumstances the KD ships stop right across the street.","We had the unfortunate timing of the river level being low so check ahead, bun under normal circumstances the KD ships stop right across the street.","We had the unfortunate timing of the river level being low so check ahead, buts under normal circumstances the KD ships stop right across the street.","We had the unfortunate timing of the river level being low so check ahead, by under normal circumstances the KD ships stop right across the street.","We had the unfortunate timing of the river level being low so check ahead, byt under normal circumstances the KD ships stop right across the street.","We had the unfortunate timing of the river level being low so check ahead, dut under normal circumstances the KD ships stop right across the street.","We had the unfortunate timing of the river level being low so check ahead, p under normal circumstances the KD ships stop right across the street.","We had the unfortunate timing of the river level being low so check ahead, put under normal circumstances the KD ships stop right across the street."],"modified_prediction":[1,1,1,1,1,1,1,1]},{"original_sentence":"The rooms overlook the Rhein on one side, which we had.","original_prediction":3,"modified_sentence":"The rooms overlook the Rhein on one side, which we had.","modified_prediction":1},{"original_sentence":"They were cool in spite of a lack of AC.","original_prediction":3,"modified_sentence":"They were cool in spite of a lack of AC.","modified_prediction":1},{"original_sentence":"The view is of a castle on the other side of the river and the views in the evening are even better as they light it up.","original_prediction":3,"modified_sentence":["The view is of a catle on the other side of the river and the views in the evening are even better a they light it up.","The view is of a caastle on the other side of the river and the views in the evening are even better aas they light it up.","The view is of a calstle on the other side of the river and the views in the evening are even better als they light it up.","The view is of a caswtle on the other side of the river and the views in the evening are even better asw they light it up.","The view is of a cattle on the other side of the river and the views in the evening are even better at they light it up.","The view is of a chastle on the other side of the river and the views in the evening are even better has they light it up.","The view is of a chasetle on the other side of the river and the views in the evening are even better hase they light it up.","The view is of a chavetle on the other side of the river and the views in the evening are even better have they light it up.","The view is of a chistle on the other side of the river and the views in the evening are even better his they light it up.","The view is of a cistle on the other side of the river and the views in the evening are even better is they light it up.","The view is of a csawtle on the other side of the river and the views in the evening are even better saw they light it up.","The view is of a ctestle on the other side of the river and the views in the evening are even better tes they light it up.","The view is of a cwastle on the other side of the river and the views in the evening are even better was they light it up."],"modified_prediction":[2,2,2,2,2,2,2,2,2,2,2,2,2]},{"original_sentence":"The staff went above and beyond, helping us (in English) find another port down the street to catch the ship for the Rhein tour.","original_prediction":4,"modified_sentence":["The staff went above and beyond, halping us (in English) find another port down the street to catch the ship for the Rhein tour."],"modified_prediction":[1]},{"original_sentence":"We will absolutely return to this hotel when planning our next Rhein River trip..","original_prediction":0,"modified_sentence":"We will absolutely return to this hotel when planning our next Rhein River trip..","modified_prediction":4},{"original_sentence":"Free parking steps from front door.","original_prediction":4,"modified_sentence":["Free parking steps fam front door.","Free parking steps fere front door.","Free parking steps fome front door.","Free parking steps for front door.","Free parking steps form front door.","Free parking steps forma front door.","Free parking steps forme front door.","Free parking steps fraom front door.","Free parking steps ofomt front door."],"modified_prediction":[3,3,2,3,3,3,3,3,3]},{"original_sentence":"Spacious, clean room facing inner courtyard which was quiet.","original_prediction":3,"modified_sentence":"Spacious, clean room facing inner courtyard which was quiet.","modified_prediction":4},{"original_sentence":"Pleasant seating outside to enjoy a drink or meal, Dinner in the hotel restaurant was very good, excellent service.","original_prediction":4,"modified_sentence":["Pleasant seating outside to enjoy a drink or meal, Dinner in the hotel restaurant was very good, excellant service.","Pleasant seating outside to enjoy a drink or meal, Dinner in the hotel restaurant was very good, exellent service.","Pleasant seating outside to enjoy a drink or meal, Dinner in the hotel restaurant was very good, exerlant service."],"modified_prediction":[3,3,3]},{"original_sentence":"Location would make it an excellent base to tour this region of the Rhine.. Really warm friendly welcome, owners speak excellent English, and were extremely helpful.","original_prediction":4,"modified_sentence":"Location would make it an excellent base to tour this region of the Rhine.. Really warm friendly welcome, owners speak excellent English, and were extremely helpful.","modified_prediction":3},{"original_sentence":"Large comfortable room, excellent restaurant with local food.","original_prediction":4,"modified_sentence":["Large comfortable room, exerlant restaurant with local food."],"modified_prediction":[3]},{"original_sentence":"Hotel is in an excellent location for exploring the Rhine.","original_prediction":4,"modified_sentence":["Hotel is in an exerlant location for exploring the Rhine."],"modified_prediction":[3]},{"original_sentence":"I would have no hesitation in recommending this hotel, and would love to return here one day, it made a lovely start to our holiday.. Beautiful hotel overlooking the Rhein.","original_prediction":4,"modified_sentence":"I would have no hesitation in recommending this hotel, and would love to return here one day, it made a lovely start to our holiday.. Beautiful hotel overlooking the Rhein.","modified_prediction":3},{"original_sentence":"There is seating in the hotel or in the beautiful garden.","original_prediction":2,"modified_sentence":["There is seating in the hotel al in the beautiful garden.","There is seating in the hotel all in the beautiful garden.","There is seating in the hotel are in the beautiful garden.","There is seating in the hotel awer in the beautiful garden.","There is seating in the hotel of in the beautiful garden.","There is seating in the hotel ore in the beautiful garden.","There is seating in the hotel os in the beautiful garden.","There is seating in the hotel our in the beautiful garden."],"modified_prediction":[4,4,4,4,3,4,4,4]},{"original_sentence":"You can sit under the vine canopy to eat your meal.","original_prediction":3,"modified_sentence":"You can sit under the vine canopy to eat your meal.","modified_prediction":4},{"original_sentence":"The hotel was very busy with coach visitors but they did not keep us waiting.","original_prediction":1,"modified_sentence":["The hotel was very busy with coach visitors but they did not cep us waiting.","The hotel was very busy with coach visitors but they did not keap us waiting."],"modified_prediction":[2,2]},{"original_sentence":"The food was delicious and the staff were charming.","original_prediction":3,"modified_sentence":"The food was delicious and the staff were charming.","modified_prediction":1},{"original_sentence":"The waitresses were dressed in traditional costume.","original_prediction":2,"modified_sentence":["The waitresses here dressed in traditional costume.","The waitresses wain dressed in traditional costume.","The waitresses we dressed in traditional costume.","The waitresses weer dressed in traditional costume.","The waitresses wey dressed in traditional costume.","The waitresses whey dressed in traditional costume.","The waitresses whir dressed in traditional costume.","The waitresses wont dressed in traditional costume.","The waitresses wre dressed in traditional costume."],"modified_prediction":[3,3,3,3,3,3,3,1,3]},{"original_sentence":"Pity we were only passing through, we would like to have stayed the night..","original_prediction":1,"modified_sentence":["Pity we were only passing through, we would lekt to have stayed the night..","Pity we were only passing through, we would lick to have stayed the night..","Pity we were only passing through, we would lire to have stayed the night.."],"modified_prediction":[0,0,0]},{"original_sentence":"The hotel is well located and the staff very friendly.","original_prediction":4,"modified_sentence":["The hotel is well located and the staff an friendly.","The hotel is well located and the staff fere friendly.","The hotel is well located and the staff lerey friendly.","The hotel is well located and the staff ver friendly.","The hotel is well located and the staff vere friendly.","The hotel is well located and the staff verey friendly.","The hotel is well located and the staff veri friendly.","The hotel is well located and the staff verry friendly.","The hotel is well located and the staff veye friendly."],"modified_prediction":[3,3,3,3,3,3,3,3,3]},{"original_sentence":"Room service options are good, mostly local food.","original_prediction":3,"modified_sentence":"Room service options are good, mostly local food.","modified_prediction":4},{"original_sentence":"Rooms are clean and confortable but there is a toilet smell in the hall ways that was off putting.","original_prediction":2,"modified_sentence":"Rooms are clean and confortable but there is a toilet smell in the hall ways that was off putting.","modified_prediction":4},{"original_sentence":"I’m not sure where the smell was coming from but I assume it was some sort of pluming issue.","original_prediction":2,"modified_sentence":"I’m not sure where the smell was coming from but I assume it was some sort of pluming issue.","modified_prediction":4},{"original_sentence":".","original_prediction":2,"modified_sentence":".","modified_prediction":4},{"original_sentence":"Chose this place as it was right on the beach and the rooms had a sea view.","original_prediction":3,"modified_sentence":["Chose this plahce ahs it wahs right on the beahch ahnd the rooms hahd ah seah view.","Chose this plance ans it wans right on the beanch annd the rooms hand an sean view.","Chose this plandce ands it wands right on the beandch andnd the rooms handd and seand view.","Chose this plarece ares it wares right on the bearech arend the rooms hared are seare view.","Chose this plthece thes it wthes right on the bethech thend the rooms hthed the sethe view."],"modified_prediction":[2,2,4,2,0]},{"original_sentence":"All good from that perspective.","original_prediction":4,"modified_sentence":"All good from that perspective.","modified_prediction":0},{"original_sentence":"It was the same price as a 5* hotel in central Cabo Frio so we were hoping for great things.","original_prediction":3,"modified_sentence":["It was the same price as a 5* hotel in central Cabo Frio so we were hopeing for great things.","It was the same price as a 5* hotel in central Cabo Frio so we were hopping for great things."],"modified_prediction":[4,4]},{"original_sentence":"However everything else was below expectations.","original_prediction":2,"modified_sentence":"However everything else was below expectations.","modified_prediction":4},{"original_sentence":"Our 'deluxe' room was shockingly basic and tiny.","original_prediction":1,"modified_sentence":"Our 'deluxe' room was shockingly basic and tiny.","modified_prediction":4},{"original_sentence":"The breakfast was perfunctory - fresh juice but no eggs and weak coffee.","original_prediction":1,"modified_sentence":["The breakfast was perfunctory - fresh juice bat no eggs and weak coffee.","The breakfast was perfunctory - fresh juice bun no eggs and weak coffee.","The breakfast was perfunctory - fresh juice buts no eggs and weak coffee.","The breakfast was perfunctory - fresh juice by no eggs and weak coffee.","The breakfast was perfunctory - fresh juice dut no eggs and weak coffee.","The breakfast was perfunctory - fresh juice p no eggs and weak coffee.","The breakfast was perfunctory - fresh juice put no eggs and weak coffee."],"modified_prediction":[0,0,0,0,0,0,0]},{"original_sentence":"Also, we arrived at 10pm to a pretty gruff welcome.","original_prediction":3,"modified_sentence":"Also, we arrived at 10pm to a pretty gruff welcome.","modified_prediction":0},{"original_sentence":"And we were never again acknowledged as we entered or left.","original_prediction":0,"modified_sentence":["And we were mever again acknowledged as we entered or left.","And we were naver again acknowledged as we entered or left.","And we were neaver again acknowledged as we entered or left.","And we were nef again acknowledged as we entered or left.","And we were neiver again acknowledged as we entered or left.","And we were nerth again acknowledged as we entered or left.","And we were nese again acknowledged as we entered or left.","And we were nether again acknowledged as we entered or left.","And we were neve again acknowledged as we entered or left.","And we were neven again acknowledged as we entered or left.","And we were newer again acknowledged as we entered or left.","And we were nven again acknowledged as we entered or left.","And we were nver again acknowledged as we entered or left."],"modified_prediction":[4,4,4,4,4,4,4,4,4,4,4,4,4]},{"original_sentence":"Our room was not cleaned the next day, and we were told they were only cleaned if keys were left with reception.","original_prediction":0,"modified_sentence":["Our room was not cleaned the next day, and we were to they were only cleaned if keys were left with reception."],"modified_prediction":[1]},{"original_sentence":"For such an eccentric behaviour, this should be made much clearer - in writing, in the room.","original_prediction":2,"modified_sentence":["For such an eccentric behaviour, this choud be made much clearer - in writing, in the room.","For such an eccentric behaviour, this sad be made much clearer - in writing, in the room.","For such an eccentric behaviour, this sade be made much clearer - in writing, in the room.","For such an eccentric behaviour, this sald be made much clearer - in writing, in the room.","For such an eccentric behaviour, this sand be made much clearer - in writing, in the room.","For such an eccentric behaviour, this saub be made much clearer - in writing, in the room.","For such an eccentric behaviour, this seud be made much clearer - in writing, in the room.","For such an eccentric behaviour, this shap be made much clearer - in writing, in the room.","For such an eccentric behaviour, this shed be made much clearer - in writing, in the room.","For such an eccentric behaviour, this sheod be made much clearer - in writing, in the room.","For such an eccentric behaviour, this shod be made much clearer - in writing, in the room.","For such an eccentric behaviour, this shode be made much clearer - in writing, in the room.","For such an eccentric behaviour, this shoed be made much clearer - in writing, in the room.","For such an eccentric behaviour, this shold be made much clearer - in writing, in the room.","For such an eccentric behaviour, this shond be made much clearer - in writing, in the room.","For such an eccentric behaviour, this shood be made much clearer - in writing, in the room.","For such an eccentric behaviour, this shoold be made much clearer - in writing, in the room.","For such an eccentric behaviour, this shotd be made much clearer - in writing, in the room.","For such an eccentric behaviour, this shound be made much clearer - in writing, in the room.","For such an eccentric behaviour, this show be made much clearer - in writing, in the room.","For such an eccentric behaviour, this shud be made much clearer - in writing, in the room.","For such an eccentric behaviour, this shued be made much clearer - in writing, in the room.","For such an eccentric behaviour, this shuld be made much clearer - in writing, in the room.","For such an eccentric behaviour, this shuord be made much clearer - in writing, in the room.","For such an eccentric behaviour, this sing be made much clearer - in writing, in the room.","For such an eccentric behaviour, this site be made much clearer - in writing, in the room.","For such an eccentric behaviour, this sob be made much clearer - in writing, in the room.","For such an eccentric behaviour, this sod be made much clearer - in writing, in the room.","For such an eccentric behaviour, this sohd be made much clearer - in writing, in the room.","For such an eccentric behaviour, this sohod be made much clearer - in writing, in the room.","For such an eccentric behaviour, this sould be made much clearer - in writing, in the room.","For such an eccentric behaviour, this stod be made much clearer - in writing, in the room.","For such an eccentric behaviour, this stoden be made much clearer - in writing, in the room.","For such an eccentric behaviour, this stood be made much clearer - in writing, in the room.","For such an eccentric behaviour, this stud be made much clearer - in writing, in the room.","For such an eccentric behaviour, this suod be made much clearer - in writing, in the room.","For such an eccentric behaviour, this surd be made much clearer - in writing, in the room."],"modified_prediction":[3,1,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3]},{"original_sentence":"Or, hey, get a spare set of keys!","original_prediction":0,"modified_sentence":["Or, hey, get a his set of keys!","Or, hey, get a score set of keys!","Or, hey, get a shaper set of keys!","Or, hey, get a share set of keys!","Or, hey, get a spair set of keys!"],"modified_prediction":[2,2,2,4,2]},{"original_sentence":"I feel if you're staying in a small property like this, it's down to the owners to create a welcoming and personable atmosphere.","original_prediction":2,"modified_sentence":["I feel if you're staying in a small property like this, it's ben to the owners to create a welcoming and personable atmosphere.","I feel if you're staying in a small property like this, it's bonw to the owners to create a welcoming and personable atmosphere.","I feel if you're staying in a small property like this, it's bown to the owners to create a welcoming and personable atmosphere.","I feel if you're staying in a small property like this, it's dawn to the owners to create a welcoming and personable atmosphere.","I feel if you're staying in a small property like this, it's dome to the owners to create a welcoming and personable atmosphere.","I feel if you're staying in a small property like this, it's done to the owners to create a welcoming and personable atmosphere.","I feel if you're staying in a small property like this, it's dowe to the owners to create a welcoming and personable atmosphere.","I feel if you're staying in a small property like this, it's dowen to the owners to create a welcoming and personable atmosphere.","I feel if you're staying in a small property like this, it's dun to the owners to create a welcoming and personable atmosphere.","I feel if you're staying in a small property like this, it's town to the owners to create a welcoming and personable atmosphere.","I feel if you're staying in a small property like this, it's wen to the owners to create a welcoming and personable atmosphere."],"modified_prediction":[3,3,3,3,3,3,3,3,3,3,3]},{"original_sentence":"And this was sadly lacking at On Shore.","original_prediction":1,"modified_sentence":"And this was sadly lacking at On Shore.","modified_prediction":3},{"original_sentence":"We might as well have been a wad of banknotes for processing.","original_prediction":2,"modified_sentence":["We maiht as well have been a wad of banknotes for processing.","We mit as well have been a wad of banknotes for processing.","We mite as well have been a wad of banknotes for processing.","We my as well have been a wad of banknotes for processing."],"modified_prediction":[4,4,3,4]},{"original_sentence":".","original_prediction":2,"modified_sentence":".","modified_prediction":4},{"original_sentence":"The beach is just across the road from the hotel, so it's a great place if you like strolling barefoot along the seaside.","original_prediction":3,"modified_sentence":"The beach is just across the road from the hotel, so it's a great place if you like strolling barefoot along the seaside.","modified_prediction":4},{"original_sentence":"A nice breakfast is included.","original_prediction":3,"modified_sentence":"A nice breakfast is included.","modified_prediction":4},{"original_sentence":"Would recommend if you're looking for a more secluded area of the beach..","original_prediction":2,"modified_sentence":"Would recommend if you're looking for a more secluded area of the beach..","modified_prediction":4},{"original_sentence":"The pousada is 10 metres from Praia do Foguete in between Cabo Frio and Arrail do Cabo.","original_prediction":3,"modified_sentence":"The pousada is 10 metres from Praia do Foguete in between Cabo Frio and Arrail do Cabo.","modified_prediction":4},{"original_sentence":"I recommend a room with a sea view.","original_prediction":3,"modified_sentence":"I recommend a room with a sea view.","modified_prediction":4},{"original_sentence":"It was nice to stand on the balcony and take in the beautiful view.","original_prediction":3,"modified_sentence":"It was nice to stand on the balcony and take in the beautiful view.","modified_prediction":4},{"original_sentence":"The hotel bar is a great place (and one of few places nearby) to have a drink and hang out.","original_prediction":4,"modified_sentence":["The hotel bar is a act place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a and place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a carot place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a cat place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a cater place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a coird place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a crat place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a crate place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a cret place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a fatd place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a fod place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a frat place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a frate place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a gaet place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a gant place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a gart place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a garte place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a gat place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a gata place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a gate place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a gater place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a gatr place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a geant place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a geart place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a geat place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a gent place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a gert place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a gerted place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a get place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a ggot place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a gleent place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a gorold place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a gote place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a graet place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a grait place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a grant place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a grat place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a grate place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a greater place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a grent place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a gret place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a grete place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a grit place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a grt place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a grut place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a guat place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a seing place (and one of few places nearby) to have a drink and hang out.","The hotel bar is a thunte place (and one of few places nearby) to have a drink and hang out."],"modified_prediction":[3,3,3,3,3,3,3,1,3,2,3,2,2,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,2,3,3,3,3,3,3,2,3,3]},{"original_sentence":"I would recommend this pousada to anyone looking for some quiet time.","original_prediction":3,"modified_sentence":["I would recommend this pousada to anyone looking for same quiet time.","I would recommend this pousada to anyone looking for sane quiet time.","I would recommend this pousada to anyone looking for so quiet time."],"modified_prediction":[4,4,4]},{"original_sentence":"This pousada is by far the best accommodation for its price in the area.","original_prediction":4,"modified_sentence":["This pousada is by far the bass accommodation for its price in the area.","This pousada is by far the bast accommodation for its price in the area.","This pousada is by far the be accommodation for its price in the area.","This pousada is by far the beast accommodation for its price in the area.","This pousada is by far the bes accommodation for its price in the area.","This pousada is by far the besd accommodation for its price in the area.","This pousada is by far the besh accommodation for its price in the area.","This pousada is by far the bess accommodation for its price in the area.","This pousada is by far the bet accommodation for its price in the area.","This pousada is by far the bettes accommodation for its price in the area.","This pousada is by far the bister accommodation for its price in the area.","This pousada is by far the biwes accommodation for its price in the area."],"modified_prediction":[3,2,3,3,3,3,2,3,3,3,3,3]},{"original_sentence":"Breakfast included.The owners are very relaxed and we felt as if we were at home.. Having seen previous reviews being ok, I booked a one night stay, in one room for my two friends, as we were staying elsewhere.","original_prediction":3,"modified_sentence":"Breakfast included.The owners are very relaxed and we felt as if we were at home.. Having seen previous reviews being ok, I booked a one night stay, in one room for my two friends, as we were staying elsewhere.","modified_prediction":4},{"original_sentence":"The owner insisted stridently when they  checks in that I had 2 rooms booked, not 1, this despite all the documentary evidence proving otherwise.","original_prediction":0,"modified_sentence":["The onwer insisted stridently when they  checks in that I had 2 rooms booked, not 1, this despite all the documentary evidence proving otherwise."],"modified_prediction":[1]},{"original_sentence":"He had clearly made a mistake, but....I have been subsequently compensated by the booking app and barclaycard, as when we came the following morning to collect our friends and prove he was incorrect, he not only proceeded, without authorisation, after we left, to debit my Barclaycard for this imaginary, non existent booking ( which he even claimed he had made for me in another hotel!!?)","original_prediction":0,"modified_sentence":"He had clearly made a mistake, but....I have been subsequently compensated by the booking app and barclaycard, as when we came the following morning to collect our friends and prove he was incorrect, he not only proceeded, without authorisation, after we left, to debit my Barclaycard for this imaginary, non existent booking ( which he even claimed he had made for me in another hotel!!?)","modified_prediction":1},{"original_sentence":"Frightened by his anger and with a steep staircase behind me, I ran away downstairs to my husband and friends who were packing the car outside, oblivious.","original_prediction":1,"modified_sentence":["Frightened by his anger and with a steep staircase behind me, I ran a_ware downstairs to my husband and friends who were packing the car outside, oblivious.","Frightened by his anger and with a steep staircase behind me, I ran a_way downstairs to my husband and friends who were packing the car outside, oblivious.","Frightened by his anger and with a steep staircase behind me, I ran a_wean downstairs to my husband and friends who were packing the car outside, oblivious.","Frightened by his anger and with a steep staircase behind me, I ran a_with downstairs to my husband and friends who were packing the car outside, oblivious.","Frightened by his anger and with a steep staircase behind me, I ran alway downstairs to my husband and friends who were packing the car outside, oblivious.","Frightened by his anger and with a steep staircase behind me, I ran auay downstairs to my husband and friends who were packing the car outside, oblivious.","Frightened by his anger and with a steep staircase behind me, I ran aveoy downstairs to my husband and friends who were packing the car outside, oblivious.","Frightened by his anger and with a steep staircase behind me, I ran awar downstairs to my husband and friends who were packing the car outside, oblivious.","Frightened by his anger and with a steep staircase behind me, I ran aware downstairs to my husband and friends who were packing the car outside, oblivious.","Frightened by his anger and with a steep staircase behind me, I ran awart downstairs to my husband and friends who were packing the car outside, oblivious.","Frightened by his anger and with a steep staircase behind me, I ran awerea downstairs to my husband and friends who were packing the car outside, oblivious.","Frightened by his anger and with a steep staircase behind me, I ran awya downstairs to my husband and friends who were packing the car outside, oblivious.","Frightened by his anger and with a steep staircase behind me, I ran ayay downstairs to my husband and friends who were packing the car outside, oblivious.","Frightened by his anger and with a steep staircase behind me, I ran wag downstairs to my husband and friends who were packing the car outside, oblivious.","Frightened by his anger and with a steep staircase behind me, I ran war downstairs to my husband and friends who were packing the car outside, oblivious.","Frightened by his anger and with a steep staircase behind me, I ran wraway downstairs to my husband and friends who were packing the car outside, oblivious."],"modified_prediction":[4,4,4,4,4,4,4,4,3,4,4,4,4,4,4,4]},{"original_sentence":"He then tried, in front of them, to again go for me; my husband intervened and we quickly got into the car all very shaken up indeed as he continued to rant at us, even saying give me 40 euros and we will call it quits!","original_prediction":0,"modified_sentence":"He then tried, in front of them, to again go for me; my husband intervened and we quickly got into the car all very shaken up indeed as he continued to rant at us, even saying give me 40 euros and we will call it quits!","modified_prediction":4},{"original_sentence":"He just would not accept that he had made an error, despite our clear booking confirm.","original_prediction":0,"modified_sentence":["He just would not axcept that he had made an error, despite our clear booking confirm."],"modified_prediction":[1]},{"original_sentence":"Not a safe place for women on their own as he clearly thinks it is ok to hit you.","original_prediction":1,"modified_sentence":"Not a safe place for women on their own as he clearly thinks it is ok to hit you.","modified_prediction":0},{"original_sentence":"So I have no idea re other reviews which say how ok he is, he certainly was not with us.","original_prediction":1,"modified_sentence":["So I have no idea re other reviews which say how ok he is, he certainly was hot with us.","So I have no idea re other reviews which say how ok he is, he certainly was knot with us.","So I have no idea re other reviews which say how ok he is, he certainly was mot with us.","So I have no idea re other reviews which say how ok he is, he certainly was nat with us.","So I have no idea re other reviews which say how ok he is, he certainly was nol with us.","So I have no idea re other reviews which say how ok he is, he certainly was non with us.","So I have no idea re other reviews which say how ok he is, he certainly was on with us.","So I have no idea re other reviews which say how ok he is, he certainly was ont with us.","So I have no idea re other reviews which say how ok he is, he certainly was out with us."],"modified_prediction":[2,2,2,2,2,2,2,2,2]},{"original_sentence":"Quaint town and fab market.. A lovely old house, a part of which dates back to the 8th Century.","original_prediction":3,"modified_sentence":"Quaint town and fab market.. A lovely old house, a part of which dates back to the 8th Century.","modified_prediction":2},{"original_sentence":"Great hosts who were very friendly and took interest in who we were and what we were doing in the South of France.","original_prediction":4,"modified_sentence":"Great hosts who were very friendly and took interest in who we were and what we were doing in the South of France.","modified_prediction":2},{"original_sentence":"Lovely food at breakfast.","original_prediction":4,"modified_sentence":"Lovely food at breakfast.","modified_prediction":2},{"original_sentence":"The bonus was staying in the small apartment on the top floor with doors out onto a balcony.","original_prediction":3,"modified_sentence":["The bonas was staying in the small apartment on the top floor with doors out onto a balcony."],"modified_prediction":[2]},{"original_sentence":"Very comfortable bed and beautifully furnished room.","original_prediction":4,"modified_sentence":"Very comfortable bed and beautifully furnished room.","modified_prediction":2},{"original_sentence":"Almost forgot the pool!","original_prediction":1,"modified_sentence":["Almost foregot the pool!","Almost frogot the pool!"],"modified_prediction":[2,0]},{"original_sentence":"All in all, a gem of a place and would highly recommend.. Not to hard to find in the day light, and lives up to the wonderful photos.","original_prediction":4,"modified_sentence":"All in all, a gem of a place and would highly recommend.. Not to hard to find in the day light, and lives up to the wonderful photos.","modified_prediction":0},{"original_sentence":"Was a little concerened about some of the reviews that we had read, and indeed to owners take some getting used to, very chatty, once we settled in and yes they still have a big dog.","original_prediction":2,"modified_sentence":["Was a lette concerened about some of the reviews that we had read, and indeed to owners take some getting used to, very chatty, once we settled in and yes they still have a big dog.","Was a lettel concerened about some of the reviews that we had read, and indeed to owners take some getting used to, very chatty, once we settled in and yes they still have a big dog.","Was a lettle concerened about some of the reviews that we had read, and indeed to owners take some getting used to, very chatty, once we settled in and yes they still have a big dog.","Was a lital concerened about some of the reviews that we had read, and indeed to owners take some getting used to, very chatty, once we settled in and yes they still have a big dog.","Was a litl concerened about some of the reviews that we had read, and indeed to owners take some getting used to, very chatty, once we settled in and yes they still have a big dog.","Was a litle concerened about some of the reviews that we had read, and indeed to owners take some getting used to, very chatty, once we settled in and yes they still have a big dog.","Was a littal concerened about some of the reviews that we had read, and indeed to owners take some getting used to, very chatty, once we settled in and yes they still have a big dog.","Was a litte concerened about some of the reviews that we had read, and indeed to owners take some getting used to, very chatty, once we settled in and yes they still have a big dog.","Was a littel concerened about some of the reviews that we had read, and indeed to owners take some getting used to, very chatty, once we settled in and yes they still have a big dog.","Was a littele concerened about some of the reviews that we had read, and indeed to owners take some getting used to, very chatty, once we settled in and yes they still have a big dog.","Was a littl concerened about some of the reviews that we had read, and indeed to owners take some getting used to, very chatty, once we settled in and yes they still have a big dog.","Was a tittel concerened about some of the reviews that we had read, and indeed to owners take some getting used to, very chatty, once we settled in and yes they still have a big dog."],"modified_prediction":[1,1,1,1,1,1,1,1,1,1,1,1]},{"original_sentence":"The room was lovely, great bed and a good nights sleep.","original_prediction":4,"modified_sentence":["The room was lovely, act bed and a good nights sleep.","The room was lovely, and bed and a good nights sleep.","The room was lovely, carot bed and a good nights sleep.","The room was lovely, cat bed and a good nights sleep.","The room was lovely, cater bed and a good nights sleep.","The room was lovely, coird bed and a good nights sleep.","The room was lovely, crat bed and a good nights sleep.","The room was lovely, crate bed and a good nights sleep.","The room was lovely, cret bed and a good nights sleep.","The room was lovely, fatd bed and a good nights sleep.","The room was lovely, fod bed and a good nights sleep.","The room was lovely, frat bed and a good nights sleep.","The room was lovely, frate bed and a good nights sleep.","The room was lovely, gaet bed and a good nights sleep.","The room was lovely, gant bed and a good nights sleep.","The room was lovely, gart bed and a good nights sleep.","The room was lovely, garte bed and a good nights sleep.","The room was lovely, gat bed and a good nights sleep.","The room was lovely, gata bed and a good nights sleep.","The room was lovely, gate bed and a good nights sleep.","The room was lovely, gater bed and a good nights sleep.","The room was lovely, gatr bed and a good nights sleep.","The room was lovely, geant bed and a good nights sleep.","The room was lovely, geart bed and a good nights sleep.","The room was lovely, geat bed and a good nights sleep.","The room was lovely, gent bed and a good nights sleep.","The room was lovely, gert bed and a good nights sleep.","The room was lovely, gerted bed and a good nights sleep.","The room was lovely, ggot bed and a good nights sleep.","The room was lovely, gleent bed and a good nights sleep.","The room was lovely, gorold bed and a good nights sleep.","The room was lovely, gote bed and a good nights sleep.","The room was lovely, graet bed and a good nights sleep.","The room was lovely, grait bed and a good nights sleep.","The room was lovely, grant bed and a good nights sleep.","The room was lovely, grat bed and a good nights sleep.","The room was lovely, grate bed and a good nights sleep.","The room was lovely, greater bed and a good nights sleep.","The room was lovely, grent bed and a good nights sleep.","The room was lovely, gret bed and a good nights sleep.","The room was lovely, grete bed and a good nights sleep.","The room was lovely, grit bed and a good nights sleep.","The room was lovely, grt bed and a good nights sleep.","The room was lovely, grut bed and a good nights sleep.","The room was lovely, guat bed and a good nights sleep.","The room was lovely, seing bed and a good nights sleep.","The room was lovely, thunte bed and a good nights sleep."],"modified_prediction":[3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3]},{"original_sentence":"Its a bit tricky to find even with GPS, and the laneways are quite small and steep for car access.","original_prediction":2,"modified_sentence":["Its a bit tricky to find even with GPS, and the laneways are quite small and steep foir car access.","Its a bit tricky to find even with GPS, and the laneways are quite small and steep fon car access.","Its a bit tricky to find even with GPS, and the laneways are quite small and steep foow car access.","Its a bit tricky to find even with GPS, and the laneways are quite small and steep fore car access.","Its a bit tricky to find even with GPS, and the laneways are quite small and steep forr car access.","Its a bit tricky to find even with GPS, and the laneways are quite small and steep four car access.","Its a bit tricky to find even with GPS, and the laneways are quite small and steep fre car access.","Its a bit tricky to find even with GPS, and the laneways are quite small and steep fro car access.","Its a bit tricky to find even with GPS, and the laneways are quite small and steep fror car access.","Its a bit tricky to find even with GPS, and the laneways are quite small and steep frou car access."],"modified_prediction":[3,3,3,3,3,3,3,3,3,3]},{"original_sentence":"There is a better roadway at the end of the one way lane where the B&B is located (about 50m walk) where you park, so recommend you have a look on a map and use that as access as it will be much easier.","original_prediction":2,"modified_sentence":["There is a bet roadway at the end of the one way lane where the B&B is located (about 50m walk) where you park, so recommend you have a look on a map and use that as access as it will be much easier.","There is a beter roadway at the end of the one way lane where the B&B is located (about 50m walk) where you park, so recommend you have a look on a map and use that as access as it will be much easier."],"modified_prediction":[3,3]},{"original_sentence":"Bed was ok.","original_prediction":2,"modified_sentence":"Bed was ok.","modified_prediction":3},{"original_sentence":"Located in a quaint village which has a superb restuarant..","original_prediction":4,"modified_sentence":"Located in a quaint village which has a superb restuarant..","modified_prediction":3},{"original_sentence":"It is a beautiful very old house.","original_prediction":4,"modified_sentence":["It is a baeatiful very old house.","It is a baeutiful very old house.","It is a baful very old house.","It is a barend very old house.","It is a barler very old house.","It is a batfl very old house.","It is a baufill very old house.","It is a bautful very old house.","It is a bauthful very old house.","It is a bautiful very old house.","It is a beabbey very old house.","It is a beacful very old house.","It is a beaflur very old house.","It is a beafter very old house.","It is a beaotiful very old house.","It is a beatefall very old house.","It is a beateful very old house.","It is a beatifull very old house.","It is a beatufel very old house.","It is a beatuful very old house.","It is a beaty very old house.","It is a beatyfool very old house.","It is a beauiful very old house.","It is a beauitful very old house.","It is a bef very old house.","It is a befare very old house.","It is a befertl very old house.","It is a befulaful very old house.","It is a befull very old house.","It is a beiatiful very old house.","It is a beired very old house.","It is a beitiful very old house.","It is a beituful very old house.","It is a beiutefull very old house.","It is a beiytful very old house.","It is a belfull very old house.","It is a besthe very old house.","It is a betafull very old house.","It is a betefull very old house.","It is a betewel very old house.","It is a betfle very old house.","It is a betfol very old house.","It is a betful very old house.","It is a betfull very old house.","It is a betifoll very old house.","It is a betiful very old house.","It is a betifull very old house.","It is a betufel very old house.","It is a betuful very old house.","It is a betuiful very old house.","It is a beuefull very old house.","It is a beuful very old house.","It is a beufut very old house.","It is a beuitful very old house.","It is a beuitifiel very old house.","It is a beuitiful very old house.","It is a beuntfut very old house.","It is a beuteful very old house.","It is a beutful very old house.","It is a beutifal very old house.","It is a beutifall very old house.","It is a beutifiel very old house.","It is a beutiful very old house.","It is a beutifull very old house.","It is a beutifully very old house.","It is a beuttifull very old house.","It is a bfle very old house.","It is a bieytful very old house.","It is a bifull very old house.","It is a birfull very old house.","It is a birutful very old house.","It is a biutefell very old house.","It is a biutiful very old house.","It is a boatyful very old house.","It is a boetiful very old house.","It is a bofl very old house.","It is a bootf very old house.","It is a boots very old house.","It is a borol very old house.","It is a boterfull very old house.","It is a botfl very old house.","It is a botfol very old house.","It is a botfoll very old house.","It is a botifel very old house.","It is a bott very old house.","It is a boutfle very old house.","It is a boutyfull very old house.","It is a breatful very old house.","It is a bretfoll very old house.","It is a breuf very old house.","It is a brihifull very old house.","It is a bruteful very old house.","It is a brutiful very old house.","It is a btitfal very old house.","It is a buathefllue very old house.","It is a bueatiful very old house.","It is a bueatyful very old house.","It is a buedfall very old house.","It is a buefle very old house.","It is a bueful very old house.","It is a bueiful very old house.","It is a bueiteful very old house.","It is a bueityful very old house.","It is a buetiful very old house.","It is a buetifur very old house.","It is a bufer very old house.","It is a bufinle very old house.","It is a bufle very old house.","It is a buflle very old house.","It is a buiteeful very old house.","It is a buitef very old house.","It is a buiteful very old house.","It is a buitefull very old house.","It is a buitfoll very old house.","It is a buitful very old house.","It is a buitfull very old house.","It is a buitiful very old house.","It is a buitifull very old house.","It is a bulful very old house.","It is a bulifut very old house.","It is a bultlyfull very old house.","It is a buretiful very old house.","It is a burfteful very old house.","It is a burtefull very old house.","It is a butaful very old house.","It is a butarfel very old house.","It is a butefl very old house.","It is a butefole very old house.","It is a buteful very old house.","It is a butefull very old house.","It is a buteiful very old house.","It is a buterful very old house.","It is a butfle very old house.","It is a butfll very old house.","It is a butful very old house.","It is a butfull very old house.","It is a butifel very old house.","It is a butifely very old house.","It is a butifill very old house.","It is a butiful very old house.","It is a butifull very old house.","It is a butlek very old house.","It is a buttd very old house.","It is a buttful very old house.","It is a buttle very old house.","It is a buttlfule very old house.","It is a butufal very old house.","It is a butyful very old house.","It is a buutivol very old house.","It is a byetifer very old house.","It is a dartth very old house.","It is a dearbul very old house.","It is a deauitful very old house.","It is a derert very old house.","It is a doine very old house.","It is a dotfal very old house.","It is a dotifol very old house.","It is a dotirol very old house.","It is a dratil very old house.","It is a dthering very old house.","It is a dufleerth very old house.","It is a duteful very old house.","It is a hahlhelf very old house.","It is a peoterd very old house.","It is a petfi very old house.","It is a pirlf very old house.","It is a pont very old house.","It is a potefl very old house.","It is a ptafil very old house.","It is a puteyful very old house.","It is a putfull very old house."],"modified_prediction":[3,2,0,2,2,2,2,2,2,2,2,3,2,2,2,2,3,3,2,2,3,2,3,3,2,3,2,3,3,3,2,2,2,2,2,3,3,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,3,2,2,2,2,3,2,2,2,1,1,2,2,2,2,2,2,2,2,2,2,2,3,2,1,2,1,1,3,2,2,3,0,2,2,1,2,1,2,2,2,2,1,2,2,1,1,1,2,1,2,2,2,2,2,2,1,1,2,3,2,2,2,2,2,1,1,2,2,1,2,2,2,2,3,2,2,2,2,2,2,2,2,2,3,3,3,2,2,2,2,2,2,2,2,2,3,1,2,3,2,3,2,3,2,2]},{"original_sentence":"We had a gorgeous apartment on 3 floors - if you count the top floor balcony.","original_prediction":4,"modified_sentence":["We had a corgss apartment on 3 floors - if you count the top floor balcony.","We had a courgious apartment on 3 floors - if you count the top floor balcony.","We had a garechs apartment on 3 floors - if you count the top floor balcony.","We had a geogrous apartment on 3 floors - if you count the top floor balcony.","We had a georgeous apartment on 3 floors - if you count the top floor balcony.","We had a georgious apartment on 3 floors - if you count the top floor balcony.","We had a georgous apartment on 3 floors - if you count the top floor balcony.","We had a georgus apartment on 3 floors - if you count the top floor balcony.","We had a gergious apartment on 3 floors - if you count the top floor balcony.","We had a gerious apartment on 3 floors - if you count the top floor balcony.","We had a gerougous apartment on 3 floors - if you count the top floor balcony.","We had a gorages apartment on 3 floors - if you count the top floor balcony.","We had a gordeous apartment on 3 floors - if you count the top floor balcony.","We had a gordges apartment on 3 floors - if you count the top floor balcony.","We had a gordgous apartment on 3 floors - if you count the top floor balcony.","We had a gordias apartment on 3 floors - if you count the top floor balcony.","We had a gordigous apartment on 3 floors - if you count the top floor balcony.","We had a gordious apartment on 3 floors - if you count the top floor balcony.","We had a gordius apartment on 3 floors - if you count the top floor balcony.","We had a gordous apartment on 3 floors - if you count the top floor balcony.","We had a gorduious apartment on 3 floors - if you count the top floor balcony.","We had a gorduous apartment on 3 floors - if you count the top floor balcony.","We had a gordus apartment on 3 floors - if you count the top floor balcony.","We had a goregous apartment on 3 floors - if you count the top floor balcony.","We had a goreous apartment on 3 floors - if you count the top floor balcony.","We had a gorestrous apartment on 3 floors - if you count the top floor balcony.","We had a gorgas apartment on 3 floors - if you count the top floor balcony.","We had a gorgeious apartment on 3 floors - if you count the top floor balcony.","We had a gorges apartment on 3 floors - if you count the top floor balcony.","We had a gorgess apartment on 3 floors - if you count the top floor balcony.","We had a gorgeus apartment on 3 floors - if you count the top floor balcony.","We had a gorgioud apartment on 3 floors - if you count the top floor balcony.","We had a gorgious apartment on 3 floors - if you count the top floor balcony.","We had a gorgius apartment on 3 floors - if you count the top floor balcony.","We had a gorgous apartment on 3 floors - if you count the top floor balcony.","We had a gorgouse apartment on 3 floors - if you count the top floor balcony.","We had a gorguis apartment on 3 floors - if you count the top floor balcony.","We had a gorgus apartment on 3 floors - if you count the top floor balcony.","We had a gorguses apartment on 3 floors - if you count the top floor balcony.","We had a gorguss apartment on 3 floors - if you count the top floor balcony.","We had a gorious apartment on 3 floors - if you count the top floor balcony.","We had a gorjous apartment on 3 floors - if you count the top floor balcony.","We had a gorjust apartment on 3 floors - if you count the top floor balcony.","We had a goudeous apartment on 3 floors - if you count the top floor balcony.","We had a gourgace apartment on 3 floors - if you count the top floor balcony.","We had a gourgeous apartment on 3 floors - if you count the top floor balcony.","We had a gourgous apartment on 3 floors - if you count the top floor balcony.","We had a gourougas apartment on 3 floors - if you count the top floor balcony.","We had a gourous apartment on 3 floors - if you count the top floor balcony.","We had a gouvges apartment on 3 floors - if you count the top floor balcony.","We had a goyorges apartment on 3 floors - if you count the top floor balcony.","We had a guorgeous apartment on 3 floors - if you count the top floor balcony."],"modified_prediction":[2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,1,2,2,2,2,3,2,2,2,2,2,2,2,2,2,2,2,2,2,2,1,2,2,2,2,2,2]},{"original_sentence":"The bed was very comfy.","original_prediction":1,"modified_sentence":"The bed was very comfy.","modified_prediction":2},{"original_sentence":"The shower was excellent as was the free wi fi.","original_prediction":4,"modified_sentence":["The shower was exerlant as was the free wi fi."],"modified_prediction":[2]},{"original_sentence":"Very nice owners and excellent breakfast.","original_prediction":4,"modified_sentence":"Very nice owners and excellent breakfast.","modified_prediction":2},{"original_sentence":"There was good free parking nearby.","original_prediction":3,"modified_sentence":"There was good free parking nearby.","modified_prediction":2},{"original_sentence":"It was difficult to find.","original_prediction":1,"modified_sentence":["It was bifocolt to find.","It was difi to find."],"modified_prediction":[2,2]},{"original_sentence":"It does not seem to be in Rue Notre Dame as stated and we had to get a local to show us.","original_prediction":1,"modified_sentence":["It does not seem to be in Rue Notre Dame as stated and we add to get a local to show us.","It does not seem to be in Rue Notre Dame as stated and we ade to get a local to show us.","It does not seem to be in Rue Notre Dame as stated and we at to get a local to show us.","It does not seem to be in Rue Notre Dame as stated and we han to get a local to show us.","It does not seem to be in Rue Notre Dame as stated and we have to get a local to show us."],"modified_prediction":[2,2,2,2,2]},{"original_sentence":"I wish we could have stayed much much longer.","original_prediction":2,"modified_sentence":"I wish we could have stayed much much longer.","modified_prediction":1},{"original_sentence":".","original_prediction":2,"modified_sentence":".","modified_prediction":1},{"original_sentence":"Lovely stay at Pousade Ouro Verde.","original_prediction":4,"modified_sentence":"Lovely stay at Pousade Ouro Verde.","modified_prediction":1},{"original_sentence":"Rita is very nice and so welcoming.","original_prediction":4,"modified_sentence":"Rita is very nice and so welcoming.","modified_prediction":1},{"original_sentence":"The hotel is quirky and authentic and Rita is onsite to help with anything you need.","original_prediction":4,"modified_sentence":"The hotel is quirky and authentic and Rita is onsite to help with anything you need.","modified_prediction":1},{"original_sentence":"The rooms are small, but you're not going to Ilha Grande to sit in your room, and they're perfectly clean.","original_prediction":4,"modified_sentence":["The rooms are small, but you're not going to Ilha Grande to sit in your room, and they're perfactly clean."],"modified_prediction":[3]},{"original_sentence":"Rita is full of tips -- for where to go, what to see, what to eat, and she speaks both English and Spanish, as well as her native Portugueses.","original_prediction":4,"modified_sentence":["Rita is full of tips -- for where to go, what to see, what to eat, and she speaks both English and Spanish, as wall as her native Portugueses."],"modified_prediction":[3]},{"original_sentence":"On our last day, our boat was not until 5:30pm, and as it was the off season, she offered us to keep the room for the day.","original_prediction":3,"modified_sentence":"On our last day, our boat was not until 5:30pm, and as it was the off season, she offered us to keep the room for the day.","modified_prediction":4},{"original_sentence":"A real find, especially for the value..","original_prediction":4,"modified_sentence":["A reel find, especially for the value.."],"modified_prediction":[3]},{"original_sentence":"When we arrived the owner, Rita, received us with kindness and answered all are questions about the island.","original_prediction":4,"modified_sentence":"When we arrived the owner, Rita, received us with kindness and answered all are questions about the island.","modified_prediction":3},{"original_sentence":"The breakfast is awesome, a lot of fruits and biscuits, and you can feed monkeys while having it!","original_prediction":4,"modified_sentence":"The breakfast is awesome, a lot of fruits and biscuits, and you can feed monkeys while having it!","modified_prediction":3},{"original_sentence":"Not a party place and is located a bit uphill, but I would come back.","original_prediction":2,"modified_sentence":["Not a party place and is located a bit uphill, bat I would come back.","Not a party place and is located a bit uphill, bun I would come back.","Not a party place and is located a bit uphill, buts I would come back.","Not a party place and is located a bit uphill, by I would come back.","Not a party place and is located a bit uphill, byt I would come back.","Not a party place and is located a bit uphill, dut I would come back.","Not a party place and is located a bit uphill, p I would come back.","Not a party place and is located a bit uphill, put I would come back."],"modified_prediction":[1,1,1,1,1,1,1,1]},{"original_sentence":".","original_prediction":2,"modified_sentence":".","modified_prediction":1},{"original_sentence":"We loved staying at Ouro Verde.","original_prediction":4,"modified_sentence":"We loved staying at Ouro Verde.","modified_prediction":1},{"original_sentence":"It was great to be slightly removed from the main village, in the middle of the forest.","original_prediction":3,"modified_sentence":["It was great to be slighlty removed from the main village, in the middle of the forest."],"modified_prediction":[4]},{"original_sentence":"Rodrigo (the owner) and Maria (the manager) were so attentive, helpful, and fun to talk to.","original_prediction":4,"modified_sentence":["Rodrigo (the owner) and Maria (the manager) were said attentive, helpful, and fun to talk to.","Rodrigo (the owner) and Maria (the manager) were san attentive, helpful, and fun to talk to.","Rodrigo (the owner) and Maria (the manager) were sane attentive, helpful, and fun to talk to.","Rodrigo (the owner) and Maria (the manager) were sat attentive, helpful, and fun to talk to.","Rodrigo (the owner) and Maria (the manager) were saw attentive, helpful, and fun to talk to.","Rodrigo (the owner) and Maria (the manager) were slow attentive, helpful, and fun to talk to.","Rodrigo (the owner) and Maria (the manager) were soe attentive, helpful, and fun to talk to.","Rodrigo (the owner) and Maria (the manager) were soen attentive, helpful, and fun to talk to.","Rodrigo (the owner) and Maria (the manager) were sol attentive, helpful, and fun to talk to.","Rodrigo (the owner) and Maria (the manager) were som attentive, helpful, and fun to talk to.","Rodrigo (the owner) and Maria (the manager) were some attentive, helpful, and fun to talk to.","Rodrigo (the owner) and Maria (the manager) were sor attentive, helpful, and fun to talk to.","Rodrigo (the owner) and Maria (the manager) were sow attentive, helpful, and fun to talk to.","Rodrigo (the owner) and Maria (the manager) were sung attentive, helpful, and fun to talk to.","Rodrigo (the owner) and Maria (the manager) were yahet attentive, helpful, and fun to talk to."],"modified_prediction":[3,3,3,3,3,3,3,3,3,3,3,3,3,3,3]},{"original_sentence":"The best thing about our stay however was that every morning Rodrigo and Rita would have breakfast and chat about the day before, we felt so at ease and at home here, 100% would recommend!!.","original_prediction":3,"modified_sentence":["The best thing about our stay how was that every morning Rodrigo and Rita would have breakfast and chat about the day before, we felt so at ease and at home here, 100% would recommend!!.","The best thing about our stay howeverr was that every morning Rodrigo and Rita would have breakfast and chat about the day before, we felt so at ease and at home here, 100% would recommend!!.","The best thing about our stay howevery was that every morning Rodrigo and Rita would have breakfast and chat about the day before, we felt so at ease and at home here, 100% would recommend!!.","The best thing about our stay howevever was that every morning Rodrigo and Rita would have breakfast and chat about the day before, we felt so at ease and at home here, 100% would recommend!!.","The best thing about our stay howver was that every morning Rodrigo and Rita would have breakfast and chat about the day before, we felt so at ease and at home here, 100% would recommend!!."],"modified_prediction":[4,4,4,4,4]},{"original_sentence":"You can drive into the property leaving your car off the street.","original_prediction":4,"modified_sentence":"You can drive into the property leaving your car off the street.","modified_prediction":3},{"original_sentence":"Accommodation was very comfortable, lovely swimming pool, spacious shower and breakfast was delicious!","original_prediction":4,"modified_sentence":"Accommodation was very comfortable, lovely swimming pool, spacious shower and breakfast was delicious!","modified_prediction":3},{"original_sentence":"Attentive customer service from the owners, with english translation service provided by their teenage son and daughter!","original_prediction":4,"modified_sentence":"Attentive customer service from the owners, with english translation service provided by their teenage son and daughter!","modified_prediction":3},{"original_sentence":"I recommend staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","original_prediction":3,"modified_sentence":["I commend staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I recamente staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I reccomend staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I reccommend staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I reccommended staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I reccomnend staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I recemend staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I reckamend staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I recogmend staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I recomenand staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I recomend staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I recomened staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I recommand staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I recommaned staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I recommed staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I recommended staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I recomned staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I recomnend staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I recremend staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I renimation staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","I rocommend staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself."],"modified_prediction":[4,0,0,0,0,0,0,0,4,4,4,4,4,4,0,2,4,4,4,0,0]},{"original_sentence":"(A bewildering array of very hilly one way streets badly signposted and great difficulty finding one's hotel; and a long walk to the main squares as well).. central   good  air condition  coffee   machine    mini  bar   safe   great  service \n help from   receptionist  \nfor  the next  trip   -  (   make some  call  for  us \npublic  parking   25 eur    for  few  hours   \ngood  breakfast \nwater  battle  complementary.","original_prediction":3,"modified_sentence":"(A bewildering array of very hilly one way streets badly signposted and great difficulty finding one's hotel; and a long walk to the main squares as well).. central   good  air condition  coffee   machine    mini  bar   safe   great  service \n help from   receptionist  \nfor  the next  trip   -  (   make some  call  for  us \npublic  parking   25 eur    for  few  hours   \ngood  breakfast \nwater  battle  complementary.","modified_prediction":0},{"original_sentence":"Lovely clean hotel, staff were very helpful, bar was open anytime we needed it to be.","original_prediction":4,"modified_sentence":"Lovely clean hotel, staff were very helpful, bar was open anytime we needed it to be.","modified_prediction":0},{"original_sentence":"LOL!","original_prediction":4,"modified_sentence":"LOL!","modified_prediction":0},{"original_sentence":"Close to all the shops and restaurants really nice location.","original_prediction":4,"modified_sentence":["Close to all the shops and restaurants arealy nice location.","Close to all the shops and restaurants remely nice location.","Close to all the shops and restaurants weer nice location.","Close to all the shops and restaurants wely nice location."],"modified_prediction":[3,3,3,3]},{"original_sentence":"Would stay there again no problem..","original_prediction":3,"modified_sentence":"Would stay there again no problem..","modified_prediction":4},{"original_sentence":"I thought this hotel was excellent value for money considering the amount we had paid the night before to stay in a sub-standard room in the middle of nowhere in Rivesaltes.","original_prediction":3,"modified_sentence":["I thought this hotel was excellent value for money consderin the amount we had paid the night before to stay in a sub-standard room in the middle of nowhere in Rivesaltes."],"modified_prediction":[2]},{"original_sentence":"This hotel provided all the little things which sometimes other hotels do not provide- espresso machine, sewing kits, hair conditioner.","original_prediction":4,"modified_sentence":"This hotel provided all the little things which sometimes other hotels do not provide- espresso machine, sewing kits, hair conditioner.","modified_prediction":3},{"original_sentence":"We had a room with a Juliet balcony at the front and the bed was super comfy.","original_prediction":4,"modified_sentence":"We had a room with a Juliet balcony at the front and the bed was super comfy.","modified_prediction":3},{"original_sentence":"Would stay here again if ever we return to Perpignan.. My family and I stayed here for a night on our way from Spain to Montpellier.","original_prediction":0,"modified_sentence":"Would stay here again if ever we return to Perpignan.. My family and I stayed here for a night on our way from Spain to Montpellier.","modified_prediction":3},{"original_sentence":"Could do even better on a few points e.g.","original_prediction":2,"modified_sentence":"Could do even better on a few points e.g.","modified_prediction":3},{"original_sentence":"extractor fan in the bathroom was not working.","original_prediction":0,"modified_sentence":["extractor fan in the bathroom was hot working.","extractor fan in the bathroom was knot working.","extractor fan in the bathroom was mot working.","extractor fan in the bathroom was nat working.","extractor fan in the bathroom was nol working.","extractor fan in the bathroom was on working.","extractor fan in the bathroom was ont working.","extractor fan in the bathroom was out working."],"modified_prediction":[3,2,1,3,1,3,2,1]},{"original_sentence":"The curtains were not closing completely, not a big deal except for those that find light seepage at night a challenge for complete sleep comfort.","original_prediction":2,"modified_sentence":"The curtains were not closing completely, not a big deal except for those that find light seepage at night a challenge for complete sleep comfort.","modified_prediction":1},{"original_sentence":"The router was also placed hanging from behind the tv with its Christmas-like blinking lights playing away in the night.","original_prediction":0,"modified_sentence":["The router was also placed hanging from behind the tv with its Christmas-like blinking lights playing a_with in the night.","The router was also placed hanging from behind the tv with its Christmas-like blinking lights playing alway in the night.","The router was also placed hanging from behind the tv with its Christmas-like blinking lights playing aware in the night.","The router was also placed hanging from behind the tv with its Christmas-like blinking lights playing awart in the night.","The router was also placed hanging from behind the tv with its Christmas-like blinking lights playing awerea in the night.","The router was also placed hanging from behind the tv with its Christmas-like blinking lights playing wag in the night.","The router was also placed hanging from behind the tv with its Christmas-like blinking lights playing wraway in the night."],"modified_prediction":[1,1,3,1,1,1,1]},{"original_sentence":"Had to cover it with a cloth to get some semblance of complete darkness.","original_prediction":2,"modified_sentence":["Had to cover it with a cloth to get same semblance of complete darkness.","Had to cover it with a cloth to get sane semblance of complete darkness.","Had to cover it with a cloth to get so semblance of complete darkness."],"modified_prediction":[1,1,1]},{"original_sentence":"The bathroom door also scraped on the floor and made a lot of noise.","original_prediction":0,"modified_sentence":"The bathroom door also scraped on the floor and made a lot of noise.","modified_prediction":1},{"original_sentence":"All this was in room 508, a room sleeping 4 people.","original_prediction":0,"modified_sentence":"All this was in room 508, a room sleeping 4 people.","modified_prediction":1},{"original_sentence":"On the positive, the staff were  very warm and even allowed us to leave 3 bikes in their care for an extra day when we went out to Montpellier.","original_prediction":3,"modified_sentence":["On the positive, the staff were  very warm and even allowed a to leave 3 bikes in their care for an extra day when we went out to Montpellier."],"modified_prediction":[1]},{"original_sentence":"The hotel is also  very neat and clean.","original_prediction":4,"modified_sentence":"The hotel is also  very neat and clean.","modified_prediction":3},{"original_sentence":"I would definitely recommend this hotel if the other rooms are better than 508.\n.","original_prediction":3,"modified_sentence":["I would definitely recommend this hotel it the other rooms are better than 508.\n."],"modified_prediction":[4]},{"original_sentence":"In a pretty forgettable place really, not much charm, catering probably more for the business market.. We stayed within 5 days in Germany.","original_prediction":1,"modified_sentence":["In a pretty forgettable place really, hot much charm, catering probably more for the business market.. We stayed within 5 days in Germany.","In a pretty forgettable place really, knot much charm, catering probably more for the business market.. We stayed within 5 days in Germany.","In a pretty forgettable place really, nat much charm, catering probably more for the business market.. We stayed within 5 days in Germany."],"modified_prediction":[2,2,2]},{"original_sentence":"Traveled around this beautiful country.","original_prediction":4,"modified_sentence":"Traveled around this beautiful country.","modified_prediction":1},{"original_sentence":"Stayed in different hotels.","original_prediction":4,"modified_sentence":["Stayed if different hotels.","Stayed is different hotels."],"modified_prediction":[2,2]},{"original_sentence":"Small rooms but well designed.","original_prediction":3,"modified_sentence":["Small rooms but wall designed."],"modified_prediction":[2]},{"original_sentence":"Very clean.","original_prediction":4,"modified_sentence":"Very clean.","modified_prediction":3},{"original_sentence":"Small breakfast area serves good meal to start day.","original_prediction":3,"modified_sentence":["Small breakfast area serves go meal to start day.","Small breakfast area serves goad meal to start day.","Small breakfast area serves gowed meal to start day."],"modified_prediction":[2,2,2]},{"original_sentence":"Staff speak English.","original_prediction":3,"modified_sentence":"Staff speak English.","modified_prediction":2},{"original_sentence":"Close subway stop and near restaurant area.","original_prediction":4,"modified_sentence":["Close subway stop a near restaurant area.","Close subway stop aand near restaurant area.","Close subway stop an near restaurant area.","Close subway stop ane near restaurant area.","Close subway stop anf near restaurant area.","Close subway stop are near restaurant area.","Close subway stop so near restaurant area.","Close subway stop than near restaurant area."],"modified_prediction":[3,3,3,3,3,3,2,2]},{"original_sentence":"No elevator.. We chose this Hotel primarily because it had secure car parking.","original_prediction":1,"modified_sentence":"No elevator.. We chose this Hotel primarily because it had secure car parking.","modified_prediction":2},{"original_sentence":"The staff were very friendly and efficient.","original_prediction":4,"modified_sentence":"The staff were very friendly and efficient.","modified_prediction":2},{"original_sentence":"The room was very clean and modern.","original_prediction":4,"modified_sentence":"The room was very clean and modern.","modified_prediction":2},{"original_sentence":"The location was  perfect, only a five minute  walk  into the centre where there are lots of restaurants and bars not to mention  the  beautiful old streets of Hannover.","original_prediction":3,"modified_sentence":"The location was  perfect, only a five minute  walk  into the centre where there are lots of restaurants and bars not to mention  the  beautiful old streets of Hannover.","modified_prediction":2},{"original_sentence":"This centrally located, nice hotel has everything you could want in a city hotel.","original_prediction":4,"modified_sentence":"This centrally located, nice hotel has everything you could want in a city hotel.","modified_prediction":2},{"original_sentence":"Balconies (rare in town), a beautiful rooftop terrace, friendly and welcoming staff, the most comfortable beds I've ever encountered ...","original_prediction":4,"modified_sentence":"Balconies (rare in town), a beautiful rooftop terrace, friendly and welcoming staff, the most comfortable beds I've ever encountered ...","modified_prediction":2},{"original_sentence":"I can not say enough, this is really the best place to stay!.","original_prediction":4,"modified_sentence":"I can not say enough, this is really the best place to stay!.","modified_prediction":2},{"original_sentence":"Overall the experience was good, the staff very friendly and helpful, the room clean and nice and the location very central.","original_prediction":3,"modified_sentence":"Overall the experience was good, the staff very friendly and helpful, the room clean and nice and the location very central.","modified_prediction":2},{"original_sentence":"However, I found it odd that there was no staff overnight and emergency contact was not provided.","original_prediction":2,"modified_sentence":["However, I found it ard that there was no staff overnight and emergency contact was not provided."],"modified_prediction":[1]},{"original_sentence":"Also the main entrance seemed to also be the emergency exit..","original_prediction":2,"modified_sentence":["Also the main entrance seen to also be the emergency exit..","Also the main entrance semed to also be the emergency exit.."],"modified_prediction":[4,4]},{"original_sentence":"What I nice about this hostel is that it is clean and it is located very close to Plaza la Foche.","original_prediction":3,"modified_sentence":["What I nice about this hostel is that et is clean and et is located very close to Plaza la Foche.","What I nice about this hostel is that hit is clean and hit is located very close to Plaza la Foche."],"modified_prediction":[4,4]},{"original_sentence":"What I didn't like: the standard of this hostel is low.","original_prediction":1,"modified_sentence":["What I did'ent like: the standard of this hostel is low.","What I did'nt like: the standard of this hostel is low.","What I dident like: the standard of this hostel is low.","What I dint like: the standard of this hostel is low."],"modified_prediction":[2,2,2,2]},{"original_sentence":"I was staying at a different hostel and there was no problem with the internet so it is not a Quito thing.","original_prediction":1,"modified_sentence":["I was staying at a different hostel and there was no problem with the internet so it is hot a Quito thing.","I was staying at a different hostel and there was no problem with the internet so it is knot a Quito thing.","I was staying at a different hostel and there was no problem with the internet so it is mot a Quito thing.","I was staying at a different hostel and there was no problem with the internet so it is nat a Quito thing.","I was staying at a different hostel and there was no problem with the internet so it is nol a Quito thing.","I was staying at a different hostel and there was no problem with the internet so it is non a Quito thing.","I was staying at a different hostel and there was no problem with the internet so it is on a Quito thing.","I was staying at a different hostel and there was no problem with the internet so it is ont a Quito thing.","I was staying at a different hostel and there was no problem with the internet so it is out a Quito thing."],"modified_prediction":[4,4,4,4,0,2,4,4,4]},{"original_sentence":"Most people who work there are very nice but don't speak English (except of the lady who seems to manage this place, and one of the employees).","original_prediction":3,"modified_sentence":"Most people who work there are very nice but don't speak English (except of the lady who seems to manage this place, and one of the employees).","modified_prediction":4},{"original_sentence":"They were not able to provide much information about the day excursions, something that I value the most when I travel and stay in different hostels.","original_prediction":2,"modified_sentence":["They were not able to provide much information about the day excursions, something that I vaule the most when I travel and stay in different hostels."],"modified_prediction":[1]},{"original_sentence":"Within first 30 minutes of being in a hostel I can find out about all the best things to do, and all the excursion available.","original_prediction":4,"modified_sentence":["Within first 30 minutes of being in a hostel I can find out about a the best things to do, and a the excursion available.","Within first 30 minutes of being in a hostel I can find out about at the best things to do, and at the excursion available."],"modified_prediction":[3,3]},{"original_sentence":"Not here.","original_prediction":0,"modified_sentence":"Not here.","modified_prediction":3},{"original_sentence":"I asked to order a taxi in the morning, the employee didn't schedule it, and then in the morning (5am) the number he had was not responsive and he didn't know what else to do.","original_prediction":0,"modified_sentence":"I asked to order a taxi in the morning, the employee didn't schedule it, and then in the morning (5am) the number he had was not responsive and he didn't know what else to do.","modified_prediction":3},{"original_sentence":"I ended up catching one on the street, not a big deal, but there are a lot of things happening here that in a non-issue in other hostels.","original_prediction":2,"modified_sentence":"I ended up catching one on the street, not a big deal, but there are a lot of things happening here that in a non-issue in other hostels.","modified_prediction":3},{"original_sentence":"There are so many fantastic hostels in Quito: Community Hostel (great common area, very nice standard, internet, very good food, organized trips); also other travelers were very happy with the Secret Garden and Selina.","original_prediction":4,"modified_sentence":"There are so many fantastic hostels in Quito: Community Hostel (great common area, very nice standard, internet, very good food, organized trips); also other travelers were very happy with the Secret Garden and Selina.","modified_prediction":3},{"original_sentence":"I wouldn't have chosen this place to stay if I hadn't paid for it over the internet and couldn't get a refund.","original_prediction":0,"modified_sentence":"I wouldn't have chosen this place to stay if I hadn't paid for it over the internet and couldn't get a refund.","modified_prediction":3},{"original_sentence":"This place may get high ratings for location (you can hear a lot of honking cars at night) but that's about - in my experience.","original_prediction":2,"modified_sentence":["This place may get high ratisgs for location (you can hear a lot of honkisg cars at night) but that's about - is my experience.","This place may get high ratitgs for location (you can hear a lot of honkitg cars at night) but that's about - it my experience.","This place may get high ratwithgs for location (you can hear a lot of honkwithg cars at night) but that's about - with my experience."],"modified_prediction":[3,3,3]},{"original_sentence":"Had a great stay at colour house petit, private room was lovely, breakfast was cooked each morning and every morning was different - delicious!","original_prediction":4,"modified_sentence":"Had a great stay at colour house petit, private room was lovely, breakfast was cooked each morning and every morning was different - delicious!","modified_prediction":3},{"original_sentence":"Can't recommend this hostel enough.","original_prediction":1,"modified_sentence":"Can't recommend this hostel enough.","modified_prediction":2},{"original_sentence":"Love you Jorge!","original_prediction":4,"modified_sentence":"Love you Jorge!","modified_prediction":2},{"original_sentence":"Love Sam, Lucy and Joey.","original_prediction":4,"modified_sentence":"Love Sam, Lucy and Joey.","modified_prediction":2},{"original_sentence":"Ideally located near a town square with a lot of bars, restaurants and people.","original_prediction":4,"modified_sentence":"Ideally located near a town square with a lot of bars, restaurants and people.","modified_prediction":2},{"original_sentence":"Staff is fantastic.","original_prediction":4,"modified_sentence":"Staff is fantastic.","modified_prediction":2},{"original_sentence":"Will do anything you need.","original_prediction":4,"modified_sentence":"Will do anything you need.","modified_prediction":2},{"original_sentence":"Wifi is not very strong and annoying.","original_prediction":1,"modified_sentence":"Wifi is not very strong and annoying.","modified_prediction":2},{"original_sentence":"All cash, and had an issue with accounting on check-out, so be patient..","original_prediction":4,"modified_sentence":"All cash, and had an issue with accounting on check-out, so be patient..","modified_prediction":2},{"original_sentence":"Spent a few nights here, lovely staff really helpful and cheery.","original_prediction":4,"modified_sentence":"Spent a few nights here, lovely staff really helpful and cheery.","modified_prediction":2},{"original_sentence":"Nice simple breakfast, so drinks for sale.","original_prediction":3,"modified_sentence":"Nice simple breakfast, so drinks for sale.","modified_prediction":2},{"original_sentence":"Nice comfortable bed and clean bathroom in a private room.","original_prediction":3,"modified_sentence":"Nice comfortable bed and clean bathroom in a private room.","modified_prediction":2},{"original_sentence":"Close to lots of bars and restaurants in a safe neighbourhood.","original_prediction":4,"modified_sentence":["Close to lots of bars and restaurants in a fase neighbourhood.","Close to lots of bars and restaurants in a gaff neighbourhood.","Close to lots of bars and restaurants in a lact neighbourhood.","Close to lots of bars and restaurants in a saf neighbourhood.","Close to lots of bars and restaurants in a saff neighbourhood.","Close to lots of bars and restaurants in a saft neighbourhood.","Close to lots of bars and restaurants in a sanef neighbourhood.","Close to lots of bars and restaurants in a saron neighbourhood.","Close to lots of bars and restaurants in a sat neighbourhood.","Close to lots of bars and restaurants in a sate neighbourhood.","Close to lots of bars and restaurants in a satu neighbourhood.","Close to lots of bars and restaurants in a sauf neighbourhood.","Close to lots of bars and restaurants in a saus neighbourhood.","Close to lots of bars and restaurants in a save neighbourhood.","Close to lots of bars and restaurants in a sayft neighbourhood.","Close to lots of bars and restaurants in a set neighbourhood.","Close to lots of bars and restaurants in a shaf neighbourhood.","Close to lots of bars and restaurants in a suf neighbourhood."],"modified_prediction":[3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3]},{"original_sentence":".","original_prediction":2,"modified_sentence":".","modified_prediction":3},{"original_sentence":"I stayed here for a night when I was in Quito.","original_prediction":0,"modified_sentence":["I stad here for a night when I was in Quito.","I stay here for a night when I was in Quito."],"modified_prediction":[4,4]},{"original_sentence":"The guy that works there who is from Venezuela was very nice and friendly.","original_prediction":4,"modified_sentence":["The guy that works there who is from Venezuela was an nice and friendly.","The guy that works there who is from Venezuela was fere nice and friendly.","The guy that works there who is from Venezuela was ferod nice and friendly.","The guy that works there who is from Venezuela was fery nice and friendly.","The guy that works there who is from Venezuela was lerey nice and friendly.","The guy that works there who is from Venezuela was vehr nice and friendly.","The guy that works there who is from Venezuela was ver nice and friendly.","The guy that works there who is from Venezuela was vere nice and friendly.","The guy that works there who is from Venezuela was verey nice and friendly.","The guy that works there who is from Venezuela was veri nice and friendly.","The guy that works there who is from Venezuela was verry nice and friendly.","The guy that works there who is from Venezuela was veye nice and friendly."],"modified_prediction":[3,3,3,3,3,3,3,3,3,3,3,3]},{"original_sentence":"He made sure I got everything I needed and gave me tips when he saw me leaving the hostel to go explore.","original_prediction":3,"modified_sentence":["He made sure I gat everything I needed and gave me tips when he saw me leaving the hostel to go explore.","He made sure I go everything I needed and gave me tips when he saw me leaving the hostel to go explore.","He made sure I goot everything I needed and gave me tips when he saw me leaving the hostel to go explore."],"modified_prediction":[4,4,4]},{"original_sentence":"I also got to meet a few people at the hostel and we went to a nice club literally 2 mins away from the hostel by foot.","original_prediction":4,"modified_sentence":["I also got to meet a few people at the hostel and we went to a mice club literally 2 mins away from the hostel by foot.","I also got to meet a few people at the hostel and we went to a needs club literally 2 mins away from the hostel by foot.","I also got to meet a few people at the hostel and we went to a nise club literally 2 mins away from the hostel by foot."],"modified_prediction":[0,0,0]},{"original_sentence":"The guy from the hostel gave us wristbands that got us I nto the club for free and we got a free drink!","original_prediction":4,"modified_sentence":"The guy from the hostel gave us wristbands that got us I nto the club for free and we got a free drink!","modified_prediction":0},{"original_sentence":"Overall, great experience.","original_prediction":3,"modified_sentence":"Overall, great experience.","modified_prediction":0},{"original_sentence":"Bathrooms were clean, breakfast was alright, and the bedrooms were fine..","original_prediction":3,"modified_sentence":"Bathrooms were clean, breakfast was alright, and the bedrooms were fine..","modified_prediction":0},{"original_sentence":"This hotel is across the valley from the center, but that means a great view.","original_prediction":3,"modified_sentence":"This hotel is across the valley from the center, but that means a great view.","modified_prediction":0},{"original_sentence":"There is secure parking and decent wifi.","original_prediction":3,"modified_sentence":["There is secure parking and descent wifi.","There is secure parking and desent wifi."],"modified_prediction":[4,4]},{"original_sentence":"The location is walkable to the center.","original_prediction":2,"modified_sentence":"The location is walkable to the center.","modified_prediction":3},{"original_sentence":"The hotel is on a main road, but with the windows closed the noise was minimal..","original_prediction":1,"modified_sentence":["The hotel is on a main road, but with a windows closed a noise was minimal..","The hotel is on a main road, but with an windows closed an noise was minimal..","The hotel is on a main road, but with t windows closed t noise was minimal.."],"modified_prediction":[2,2,2]},{"original_sentence":"Located in the \"Barra\" (district\/zone) about a 20 minute walk from the center of town is this delightful, clean and comfortable hotel.","original_prediction":4,"modified_sentence":"Located in the \"Barra\" (district\/zone) about a 20 minute walk from the center of town is this delightful, clean and comfortable hotel.","modified_prediction":1},{"original_sentence":"Featuring pleasant amenities (tiny indoor pool, limited parking lot, etc.)","original_prediction":3,"modified_sentence":"Featuring pleasant amenities (tiny indoor pool, limited parking lot, etc.)","modified_prediction":1},{"original_sentence":"it's best feature is the lovely restaurant with a great view of Ouro Preto during breakfast or dinner.","original_prediction":4,"modified_sentence":"it's best feature is the lovely restaurant with a great view of Ouro Preto during breakfast or dinner.","modified_prediction":1},{"original_sentence":"We entered Ouro Preto from the road from Belo Horizonte.","original_prediction":4,"modified_sentence":"We entered Ouro Preto from the road from Belo Horizonte.","modified_prediction":1},{"original_sentence":"A small chamber of commerce tourist office on the periphery of town offered us several recommendations.","original_prediction":3,"modified_sentence":"A small chamber of commerce tourist office on the periphery of town offered us several recommendations.","modified_prediction":1},{"original_sentence":"Many were surprisingly pricey.","original_prediction":2,"modified_sentence":["Many here surprisingly pricey.","Many waer surprisingly pricey.","Many wain surprisingly pricey.","Many war surprisingly pricey.","Many we surprisingly pricey.","Many wear surprisingly pricey.","Many weer surprisingly pricey.","Many wer surprisingly pricey.","Many werh surprisingly pricey.","Many wey surprisingly pricey.","Many wher surprisingly pricey.","Many whey surprisingly pricey.","Many whir surprisingly pricey.","Many why surprisingly pricey.","Many wont surprisingly pricey.","Many wore surprisingly pricey.","Many wre surprisingly pricey.","Many wree surprisingly pricey.","Many wur surprisingly pricey.","Many yer surprisingly pricey."],"modified_prediction":[4,3,3,4,4,4,3,3,3,3,3,3,4,3,1,3,3,4,3,4]},{"original_sentence":"The suggestion of Mirante Hotel seemed nice.","original_prediction":2,"modified_sentence":["The suggestion of Mirante Hotel seem nice.","The suggestion of Mirante Hotel seen nice.","The suggestion of Mirante Hotel semed nice."],"modified_prediction":[3,3,3]},{"original_sentence":"The brochure they showed us had tiny pictures showing some very basic views of the rooms.","original_prediction":2,"modified_sentence":"The brochure they showed us had tiny pictures showing some very basic views of the rooms.","modified_prediction":3},{"original_sentence":"We were delighted when we arrived.","original_prediction":4,"modified_sentence":"We were delighted when we arrived.","modified_prediction":3},{"original_sentence":"We chose two rooms (party of four).","original_prediction":2,"modified_sentence":"We chose two rooms (party of four).","modified_prediction":3},{"original_sentence":"The bedrooms had a dark cherry wood or rosewood floor (with tiny area rugs?","original_prediction":2,"modified_sentence":"The bedrooms had a dark cherry wood or rosewood floor (with tiny area rugs?","modified_prediction":3},{"original_sentence":"); it was spotlessly clean.","original_prediction":0,"modified_sentence":["); it his spotlessly clean.","); it some spotlessly clean.","); it we spotlessly clean."],"modified_prediction":[1,2,4]},{"original_sentence":"Twin beds with minimal furnishings adorned the first bedroom.","original_prediction":2,"modified_sentence":"Twin beds with minimal furnishings adorned the first bedroom.","modified_prediction":0},{"original_sentence":"This room had a spacious \"stone wall\" shower with toilet (plus \"hand-held\" bidet spray) and sink.","original_prediction":3,"modified_sentence":["This room had a spacious \"stone wall\" shower in toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower the toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower we toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wef toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wefe toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower went toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower weth toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wethe toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wh toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower what toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower when toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wheth toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower whin toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower whit toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower whith toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wien toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wif toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wihe toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wiht toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wihth toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower will toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wint toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wirth toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wis toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wit toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wite toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower withe toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wive toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wivr toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wiy toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower wthe toilet (plus \"hand-held\" bidet spray) and sink.","This room had a spacious \"stone wall\" shower yethe toilet (plus \"hand-held\" bidet spray) and sink."],"modified_prediction":[1,1,1,1,1,0,1,0,0,0,1,0,0,1,1,1,1,0,0,0,1,0,1,0,1,1,1,1,0,1,1,0]},{"original_sentence":"Our other bedroom was somewhat cramped...with queen bed, a chair and small table and faced the parking lot.","original_prediction":2,"modified_sentence":["Our other bedroom was somwhat cramped...with queen bed, a chair and small table and faced the parking lot."],"modified_prediction":[1]},{"original_sentence":"It was very bright and airy.","original_prediction":4,"modified_sentence":["It was very bright a airy.","It was very bright aand airy.","It was very bright an airy.","It was very bright ane airy.","It was very bright anf airy.","It was very bright are airy.","It was very bright than airy."],"modified_prediction":[3,2,2,2,3,3,2]},{"original_sentence":"Note that any room facing the front parking lot is noisy during the day, but was quiet after 10 PM.","original_prediction":2,"modified_sentence":["Note that any room facing the front parking lot is noisy during the day, bat was quiet after 10 PM.","Note that any room facing the front parking lot is noisy during the day, bun was quiet after 10 PM.","Note that any room facing the front parking lot is noisy during the day, buts was quiet after 10 PM.","Note that any room facing the front parking lot is noisy during the day, by was quiet after 10 PM.","Note that any room facing the front parking lot is noisy during the day, byt was quiet after 10 PM.","Note that any room facing the front parking lot is noisy during the day, dut was quiet after 10 PM.","Note that any room facing the front parking lot is noisy during the day, p was quiet after 10 PM.","Note that any room facing the front parking lot is noisy during the day, put was quiet after 10 PM."],"modified_prediction":[1,1,1,1,1,1,0,1]},{"original_sentence":"There was a smallish public lounge and a few other tourists gathered there momentarily.","original_prediction":2,"modified_sentence":["There was a smallish public lounge and a fue other tourists gathered there momentarily."],"modified_prediction":[1]},{"original_sentence":"All rooms featured air conditioning, in-room phone, and basic television with very limited channel selection.","original_prediction":2,"modified_sentence":["All rooms featured air conditioning, in-room phone, and basic television with very limitted channel selection.","All rooms featured air conditioning, in-room phone, and basic television with very limm channel selection."],"modified_prediction":[3,3]},{"original_sentence":"No stations were in English (not even CNN).","original_prediction":0,"modified_sentence":"No stations were in English (not even CNN).","modified_prediction":3},{"original_sentence":"Bathroom was clean and spacious in one room, but a bit cramped in the front-facing room.","original_prediction":2,"modified_sentence":"Bathroom was clean and spacious in one room, but a bit cramped in the front-facing room.","modified_prediction":3},{"original_sentence":"Bedroom lighting was good and acceptable, but not super bright (bright enough to read by).","original_prediction":2,"modified_sentence":["Bedroom lighting was good and acceptable, but nat super bright (bright enough to read by).","Bedroom lighting was good and acceptable, but out super bright (bright enough to read by)."],"modified_prediction":[3,3]},{"original_sentence":"A small chair and\/or small table is featured in most rooms.","original_prediction":2,"modified_sentence":["A small chair and\/or small table as featured in most rooms.","A small chair and\/or small table his featured in most rooms.","A small chair and\/or small table in featured in most rooms.","A small chair and\/or small table it featured in most rooms.","A small chair and\/or small table si featured in most rooms."],"modified_prediction":[3,3,3,3,3]},{"original_sentence":"In the morning, a very lovely breakfast spread was offered (included).","original_prediction":4,"modified_sentence":["In the morning, a very lovley breakfast spread was offered (included)."],"modified_prediction":[3]},{"original_sentence":"Scrambled eggs were offered, also.","original_prediction":0,"modified_sentence":"Scrambled eggs were offered, also.","modified_prediction":4},{"original_sentence":"Other nearby tables also offer a lovely view.","original_prediction":3,"modified_sentence":"Other nearby tables also offer a lovely view.","modified_prediction":4},{"original_sentence":"To get to town, we walked down a slight hill, over a small river\/bridge, past the Ouro Preto Tennis Club and back up a slight hill into the center of town.","original_prediction":3,"modified_sentence":"To get to town, we walked down a slight hill, over a small river\/bridge, past the Ouro Preto Tennis Club and back up a slight hill into the center of town.","modified_prediction":4},{"original_sentence":"The hotel did offer us cab service into town (about $3 each way) but we chose to walk.","original_prediction":2,"modified_sentence":["The hotel did offer us cab service into town (about $3 each way) but weed chose to walk.","The hotel did offer us cab service into town (about $3 each way) but wen chose to walk.","The hotel did offer us cab service into town (about $3 each way) but wey chose to walk.","The hotel did offer us cab service into town (about $3 each way) but wot chose to walk."],"modified_prediction":[1,1,1,1]},{"original_sentence":"After midnight, the front side room was totally silent.","original_prediction":0,"modified_sentence":"After midnight, the front side room was totally silent.","modified_prediction":1},{"original_sentence":"However, between 8 AM and 8 PM, we found the front bedroom occasionally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","original_prediction":2,"modified_sentence":["However, between 8 AM and 8 PM, we found the front bedroom Occasionlly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom acanelly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom acationaly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom acationly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom accagionaly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom accasionally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom accassionally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom accationally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom accationaly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom acconazilyg disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom acconlly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom acconnly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom accossinally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom acctionally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom actionally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom ocashanally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom ocasionally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom ocasionaly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom ocasionly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom ocassionally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom ocassionaly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom ocastonally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occaionally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occaisionally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occaisionaly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occaisionly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occaisonally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occanally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occanolly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occanonaly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occansaton disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occansily disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occasalty disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occasely disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occasiole disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occasionaly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occasionely disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occasionially disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occasionily disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occasionlly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occasionly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occasonaly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occasonially disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occassionally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occassionaly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occassionly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occationally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occationaly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occoasionally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occonaly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occonsially disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occonsionally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occosionally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occosonoly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occoumely disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom occtionally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom ockationaly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom okaysionaly disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","However, between 8 AM and 8 PM, we found the front bedroom okenously disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street."],"modified_prediction":[1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1]},{"original_sentence":"The beds were comfortably firm, pillows smallish but decently plump.","original_prediction":2,"modified_sentence":"The beds were comfortably firm, pillows smallish but decently plump.","modified_prediction":1},{"original_sentence":"We award the rooms 2+ to 3 stars for \"luxury\/comfort\" and 3+ stars for cleanliness.","original_prediction":2,"modified_sentence":"We award the rooms 2+ to 3 stars for \"luxury\/comfort\" and 3+ stars for cleanliness.","modified_prediction":1},{"original_sentence":"The rooms were very value-priced.","original_prediction":4,"modified_sentence":"The rooms were very value-priced.","modified_prediction":1},{"original_sentence":"The rental car company only offered us a car in Belo Horizonte (two hours away), an unacceptable offering for we only needed a  truck to pull our car out of the large hole.","original_prediction":0,"modified_sentence":["The rental car company only offered us a car in Belo Horizonte (two hours away), an unaceptable offering for we only needed a  truck to pull our car out of the large hole."],"modified_prediction":[1]},{"original_sentence":"The manager took care of everything - he found us a tow truck and arranged for our safe return to the hotel!","original_prediction":4,"modified_sentence":"The manager took care of everything - he found us a tow truck and arranged for our safe return to the hotel!","modified_prediction":1},{"original_sentence":"Dinner in the restaurant proved very reasonable and very delicious.","original_prediction":4,"modified_sentence":"Dinner in the restaurant proved very reasonable and very delicious.","modified_prediction":1},{"original_sentence":"Of course, there are splendid dining establishments in town, which we enjoyed, but one nice dinner at our hotel proved terrific!","original_prediction":3,"modified_sentence":["Of course, there are splendid dining establishments in town, which we enjoyed, bat one nice dinner at our hotel proved terrific!","Of course, there are splendid dining establishments in town, which we enjoyed, bun one nice dinner at our hotel proved terrific!","Of course, there are splendid dining establishments in town, which we enjoyed, buts one nice dinner at our hotel proved terrific!","Of course, there are splendid dining establishments in town, which we enjoyed, by one nice dinner at our hotel proved terrific!","Of course, there are splendid dining establishments in town, which we enjoyed, byt one nice dinner at our hotel proved terrific!","Of course, there are splendid dining establishments in town, which we enjoyed, dut one nice dinner at our hotel proved terrific!","Of course, there are splendid dining establishments in town, which we enjoyed, p one nice dinner at our hotel proved terrific!","Of course, there are splendid dining establishments in town, which we enjoyed, put one nice dinner at our hotel proved terrific!"],"modified_prediction":[4,4,4,4,4,4,4,4]},{"original_sentence":"However, dinner was offered during limited hours in the early evening only (we think the restaurant closes by 9:00 PM).","original_prediction":2,"modified_sentence":"However, dinner was offered during limited hours in the early evening only (we think the restaurant closes by 9:00 PM).","modified_prediction":4},{"original_sentence":"The hotel features a super-tiny pool in its basement.","original_prediction":3,"modified_sentence":["The hotel features a super-tiny pole in its basement."],"modified_prediction":[2]},{"original_sentence":"It was really nothing more than a place for little kids to splash around in.","original_prediction":1,"modified_sentence":["It was really noting more than a place for little kids to splash around in."],"modified_prediction":[3]},{"original_sentence":"No more than 20 feet long, perhaps, don't think it's a place you can do 'laps'.","original_prediction":1,"modified_sentence":"No more than 20 feet long, perhaps, don't think it's a place you can do 'laps'.","modified_prediction":3},{"original_sentence":"We recommend this hotel for anyone on a budget or who wouldn't mind a hotel just a little off the beaten path.","original_prediction":3,"modified_sentence":["We recommend this hotel for anyone on a budget or who wouldn't mind a hotel just a lette off the beaten path.","We recommend this hotel for anyone on a budget or who wouldn't mind a hotel just a lettel off the beaten path.","We recommend this hotel for anyone on a budget or who wouldn't mind a hotel just a lettle off the beaten path.","We recommend this hotel for anyone on a budget or who wouldn't mind a hotel just a lital off the beaten path.","We recommend this hotel for anyone on a budget or who wouldn't mind a hotel just a litl off the beaten path.","We recommend this hotel for anyone on a budget or who wouldn't mind a hotel just a litle off the beaten path.","We recommend this hotel for anyone on a budget or who wouldn't mind a hotel just a littal off the beaten path.","We recommend this hotel for anyone on a budget or who wouldn't mind a hotel just a litte off the beaten path.","We recommend this hotel for anyone on a budget or who wouldn't mind a hotel just a littel off the beaten path.","We recommend this hotel for anyone on a budget or who wouldn't mind a hotel just a littele off the beaten path.","We recommend this hotel for anyone on a budget or who wouldn't mind a hotel just a littl off the beaten path.","We recommend this hotel for anyone on a budget or who wouldn't mind a hotel just a tittel off the beaten path."],"modified_prediction":[4,4,4,4,4,4,4,4,4,4,4,4]},{"original_sentence":"Rooms facing the sides and back are quiet.","original_prediction":3,"modified_sentence":"Rooms facing the sides and back are quiet.","modified_prediction":4},{"original_sentence":"If you need to stay right smack in the middle of it all, this is NOT the place to stay; but if you're on a budget and demand cleanliness and good comfort...this one's a find!","original_prediction":2,"modified_sentence":["If you need to stay right smack in the middle of it all, this is NOT the place to stay; bat if you're on a budget and demand cleanliness and good comfort...this one's a find!","If you need to stay right smack in the middle of it all, this is NOT the place to stay; bun if you're on a budget and demand cleanliness and good comfort...this one's a find!","If you need to stay right smack in the middle of it all, this is NOT the place to stay; buts if you're on a budget and demand cleanliness and good comfort...this one's a find!","If you need to stay right smack in the middle of it all, this is NOT the place to stay; by if you're on a budget and demand cleanliness and good comfort...this one's a find!","If you need to stay right smack in the middle of it all, this is NOT the place to stay; byt if you're on a budget and demand cleanliness and good comfort...this one's a find!","If you need to stay right smack in the middle of it all, this is NOT the place to stay; dut if you're on a budget and demand cleanliness and good comfort...this one's a find!","If you need to stay right smack in the middle of it all, this is NOT the place to stay; p if you're on a budget and demand cleanliness and good comfort...this one's a find!","If you need to stay right smack in the middle of it all, this is NOT the place to stay; put if you're on a budget and demand cleanliness and good comfort...this one's a find!"],"modified_prediction":[0,0,0,1,1,1,0,0]},{"original_sentence":"We rated \"Incredible staff\" because the assistant manager was a Godsend when our car broke down.","original_prediction":4,"modified_sentence":["We rated \"Incredible staff\" because the assistant manager was a Godsend wane our car broke down.","We rated \"Incredible staff\" because the assistant manager was a Godsend we our car broke down.","We rated \"Incredible staff\" because the assistant manager was a Godsend wen our car broke down.","We rated \"Incredible staff\" because the assistant manager was a Godsend wene our car broke down.","We rated \"Incredible staff\" because the assistant manager was a Godsend went our car broke down.","We rated \"Incredible staff\" because the assistant manager was a Godsend wern our car broke down.","We rated \"Incredible staff\" because the assistant manager was a Godsend weten our car broke down.","We rated \"Incredible staff\" because the assistant manager was a Godsend wheh our car broke down.","We rated \"Incredible staff\" because the assistant manager was a Godsend whern our car broke down.","We rated \"Incredible staff\" because the assistant manager was a Godsend whet our car broke down.","We rated \"Incredible staff\" because the assistant manager was a Godsend whn our car broke down.","We rated \"Incredible staff\" because the assistant manager was a Godsend will our car broke down.","We rated \"Incredible staff\" because the assistant manager was a Godsend wine our car broke down."],"modified_prediction":[0,0,0,0,0,0,0,0,0,0,0,0,0]},{"original_sentence":"We rated \"no frills\" because there is no spa, no luxuries, no room service (that we were aware of) and \"comfortable\" because it was comfortable.","original_prediction":1,"modified_sentence":"We rated \"no frills\" because there is no spa, no luxuries, no room service (that we were aware of) and \"comfortable\" because it was comfortable.","modified_prediction":0},{"original_sentence":"We did not inquire as to high speed internet, however, we think it might be offered now.","original_prediction":2,"modified_sentence":["We did not inquire as to high speed internet, however, we think it mit be offered now.","We did not inquire as to high speed internet, however, we think it my be offered now."],"modified_prediction":[3,3]},{"original_sentence":"All in all, a gem!","original_prediction":4,"modified_sentence":"All in all, a gem!","modified_prediction":3}]