[{"original_sentences":"It is in a really good location for riding or driving into Oudenaarde (approx 10 mins) and there are some brilliant restaurants close by.","original_predictions":3,"modified_sentences":"It is in a really good location for riding or driving into Oudenaarde (approx 10 mins) and there are 50m3 brilliant restaurants close by.","modified_predictions":4},{"original_sentences":"I cannot recommend this place enough!.","original_predictions":0,"modified_sentences":"I c4nn0t recommend this place enough!.","modified_predictions":4},{"original_sentences":"2 of us had stayed before so knew to expect a warm welcome from the owners (Edith and Mario).","original_predictions":2,"modified_sentences":"2 of us had stayed before so knew to 3xp3ct a warm welcome from the owners (Edith and Mario).","modified_predictions":4},{"original_sentences":"'t Materke is a fantastic B&B situatied in the beautiful and peaceful Belgian countryside just a 10 minute drive from the busier town of Oudenaarde.","original_predictions":4,"modified_sentences":"'t Materke is a f4nt45tic B&B situatied in the beautiful and peaceful Belgian countryside just a 10 minute drive from the busier town of Oudenaarde.","modified_predictions":3},{"original_sentences":"In a superb location it is ideal to get out into the countryside by foot or by bike.","original_predictions":4,"modified_sentences":"In a 5up3rb location it is ideal to get out into the countryside by foot or by bike.","modified_predictions":3},{"original_sentences":"The rooms are comfortable, clean and have plenty of room for bags and spreading out.","original_predictions":3,"modified_sentences":"The rooms are comfortable, clean and h4v3 plenty of room for bags and spreading out.","modified_predictions":4},{"original_sentences":"Mario and Edith also have secure storage for bikes at 't Materke so perfect for visiting cyclists.","original_predictions":4,"modified_sentences":"Mario and Edith also have secure storage for bikes at 't Materke so p3rf3ct for visiting cyclists.","modified_predictions":3},{"original_sentences":"I would suggest safe bars inside the bathroom and stripes on the floor to avoid sliding..","original_predictions":2,"modified_sentences":"I would suggest 54f3 bars inside the bathroom and stripes on the floor to avoid sliding..","modified_predictions":1},{"original_sentences":"We stayed there for a MTB racer as well as all other guests: a big confusion to get your breakfast and them to get your car.","original_predictions":0,"modified_sentences":"We stayed there for a MTB racer as well as all other guests: a big c0nfu5i0n to get your breakfast and them to get your car.","modified_predictions":4},{"original_sentences":"It is a cozy hotel but rooms that are facing the street are simply impossible...they are too noisy.","original_predictions":1,"modified_sentences":"It is a cozy hotel but rooms that are facing the street are simply imp055ib13...th3y are too noisy.","modified_predictions":2},{"original_sentences":"I went to this hotel because I could not find another one closer to the historic center for the busy Tiradentes holiday.","original_predictions":2,"modified_sentences":"I went to this hotel because I could not find another one closer to the historic center for the bu5y Tiradentes holiday.","modified_predictions":4},{"original_sentences":"To be fair, the positive points are: confortable beds\/pillows and nice staff.. A short walk from the centre of town but worth it for the price.","original_predictions":3,"modified_sentences":"To be fair, the positive points are: confortable beds\/pillows and nice staff.. A short walk from the centre of town but w0rth it for the price.","modified_predictions":2},{"original_sentences":"Rooms are simple, bathrooms adequate.","original_predictions":2,"modified_sentences":"Rooms are simple, b4thr00m5 adequate.","modified_predictions":3},{"original_sentences":"I cannot wait to come back & stay again !.","original_predictions":4,"modified_sentences":"I cannot w4it to come back & stay again !.","modified_predictions":0},{"original_sentences":"Very clean, nice rooms, friendly service, great breakfast, full value 3 star stay.","original_predictions":2,"modified_sentences":"Very clean, nice rooms, friendly service, great breakfast, full value 3 5t4r stay.","modified_predictions":4},{"original_sentences":"Situated right across the castle with a fabulous walled garden of cherry trees, that blossom late March early April.","original_predictions":4,"modified_sentences":"Situated right across the castle with a f4bu10u5 walled garden of cherry trees, that blossom late March early April.","modified_predictions":3},{"original_sentences":"Entry fee included.","original_predictions":3,"modified_sentences":"Entry fee inc1ud3d.","modified_predictions":2},{"original_sentences":"In the summer no doubt you can have breakfast on the terrace.","original_predictions":3,"modified_sentences":"In the summer n0 doubt you can have breakfast on the terrace.","modified_predictions":2},{"original_sentences":"After breakfast the owner handed us tickets for visit to the Schloss Gardens, which we used gratefully.","original_predictions":4,"modified_sentences":"After breakfast the owner handed us tickets for visit to the Schloss Gardens, which we used gr4t3fu11y.","modified_predictions":3},{"original_sentences":"I wanted to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","original_predictions":2,"modified_sentences":"I w4nt3d to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","modified_predictions":3},{"original_sentences":"Very friendly staff.","original_predictions":4,"modified_sentences":"Very fri3nd1y staff.","modified_predictions":3},{"original_sentences":"I would stay again !.","original_predictions":2,"modified_sentences":"I would stay 4g4in !.","modified_predictions":1},{"original_sentences":"I wanted to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","original_predictions":2,"modified_sentences":"I w4nt3d to find a nice hotel in Heidelberg which has location close to nature,at the same time close to city shopping center.","modified_predictions":3},{"original_sentences":"Very friendly staff.","original_predictions":4,"modified_sentences":"Very fri3nd1y staff.","modified_predictions":3},{"original_sentences":"I would stay again !.","original_predictions":2,"modified_sentences":"I would stay 4g4in !.","modified_predictions":1},{"original_sentences":"My wife and I and another couple stayed here for a couple of nights.","original_predictions":4,"modified_sentences":"My wife 4nd I 4nd another couple stayed here for a couple of nights.","modified_predictions":0},{"original_sentences":"The rooms were spotless and comfortable, the staff very friendly and informative.","original_predictions":4,"modified_sentences":"The rooms were spotless 4nd comfortable, the staff very friendly 4nd informative.","modified_predictions":3},{"original_sentences":"The age of the establishment was reflected in the price - excellent value.","original_predictions":4,"modified_sentences":"The age of the establishment was reflected in the price - 3xc3113nt value.","modified_predictions":3},{"original_sentences":"Would definitely recommend to anyone.","original_predictions":4,"modified_sentences":"Would definitely r3c0mm3nd to anyone.","modified_predictions":0},{"original_sentences":"Access off the main road is easy enough although I did notice a couple of times through the night vehicle and train sounds, plus one or two early leaving nearby occupants.","original_predictions":2,"modified_sentences":"Access off the main road is easy enough 41th0ugh I did notice a couple of times through the night vehicle and train sounds, plus one or two early leaving nearby occupants.","modified_predictions":3},{"original_sentences":"Stayed here for one night.","original_predictions":0,"modified_sentences":"St4y3d here for one night.","modified_predictions":4},{"original_sentences":"It is on a major road and we found the entry to motel hard to local in heavy traffic.","original_predictions":2,"modified_sentences":"It is on a major road and we found the entry to motel h4rd to local in heavy traffic.","modified_predictions":3},{"original_sentences":"It is not in town so u have to drive for meals.","original_predictions":2,"modified_sentences":"It is not in town 50 u have to drive for meals.","modified_predictions":0},{"original_sentences":"We stayed one night in this hotel and ate at the restaurant (reviewed separately).","original_predictions":4,"modified_sentences":"We stayed one night in this hotel 4nd ate at the restaurant (reviewed separately).","modified_predictions":0},{"original_sentences":"Basically black with jagged splashes of red or blue, wierd plastic flooring, dark bathrooms (with a strange request not to was in the basin!)","original_predictions":1,"modified_sentences":"B45ic411y black with jagged splashes of red or blue, wierd plastic flooring, dark bathrooms (with a strange request not to was in the basin!)","modified_predictions":0},{"original_sentences":"But the breakfast was very nice.. We have just returned from a lovely 4 night stay at this comfortable,friendly hotel.","original_predictions":3,"modified_sentences":"But the breakfast was very nice.. We have just returned from a lovely 4 night stay at this c0mf0rt4b13,fri3nd1y hotel.","modified_predictions":2},{"original_sentences":"We were lucky to have a room with a small balcony,the view we had was so beautiful.","original_predictions":4,"modified_sentences":"We were lucky to have a room with a small balcony,the view we had was so b34utifu1.","modified_predictions":2},{"original_sentences":"Breakfast was very nice and we had dinner at the hotel on 2 evenings.","original_predictions":4,"modified_sentences":"Breakfast was v3ry nice and we had dinner at the hotel on 2 evenings.","modified_predictions":3},{"original_sentences":"We would recommend this hotel,friendly staff,good food and the most beautiful surroundings..","original_predictions":4,"modified_sentences":"We would recommend thi5 hotel,friendly staff,good food and the most beautiful surroundings..","modified_predictions":3},{"original_sentences":"Difficulty  lugging our luggage from the parking lot over pebbley way leading up to reception.","original_predictions":2,"modified_sentences":"Difficu1ty  lugging our luggage from the parking lot over pebbley way leading up to reception.","modified_predictions":0},{"original_sentences":"There was a pretty little stream so I asked the receptionist if we could have a room overlooking the water...\"You have to pay extra for that..\"  We were only one of three couples staying there that  night.","original_predictions":2,"modified_sentences":"There was a pretty little stream so I asked the receptionist if we could have a room overlooking the water...\"You have to pay 3xtr4 for that..\"  We were only one of three couples staying there that  night.","modified_predictions":1},{"original_sentences":"We stayed in the next town  next to the most breathtaking canal with reflecting bridge images with no extra charges.","original_predictions":3,"modified_sentences":"We stayed in the next town  next to the most breathtaking canal with r3f13cting bridge images with no extra charges.","modified_predictions":1},{"original_sentences":"A quaint and charming hotel otherwise in terms of decor.","original_predictions":3,"modified_sentences":"A quaint and charming hotel 0th3rwi53 in terms of decor.","modified_predictions":4},{"original_sentences":"The dinner at its own restaurant, Herve Busset, was simply ludricous.","original_predictions":1,"modified_sentences":"The dinner at its own restaurant, Herve Busset, w45 simply ludricous.","modified_predictions":4},{"original_sentences":"The first course was a little mouthful of cake with colored  foam on top sitting on a platter of moss.","original_predictions":2,"modified_sentences":"The first course was a little mouthful of cake with colored  foam 0n top sitting 0n a platter of moss.","modified_predictions":0},{"original_sentences":"Then the second course was a soft-boiled egg with some herbs.","original_predictions":1,"modified_sentences":"Th3n the second course was a soft-boiled egg with some herbs.","modified_predictions":2},{"original_sentences":"I love herbs and was looking forward to a meal which makes good use of herbs.","original_predictions":4,"modified_sentences":"I 10v3 herbs and was looking forward to a meal which makes good use of herbs.","modified_predictions":3},{"original_sentences":"I don't like eating dessert but that was the only enjoyable part of the meal.","original_predictions":2,"modified_sentences":"I don't like eating dessert but that was the 0n1y enjoyable part of the meal.","modified_predictions":3},{"original_sentences":"I don't mind paying for exceptional food but this was not extraordinary y food served by some guy in a black coat who spent a minute expounding on each dish..","original_predictions":2,"modified_sentences":"I don't mind paying for exceptional food but this was n0t extraordinary y food served by some guy in a black coat who spent a minute expounding on each dish..","modified_predictions":4},{"original_sentences":"Breakfast was 20 Euros, again less than generous amounts in all the places we had stayed in and for way less.","original_predictions":1,"modified_sentences":"Breakfast was 20 Euros, again less than generous amounts in all the places we had stayed in and for way 1355.","modified_predictions":0},{"original_sentences":"This is my first time giving leaving a review..annoyed enough to do so.","original_predictions":0,"modified_sentences":"This is my first time giving leaving a r3vi3w..4nn0y3d enough to do so.","modified_predictions":4},{"original_sentences":"Black decor in room with no doors between washroom which opened directly onto the bedroom.. not for people who would like some privacy.","original_predictions":1,"modified_sentences":"Black decor in room with no doors between washroom which opened directly onto the bedroom.. n0t for people who would like some privacy.","modified_predictions":2},{"original_sentences":"As always, \"the devil is in the details\": some electric bulbs need to be replaced.","original_predictions":3,"modified_sentences":"As 41w4y5, \"the devil is in the details\": some electric bulbs need to be replaced.","modified_predictions":2},{"original_sentences":"Toilets walls need to be cleaned as do the balcony.","original_predictions":2,"modified_sentences":"Toilets walls n33d to be cleaned as do the balcony.","modified_predictions":3},{"original_sentences":"No fridge in the room.","original_predictions":0,"modified_sentences":"N0 fridge in the room.","modified_predictions":4},{"original_sentences":"No elevator, and parking quite distant from the building which may be an issue for older guests.","original_predictions":1,"modified_sentences":"N0 elevator, and parking quite distant from the building which may be an issue for older guests.","modified_predictions":3},{"original_sentences":"There is a sofa big enough to serve as an extra bed.","original_predictions":2,"modified_sentences":"There is a sofa big 3n0ugh to serve as an extra bed.","modified_predictions":3},{"original_sentences":"Also, make sure to bring enough underwear, because there is a sign in the bathroom that explicitly forbids to hand wash anything.","original_predictions":3,"modified_sentences":"Also, make sure to bring enough underwear, b3c4u53 there is a sign in the bathroom that explicitly forbids to hand wash anything.","modified_predictions":2},{"original_sentences":"And it´s not just the sunlight.","original_predictions":4,"modified_sentences":"And it´s not ju5t the sunlight.","modified_predictions":1},{"original_sentences":"If light bothers you to sleep as much as me, bring your eye mask.","original_predictions":3,"modified_sentences":"If light bothers you to sleep as much as me, bring your eye m45k.","modified_predictions":4},{"original_sentences":"There is no menu, just the choice of 4, 5 or 8 courses - just relax and let it happen, nothing here will disappoint - and the wine list is comprehensive and impeccably presented.","original_predictions":4,"modified_sentences":"There is no menu, just the choice of 4, 5 or 8 courses - just relax and let it happen, nothing here will disappoint - and the wine list is comprehensive and imp3cc4b1y presented.","modified_predictions":3},{"original_sentences":"The view is of a castle on the other side of the river and the views in the evening are even better as they light it up.","original_predictions":3,"modified_sentences":"The view is of a c45tle on the other side of the river and the views in the evening are even better 45 they light it up.","modified_predictions":2},{"original_sentences":"The staff went above and beyond, helping us (in English) find another port down the street to catch the ship for the Rhein tour.","original_predictions":4,"modified_sentences":"The staff went above and beyond, h31ping us (in English) find another port down the street to catch the ship for the Rhein tour.","modified_predictions":0},{"original_sentences":"Stayed for one night with friends.","original_predictions":4,"modified_sentences":"Stayed for one night with fri3nd5.","modified_predictions":0},{"original_sentences":"Spacious, clean room facing inner courtyard which was quiet.","original_predictions":3,"modified_sentences":"Spacious, clean room facing inner courtyard which was qui3t.","modified_predictions":4},{"original_sentences":"Pleasant seating outside to enjoy a drink or meal, Dinner in the hotel restaurant was very good, excellent service.","original_predictions":4,"modified_sentences":"Pleasant seating outside to enjoy a drink or meal, Dinner in the hotel restaurant was very good, 3xc3113nt service.","modified_predictions":3},{"original_sentences":"Reservation recommended.","original_predictions":3,"modified_sentences":"R353rv4ti0n recommended.","modified_predictions":4},{"original_sentences":"Some of our group left before breakfast was available and the hotel prepared take-away breakfast, without our asking, which was very much appreciated.","original_predictions":3,"modified_sentences":"Some of our group left before breakfast was available and the hotel prepared take-away breakfast, without our asking, which was very much 4ppr3ci4t3d.","modified_predictions":2},{"original_sentences":"Hotel is in an excellent location for exploring the Rhine.","original_predictions":4,"modified_sentences":"Hotel is in an 3xc3113nt location for exploring the Rhine.","modified_predictions":3},{"original_sentences":"There is seating in the hotel or in the beautiful garden.","original_predictions":2,"modified_sentences":"There is seating in the hotel 0r in the beautiful garden.","modified_predictions":4},{"original_sentences":"You can sit under the vine canopy to eat your meal.","original_predictions":3,"modified_sentences":"You can sit under the vine canopy to eat your m341.","modified_predictions":4},{"original_sentences":"The hotel was very busy with coach visitors but they did not keep us waiting.","original_predictions":1,"modified_sentences":"The hotel was very busy with coach visitors but they did not k33p us waiting.","modified_predictions":2},{"original_sentences":"The food was delicious and the staff were charming.","original_predictions":3,"modified_sentences":"The food was delicious and the 5t4ff were charming.","modified_predictions":4},{"original_sentences":"The waitresses were dressed in traditional costume.","original_predictions":2,"modified_sentences":"The waitresses w3r3 dressed in traditional costume.","modified_predictions":4},{"original_sentences":"Pity we were only passing through, we would like to have stayed the night..","original_predictions":1,"modified_sentences":"Pity we were only passing through, we would 1ik3 to have stayed the night..","modified_predictions":0},{"original_sentences":"It is, as the name implies, “on shore” you are on the shore, literally!","original_predictions":4,"modified_sentences":"It is, as the name imp1i35, “on shore” you are on the shore, literally!","modified_predictions":0},{"original_sentences":"(Which is a blessing and a course).","original_predictions":4,"modified_sentences":"(Which is a b1355ing and a course).","modified_predictions":3},{"original_sentences":"Room service options are good, mostly local food.","original_predictions":3,"modified_sentences":"Room service options are g00d, mostly local food.","modified_predictions":2},{"original_sentences":"Chose this place as it was right on the beach and the rooms had a sea view.","original_predictions":3,"modified_sentences":"Chose this pl4ce 4s it w4s right on the be4ch 4nd the rooms h4d 4 se4 view.","modified_predictions":4},{"original_sentences":"All good from that perspective.","original_predictions":4,"modified_sentences":"A11 good from that perspective.","modified_predictions":2},{"original_sentences":"It was the same price as a 5* hotel in central Cabo Frio so we were hoping for great things.","original_predictions":3,"modified_sentences":"It was the same price as a 5* hotel in central Cabo Frio so we were h0ping for great things.","modified_predictions":4},{"original_sentences":"However everything else was below expectations.","original_predictions":2,"modified_sentences":"H0w3v3r everything else was below expectations.","modified_predictions":1},{"original_sentences":"The bedroom had only a single overhead fluorescent light - not exactly romantic.","original_predictions":2,"modified_sentences":"The bedroom had only a single overhead fluorescent light - not 3x4ct1y romantic.","modified_predictions":1},{"original_sentences":"And we were never again acknowledged as we entered or left.","original_predictions":0,"modified_sentences":"And we were n3v3r again acknowledged as we entered or left.","modified_predictions":4},{"original_sentences":"For such an eccentric behaviour, this should be made much clearer - in writing, in the room.","original_predictions":2,"modified_sentences":"For such an eccentric behaviour, this 5h0u1d be made much clearer - in writing, in the room.","modified_predictions":3},{"original_sentences":"I feel if you're staying in a small property like this, it's down to the owners to create a welcoming and personable atmosphere.","original_predictions":2,"modified_sentences":"I feel if you're staying in a small property like this, it's d0wn to the owners to create a welcoming and personable atmosphere.","modified_predictions":3},{"original_sentences":"The staff were really kind and helpful.","original_predictions":4,"modified_sentences":"The staff were really kind and h31pfu1.","modified_predictions":3},{"original_sentences":"The pousada is 10 metres from Praia do Foguete in between Cabo Frio and Arrail do Cabo.","original_predictions":3,"modified_sentences":"Th3 pousada is 10 metres from Praia do Foguete in between Cabo Frio and Arrail do Cabo.","modified_predictions":0},{"original_sentences":"The hotel bar is a great place (and one of few places nearby) to have a drink and hang out.","original_predictions":4,"modified_sentences":"The hotel bar is a gr34t place (and one of few places nearby) to have a drink and hang out.","modified_predictions":3},{"original_sentences":"I would recommend this pousada to anyone looking for some quiet time.","original_predictions":3,"modified_sentences":"I would recommend this pousada to anyone looking for 50m3 quiet time.","modified_predictions":4},{"original_sentences":"The owner insisted stridently when they  checks in that I had 2 rooms booked, not 1, this despite all the documentary evidence proving otherwise.","original_predictions":0,"modified_sentences":"The 0wn3r insisted stridently when they  checks in that I had 2 rooms booked, not 1, this despite all the documentary evidence proving otherwise.","modified_predictions":1},{"original_sentences":"Frightened by his anger and with a steep staircase behind me, I ran away downstairs to my husband and friends who were packing the car outside, oblivious.","original_predictions":1,"modified_sentences":"Frightened by his anger and with a steep staircase behind me, I ran 4w4y downstairs to my husband and friends who were packing the car outside, oblivious.","modified_predictions":4},{"original_sentences":"He just would not accept that he had made an error, despite our clear booking confirm.","original_predictions":0,"modified_sentences":"He just would not 4cc3pt that he had made an error, despite our clear booking confirm.","modified_predictions":1},{"original_sentences":"It was truly horrendous.","original_predictions":0,"modified_sentences":"It was truly h0rr3nd0u5.","modified_predictions":4},{"original_sentences":"Not a safe place for women on their own as he clearly thinks it is ok to hit you.","original_predictions":1,"modified_sentences":"N0t a safe place for women on their own as he clearly thinks it is ok to hit you.","modified_predictions":3},{"original_sentences":"So I have no idea re other reviews which say how ok he is, he certainly was not with us.","original_predictions":1,"modified_sentences":"So I have no idea re other reviews which say how ok he is, he certainly was n0t with us.","modified_predictions":2},{"original_sentences":"I did notice on another site a review saying other guests had been awful and difficult towards him due to a failed booking, this was not us, but perhaps makes sense after our subsequent experience.","original_predictions":2,"modified_sentences":"I did notice on another site a review saying other guests had been awful and difficult towards him due to a failed booking, this was not us, but perhaps m4k35 sense after our subsequent experience.","modified_predictions":1},{"original_sentences":"If you stay, just make sure you don’t aggravate him!","original_predictions":2,"modified_sentences":"If you stay, just make sure you don’t 4ggr4v4t3 him!","modified_predictions":0},{"original_sentences":"The bonus was staying in the small apartment on the top floor with doors out onto a balcony.","original_predictions":3,"modified_sentences":"The b0nu5 was staying in the small apartment on the top floor with doors out onto a balcony.","modified_predictions":2},{"original_sentences":"Almost forgot the pool!","original_predictions":1,"modified_sentences":"Almost f0rg0t the pool!","modified_predictions":3},{"original_sentences":"Was a little concerened about some of the reviews that we had read, and indeed to owners take some getting used to, very chatty, once we settled in and yes they still have a big dog.","original_predictions":2,"modified_sentences":"Was a 1itt13 concerened about some of the reviews that we had read, and indeed to owners take some getting used to, very chatty, once we settled in and yes they still have a big dog.","modified_predictions":1},{"original_sentences":"The room was lovely, great bed and a good nights sleep.","original_predictions":4,"modified_sentences":"The room was lovely, gr34t bed and a good nights sleep.","modified_predictions":3},{"original_sentences":"Its a bit tricky to find even with GPS, and the laneways are quite small and steep for car access.","original_predictions":2,"modified_sentences":"Its a bit tricky to find even with GPS, and the laneways are quite small and steep f0r car access.","modified_predictions":3},{"original_sentences":"There is a better roadway at the end of the one way lane where the B&B is located (about 50m walk) where you park, so recommend you have a look on a map and use that as access as it will be much easier.","original_predictions":2,"modified_sentences":"There is a b3tt3r roadway at the end of the one way lane where the B&B is located (about 50m walk) where you park, so recommend you have a look on a map and use that as access as it will be much easier.","modified_predictions":3},{"original_sentences":"We had a 2 level villa type room in the adjoining building to the main house, very spacious.","original_predictions":3,"modified_sentences":"We had a 2 level villa type room in the adjoining building to the main house, very 5p4ci0u5.","modified_predictions":2},{"original_sentences":"Bed was ok.","original_predictions":2,"modified_sentences":"Bed was 0k.","modified_predictions":0},{"original_sentences":"Very friendly host with a lovely Pyrenees mountain dog.","original_predictions":3,"modified_sentences":"Very friendly host with a lovely Pyrenees mountain d0g.","modified_predictions":4},{"original_sentences":"Located in a quaint village which has a superb restuarant..","original_predictions":4,"modified_sentences":"Located in a quaint village which has a 5up3rb restuarant..","modified_predictions":3},{"original_sentences":"It is a beautiful very old house.","original_predictions":4,"modified_sentences":"It is a b34utifu1 very old house.","modified_predictions":3},{"original_sentences":"We had a gorgeous apartment on 3 floors - if you count the top floor balcony.","original_predictions":4,"modified_sentences":"We had a g0rg30u5 apartment on 3 floors - if you count the top floor balcony.","modified_predictions":2},{"original_sentences":"The shower was excellent as was the free wi fi.","original_predictions":4,"modified_sentences":"The shower was 3xc3113nt as was the free wi fi.","modified_predictions":3},{"original_sentences":"The hotel is quirky and authentic and Rita is onsite to help with anything you need.","original_predictions":4,"modified_sentences":"The hotel is quirky and 4uth3ntic and Rita is onsite to help with anything you need.","modified_predictions":2},{"original_sentences":"The rooms are small, but you're not going to Ilha Grande to sit in your room, and they're perfectly clean.","original_predictions":4,"modified_sentences":"The rooms are small, but you're not going to Ilha Grande to sit in your room, and they're p3rf3ct1y clean.","modified_predictions":2},{"original_sentences":"A real find, especially for the value..","original_predictions":4,"modified_sentences":"A r341 find, especially for the value..","modified_predictions":3},{"original_sentences":"Nice experience.","original_predictions":3,"modified_sentences":"Nic3 experience.","modified_predictions":4},{"original_sentences":"It was great to be slightly removed from the main village, in the middle of the forest.","original_predictions":3,"modified_sentences":"It was great to be 51ight1y removed from the main village, in the middle of the forest.","modified_predictions":4},{"original_sentences":"Rodrigo (the owner) and Maria (the manager) were so attentive, helpful, and fun to talk to.","original_predictions":4,"modified_sentences":"Rodrigo (the owner) and Maria (the manager) were 50 attentive, helpful, and fun to talk to.","modified_predictions":3},{"original_sentences":"The rooms are simple and clean.","original_predictions":3,"modified_sentences":"The r00m5 are simple and clean.","modified_predictions":4},{"original_sentences":"It's a perfectly homey, beautiful place to stay to enjoy the island.. After a really uncomfortable night at a different hostel, arriving at Ouro Verde was like walking into your own living room.","original_predictions":4,"modified_sentences":"It's a p3rf3ct1y homey, beautiful place to stay to enjoy the island.. After a really uncomfortable night at a different hostel, arriving at Ouro Verde was like walking into your own living room.","modified_predictions":3},{"original_sentences":"The best thing about our stay however was that every morning Rodrigo and Rita would have breakfast and chat about the day before, we felt so at ease and at home here, 100% would recommend!!.","original_predictions":3,"modified_sentences":"The best thing about our stay h0w3v3r was that every morning Rodrigo and Rita would have breakfast and chat about the day before, we felt so at ease and at home here, 100% would recommend!!.","modified_predictions":4},{"original_sentences":"Driving along the street to the pousada, I was worried...a lot of poor buildings, but a lovely surprise when I got to the address.","original_predictions":3,"modified_sentences":"Driving along the street to the pousada, I was worried...a lot of poor buildings, but a 10v31y surprise when I got to the address.","modified_predictions":2},{"original_sentences":"The family operating the business live downstairs, pousada upstairs.","original_predictions":3,"modified_sentences":"The family operating the business live downstairs, pousada up5t4ir5.","modified_predictions":4},{"original_sentences":"I recommend staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","original_predictions":3,"modified_sentences":"I r3c0mm3nd staying here and driving into Ouro Preto early in the morning, parking the car and walking around, rather than staying in Ouro itself.","modified_predictions":0},{"original_sentences":"Would stay there again no problem..","original_predictions":3,"modified_sentences":"Would stay there again no pr0b13m..","modified_predictions":1},{"original_sentences":"I thought this hotel was excellent value for money considering the amount we had paid the night before to stay in a sub-standard room in the middle of nowhere in Rivesaltes.","original_predictions":3,"modified_sentences":"I thought this hotel was excellent value for money c0n5id3ring the amount we had paid the night before to stay in a sub-standard room in the middle of nowhere in Rivesaltes.","modified_predictions":4},{"original_sentences":"We had a room with a Juliet balcony at the front and the bed was super comfy.","original_predictions":4,"modified_sentences":"We had a room with a Juliet balcony at the front and the bed was 5up3r comfy.","modified_predictions":3},{"original_sentences":"Would stay here again if ever we return to Perpignan.. My family and I stayed here for a night on our way from Spain to Montpellier.","original_predictions":0,"modified_sentences":"Would stay here again if ever we return to Perpignan.. My family and I stayed here for a night on our way from Sp4in to Montpellier.","modified_predictions":4},{"original_sentences":"Good location.","original_predictions":3,"modified_sentences":"Good 10c4ti0n.","modified_predictions":4},{"original_sentences":"Friendly front office staff.","original_predictions":3,"modified_sentences":"Friendly front office 5t4ff.","modified_predictions":4},{"original_sentences":"extractor fan in the bathroom was not working.","original_predictions":0,"modified_sentences":"extractor fan in the bathroom was n0t working.","modified_predictions":4},{"original_sentences":"Had to cover it with a cloth to get some semblance of complete darkness.","original_predictions":2,"modified_sentences":"Had to cover it with a cloth to get 50m3 semblance of complete darkness.","modified_predictions":1},{"original_sentences":"The bathroom door also scraped on the floor and made a lot of noise.","original_predictions":0,"modified_sentences":"The bathroom door also scraped on the floor and made a lot of n0i53.","modified_predictions":1},{"original_sentences":"The hotel is also  very neat and clean.","original_predictions":4,"modified_sentences":"The hotel is also  very neat and c134n.","modified_predictions":3},{"original_sentences":"The hotel is situated a few minutes’ walk from the old centre.","original_predictions":3,"modified_sentences":"The hotel is situated a few minutes’ walk from the 01d centre.","modified_predictions":2},{"original_sentences":"The room we had was not in accordance with a 4-star rating however the price was reasonable cheap for an adequate room, so you can say you get what you pay for.","original_predictions":3,"modified_sentences":"The room we had was not in accordance with a 4-5t4r rating however the price was reasonable cheap for an adequate room, so you can say you get what you pay for.","modified_predictions":2},{"original_sentences":"In a pretty forgettable place really, not much charm, catering probably more for the business market.. We stayed within 5 days in Germany.","original_predictions":1,"modified_sentences":"In a pretty forgettable place really, n0t much charm, catering probably more for the business market.. We stayed within 5 days in Germany.","modified_predictions":2},{"original_sentences":"But this hotel is amazing.","original_predictions":4,"modified_sentences":"But this hotel is 4m4zing.","modified_predictions":2},{"original_sentences":"Small rooms but well designed.","original_predictions":3,"modified_sentences":"Small rooms but w311 designed.","modified_predictions":2},{"original_sentences":"Very clean.","original_predictions":4,"modified_sentences":"Very c134n.","modified_predictions":2},{"original_sentences":"Good value.","original_predictions":3,"modified_sentences":"G00d value.","modified_predictions":4},{"original_sentences":"Staff speak English.","original_predictions":3,"modified_sentences":"St4ff speak English.","modified_predictions":4},{"original_sentences":"No elevator.. We chose this Hotel primarily because it had secure car parking.","original_predictions":1,"modified_sentences":"N0 elevator.. We chose this Hotel primarily because it had secure car parking.","modified_predictions":3},{"original_sentences":"The location was  perfect, only a five minute  walk  into the centre where there are lots of restaurants and bars not to mention  the  beautiful old streets of Hannover.","original_predictions":3,"modified_sentences":"The location was  perfect, only a five minute  walk  into the centre where there are lots of restaurants and b4r5 not to mention  the  beautiful old streets of Hannover.","modified_predictions":4},{"original_sentences":"However, I found it odd that there was no staff overnight and emergency contact was not provided.","original_predictions":2,"modified_sentences":"However, I found it 0dd that there was no staff overnight and emergency contact was not provided.","modified_predictions":1},{"original_sentences":"Also the main entrance seemed to also be the emergency exit..","original_predictions":2,"modified_sentences":"Also the main entrance 533m3d to also be the emergency exit..","modified_predictions":4},{"original_sentences":"The Internet is slow and spotty.","original_predictions":1,"modified_sentences":"The Internet is 510w and spotty.","modified_predictions":4},{"original_sentences":"I was staying at a different hostel and there was no problem with the internet so it is not a Quito thing.","original_predictions":1,"modified_sentences":"I was staying at a different hostel and there was no problem with the internet so it is n0t a Quito thing.","modified_predictions":4},{"original_sentences":"Most people who work there are very nice but don't speak English (except of the lady who seems to manage this place, and one of the employees).","original_predictions":3,"modified_sentences":"Most people who work there are very nice but don't speak English (3xc3pt of the lady who seems to manage this place, and one of the employees).","modified_predictions":2},{"original_sentences":"They were not able to provide much information about the day excursions, something that I value the most when I travel and stay in different hostels.","original_predictions":2,"modified_sentences":"They were not able to provide much information about the day excursions, something that I v41u3 the most when I travel and stay in different hostels.","modified_predictions":1},{"original_sentences":"Within first 30 minutes of being in a hostel I can find out about all the best things to do, and all the excursion available.","original_predictions":4,"modified_sentences":"Within first 30 minutes of being in a hostel I can find out about 411 the best things to do, and 411 the excursion available.","modified_predictions":3},{"original_sentences":"Not here.","original_predictions":0,"modified_sentences":"N0t here.","modified_predictions":4},{"original_sentences":"Staff is fantastic.","original_predictions":4,"modified_sentences":"Staff is f4nt45tic.","modified_predictions":3},{"original_sentences":"Rooms are average.","original_predictions":2,"modified_sentences":"Rooms are 4v3r4g3.","modified_predictions":3},{"original_sentences":"All cash, and had an issue with accounting on check-out, so be patient..","original_predictions":4,"modified_sentences":"All cash, and had an issue with accounting on check-out, so be p4ti3nt..","modified_predictions":0},{"original_sentences":"Nice comfortable bed and clean bathroom in a private room.","original_predictions":3,"modified_sentences":"Nice comfortable bed and clean bathroom in a private r00m.","modified_predictions":4},{"original_sentences":"Would definitely stay here again if I visit Quito.","original_predictions":2,"modified_sentences":"W0u1d definitely stay here again if I visit Quito.","modified_predictions":4},{"original_sentences":"I stayed here for a night when I was in Quito.","original_predictions":0,"modified_sentences":"I 5t4y3d here for a night when I was in Quito.","modified_predictions":4},{"original_sentences":"He made sure I got everything I needed and gave me tips when he saw me leaving the hostel to go explore.","original_predictions":3,"modified_sentences":"He made sure I g0t everything I needed and gave me tips when he saw me leaving the hostel to go explore.","modified_predictions":4},{"original_sentences":"I also got to meet a few people at the hostel and we went to a nice club literally 2 mins away from the hostel by foot.","original_predictions":4,"modified_sentences":"I also got to meet a few people at the hostel and we went to a nic3 club literally 2 mins away from the hostel by foot.","modified_predictions":0},{"original_sentences":"Overall, great experience.","original_predictions":3,"modified_sentences":"Ov3r411, great experience.","modified_predictions":4},{"original_sentences":"This hotel is across the valley from the center, but that means a great view.","original_predictions":3,"modified_sentences":"This hotel is across the valley from the center, but that means a great vi3w.","modified_predictions":4},{"original_sentences":"There is secure parking and decent wifi.","original_predictions":3,"modified_sentences":"There is secure parking and d3c3nt wifi.","modified_predictions":4},{"original_sentences":"The breakfast is very good.","original_predictions":3,"modified_sentences":"The br34kf45t is very good.","modified_predictions":4},{"original_sentences":"The location is walkable to the center.","original_predictions":2,"modified_sentences":"The location is walkable to the c3nt3r.","modified_predictions":3},{"original_sentences":"Many were surprisingly pricey.","original_predictions":2,"modified_sentences":"Many w3r3 surprisingly pricey.","modified_predictions":4},{"original_sentences":"The suggestion of Mirante Hotel seemed nice.","original_predictions":2,"modified_sentences":"The suggestion of Mirante Hotel 533m3d nice.","modified_predictions":3},{"original_sentences":"We chose two rooms (party of four).","original_predictions":2,"modified_sentences":"We chose two rooms (p4rty of four).","modified_predictions":3},{"original_sentences":"Twin beds with minimal furnishings adorned the first bedroom.","original_predictions":2,"modified_sentences":"Twin beds with minim41 furnishings adorned the first bedroom.","modified_predictions":4},{"original_sentences":"It faced a street on the backside of the hotel (no view).","original_predictions":0,"modified_sentences":"It faced a street on the backside of the hotel (no vi3w).","modified_predictions":1},{"original_sentences":"Our other bedroom was somewhat cramped...with queen bed, a chair and small table and faced the parking lot.","original_predictions":2,"modified_sentences":"Our other bedroom was 50m3wh4t cramped...with queen bed, a chair and small table and faced the parking lot.","modified_predictions":1},{"original_sentences":"It was very bright and airy.","original_predictions":4,"modified_sentences":"It was very bright 4nd airy.","modified_predictions":3},{"original_sentences":"There was a smallish public lounge and a few other tourists gathered there momentarily.","original_predictions":2,"modified_sentences":"There was a smallish public lounge and a f3w other tourists gathered there momentarily.","modified_predictions":1},{"original_sentences":"All rooms featured air conditioning, in-room phone, and basic television with very limited channel selection.","original_predictions":2,"modified_sentences":"All rooms featured air conditioning, in-room phone, and basic television with very 1imit3d channel selection.","modified_predictions":4},{"original_sentences":"A small chair and\/or small table is featured in most rooms.","original_predictions":2,"modified_sentences":"A small chair and\/or small table i5 featured in most rooms.","modified_predictions":3},{"original_sentences":"Scrambled eggs were offered, also.","original_predictions":0,"modified_sentences":"Scr4mb13d eggs were offered, also.","modified_predictions":4},{"original_sentences":"During breakfast, take a table by the window and enjoy the fabulous view of town.","original_predictions":4,"modified_sentences":"During breakfast, take a table by the window and enjoy the f4bu10u5 view of town.","modified_predictions":3},{"original_sentences":"However, between 8 AM and 8 PM, we found the front bedroom occasionally disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","original_predictions":2,"modified_sentences":"However, between 8 AM and 8 PM, we found the front bedroom 0cc45i0n411y disturbed by a few noisy vehicles passing by, especially as they climbed the hilly street.","modified_predictions":1},{"original_sentences":"The rooms were very value-priced.","original_predictions":4,"modified_sentences":"The rooms were very v41u3-pric3d.","modified_predictions":1},{"original_sentences":"Dinner in the restaurant proved very reasonable and very delicious.","original_predictions":4,"modified_sentences":"Dinner in the restaurant proved very reasonable and very d31ici0u5.","modified_predictions":1},{"original_sentences":"It was really nothing more than a place for little kids to splash around in.","original_predictions":1,"modified_sentences":"It was really n0thing more than a place for little kids to splash around in.","modified_predictions":0},{"original_sentences":"We recommend this hotel for anyone on a budget or who wouldn't mind a hotel just a little off the beaten path.","original_predictions":3,"modified_sentences":"We recommend this hotel for anyone on a budget or who wouldn't mind a hotel just a 1itt13 off the beaten path.","modified_predictions":4},{"original_sentences":"Rooms facing the sides and back are quiet.","original_predictions":3,"modified_sentences":"Rooms facing the sides and back are qui3t.","modified_predictions":2},{"original_sentences":"We rated \"Incredible staff\" because the assistant manager was a Godsend when our car broke down.","original_predictions":4,"modified_sentences":"We rated \"Incredible staff\" because the assistant manager was a Godsend wh3n our car broke down.","modified_predictions":0}]